/* automatically generated by rust-bindgen 0.72.1 */

use sdl_sys_bindgen::*;

pub const SDL_MIXER_MAJOR_VERSION: u32 = 3;
pub const SDL_MIXER_MINOR_VERSION: u32 = 3;
pub const SDL_MIXER_MICRO_VERSION: u32 = 0;
pub const MIX_PROP_MIXER_DEVICE_NUMBER: &[u8; 23] = b"SDL_mixer.mixer.device\0";
pub const MIX_PROP_AUDIO_LOAD_IOSTREAM_POINTER: &[u8; 30] = b"SDL_mixer.audio.load.iostream\0";
pub const MIX_PROP_AUDIO_LOAD_CLOSEIO_BOOLEAN: &[u8; 29] = b"SDL_mixer.audio.load.closeio\0";
pub const MIX_PROP_AUDIO_LOAD_PREDECODE_BOOLEAN: &[u8; 31] = b"SDL_mixer.audio.load.predecode\0";
pub const MIX_PROP_AUDIO_LOAD_PREFERRED_MIXER_POINTER: &[u8; 37] =
    b"SDL_mixer.audio.load.preferred_mixer\0";
pub const MIX_PROP_AUDIO_LOAD_SKIP_METADATA_TAGS_BOOLEAN: &[u8; 40] =
    b"SDL_mixer.audio.load.skip_metadata_tags\0";
pub const MIX_PROP_AUDIO_DECODER_STRING: &[u8; 24] = b"SDL_mixer.audio.decoder\0";
pub const MIX_PROP_METADATA_TITLE_STRING: &[u8; 25] = b"SDL_mixer.metadata.title\0";
pub const MIX_PROP_METADATA_ARTIST_STRING: &[u8; 26] = b"SDL_mixer.metadata.artist\0";
pub const MIX_PROP_METADATA_ALBUM_STRING: &[u8; 25] = b"SDL_mixer.metadata.album\0";
pub const MIX_PROP_METADATA_COPYRIGHT_STRING: &[u8; 29] = b"SDL_mixer.metadata.copyright\0";
pub const MIX_PROP_METADATA_TRACK_NUMBER: &[u8; 25] = b"SDL_mixer.metadata.track\0";
pub const MIX_PROP_METADATA_TOTAL_TRACKS_NUMBER: &[u8; 32] = b"SDL_mixer.metadata.total_tracks\0";

    #[doc = "Query the frequency ratio of a track.\n\nThe frequency ratio is used to adjust the rate at which audio data is\nconsumed. Changing this effectively modifies the speed and pitch of the\ntrack's audio. A value greater than 1.0f will play the audio faster, and at\na higher pitch. A value less than 1.0f will play the audio slower, and at a\nlower pitch. 1.0f is normal speed.\n\nThe default value is 1.0f.\n\nOn various errors (MIX_Init() was not called, the track is NULL), this\nreturns 0.0f. Since this is not a valid value to set, this can be seen as\nan error state.\n\n**Parameter:** track the track on which to query the frequency ratio.\n\n**Returns:** the current frequency ratio, or 0.0f on failure; call\nSDL_GetError() for more information.\n\n**Thread Safety:** It is safe to call this function from any thread.\n\n**Available Since:** This function is available since SDL_mixer 3.0.0.\n\n**See Also:** MIX_GetTrackFrequencyRatio"]
    pub fn MIX_GetTrackFrequencyRatio(track: *mut MIX_Track) -> f32;
}
unsafe extern "C" {
    #[doc = "Set the current output channel map of a track.\n\nChannel maps are optional; most things do not need them, instead passing\ndata in the order that SDL expects.\n\nThe output channel map reorders track data after transformations and before\nit is mixed into a mixer group. This can be useful for reversing stereo\nchannels, for example.\n\nEach item in the array represents an input channel, and its value is the\nchannel that it should be remapped to. To reverse a stereo signal's left\nand right values, you'd have an array of `{ 1, 0 }`. It is legal to remap\nmultiple channels to the same thing, so `{ 1, 1 }` would duplicate the\nright channel to both channels of a stereo signal. An element in the\nchannel map set to -1 instead of a valid channel will mute that channel,\nsetting it to a silence value.\n\nYou cannot change the number of channels through a channel map, just\nreorder/mute them.\n\nTracks default to no remapping applied. Passing a NULL channel map is\nlegal, and turns off remapping.\n\nSDL_mixer will copy the channel map; the caller does not have to save this\narray after this call.\n\n**Parameter:** track the track to change.\n\n**Parameter:** chmap the new channel map, NULL to reset to default.\n\n**Parameter:** count The number of channels in the map.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** It is safe to call this function from any thread.\n\n**Available Since:** This function is available since SDL_mixer 3.0.0."]
    pub fn MIX_SetTrackOutputChannelMap(
        track: *mut MIX_Track,
        chmap: *const core::ffi::c_int,
        count: core::ffi::c_int,
    ) -> bool;
}
#[doc = "A set of per-channel gains for tracks using MIX_SetTrackStereo().\n\nWhen forcing a track to stereo, the app can specify a per-channel gain, to\nfurther adjust the left or right outputs.\n\nWhen mixing audio that has been forced to stereo, each channel is modulated\nby these values. A value of 1.0f produces no change, 0.0f produces silence.\n\nA simple panning effect would be to set `left` to the desired value and\n`right` to `1.0f - left`.\n\n**Available Since:** This struct is available since SDL_mixer 3.0.0.\n\n**See Also:** MIX_SetTrackStereo"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MIX_StereoGains {
    #[doc = "< left channel gain"]
    pub left: f32,
    #[doc = "< right channel gain"]
    pub right: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MIX_StereoGains"][::core::mem::size_of::<MIX_StereoGains>() - 8usize];
    ["Alignment of MIX_StereoGains"][::core::mem::align_of::<MIX_StereoGains>() - 4usize];
    ["Offset of field: MIX_StereoGains::left"]
        [::core::mem::offset_of!(MIX_StereoGains, left) - 0usize];
    ["Offset of field: MIX_StereoGains::right"]
        [::core::mem::offset_of!(MIX_StereoGains, right) - 4usize];
};
unsafe extern "C" {
    #[doc = "Force a track to stereo output, with optionally left/right panning.\n\nThis will cause the output of the track to convert to stereo, and then mix\nit only onto the Front Left and Front Right speakers, regardless of the\nspeaker configuration. The left and right channels are modulated by\n`gains`, which can be used to produce panning effects. This function may be\ncalled to adjust the gains at any time.\n\nIf `gains` is not NULL, this track will be switched into forced-stereo\nmode. If `gains` is NULL, this will disable spatialization (both the\nforced-stereo mode of this function and full 3D spatialization of\nMIX_SetTrack3DPosition()).\n\nNegative gains are clamped to zero; there is no clamp for maximum, so one\n\ncould set the value > 1.0f to make a channel louder.\n\nThe track's 3D position, reported by MIX_GetTrack3DPosition(), will be\nreset to (0, 0, 0).\n\n**Parameter:** track the track to adjust.\n\n**Parameter:** gains the per-channel gains, or NULL to disable spatialization.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** It is safe to call this function from any thread.\n\n**Available Since:** This function is available since SDL_mixer 3.0.0.\n\n**See Also:** MIX_SetTrack3DPosition"]
    pub fn MIX_SetTrackStereo(track: *mut MIX_Track, gains: *const MIX_StereoGains) -> bool;
}
#[doc = "3D coordinates for MIX_SetTrack3DPosition.\n\nThe coordinates use a \"right-handed\" coordinate system, like OpenGL and\nOpenAL.\n\n**Available Since:** This struct is available since SDL_mixer 3.0.0.\n\n**See Also:** MIX_SetTrack3DPosition"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct MIX_Point3D {
    #[doc = "< X coordinate (negative left, positive right)."]
    pub x: f32,
    #[doc = "< Y coordinate (negative down, positive up)."]
    pub y: f32,
    #[doc = "< Z coordinate (negative forward, positive back)."]
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MIX_Point3D"][::core::mem::size_of::<MIX_Point3D>() - 12usize];
    ["Alignment of MIX_Point3D"][::core::mem::align_of::<MIX_Point3D>() - 4usize];
    ["Offset of field: MIX_Point3D::x"][::core::mem::offset_of!(MIX_Point3D, x) - 0usize];
    ["Offset of field: MIX_Point3D::y"][::core::mem::offset_of!(MIX_Point3D, y) - 4usize];
    ["Offset of field: MIX_Point3D::z"][::core::mem::offset_of!(MIX_Point3D, z) - 8usize];
};
unsafe extern "C" {
