/* automatically generated by rust-bindgen 0.72.1 */

use sdl_sys_bindgen::*;

pub const SDL3_GFXPRIMITIVES_MAJOR: u32 = 1;
pub const SDL3_GFXPRIMITIVES_MINOR: u32 = 0;
pub const SDL3_GFXPRIMITIVES_MICRO: u32 = 0;
#[doc = " An unsigned 8-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Uint8 = u8;
#[doc = " A signed 32-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Sint32 = i32;
#[doc = " An unsigned 32-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Uint32 = u32;
impl SDL_PixelFormat {
    pub const SDL_PIXELFORMAT_UNKNOWN: SDL_PixelFormat = SDL_PixelFormat(0);
    pub const SDL_PIXELFORMAT_INDEX1LSB: SDL_PixelFormat = SDL_PixelFormat(286261504);
    pub const SDL_PIXELFORMAT_INDEX1MSB: SDL_PixelFormat = SDL_PixelFormat(287310080);
    pub const SDL_PIXELFORMAT_INDEX2LSB: SDL_PixelFormat = SDL_PixelFormat(470811136);
    pub const SDL_PIXELFORMAT_INDEX2MSB: SDL_PixelFormat = SDL_PixelFormat(471859712);
    pub const SDL_PIXELFORMAT_INDEX4LSB: SDL_PixelFormat = SDL_PixelFormat(303039488);
    pub const SDL_PIXELFORMAT_INDEX4MSB: SDL_PixelFormat = SDL_PixelFormat(304088064);
    pub const SDL_PIXELFORMAT_INDEX8: SDL_PixelFormat = SDL_PixelFormat(318769153);
    pub const SDL_PIXELFORMAT_RGB332: SDL_PixelFormat = SDL_PixelFormat(336660481);
    pub const SDL_PIXELFORMAT_XRGB4444: SDL_PixelFormat = SDL_PixelFormat(353504258);
    pub const SDL_PIXELFORMAT_XBGR4444: SDL_PixelFormat = SDL_PixelFormat(357698562);
    pub const SDL_PIXELFORMAT_XRGB1555: SDL_PixelFormat = SDL_PixelFormat(353570562);
    pub const SDL_PIXELFORMAT_XBGR1555: SDL_PixelFormat = SDL_PixelFormat(357764866);
    pub const SDL_PIXELFORMAT_ARGB4444: SDL_PixelFormat = SDL_PixelFormat(355602434);
    pub const SDL_PIXELFORMAT_RGBA4444: SDL_PixelFormat = SDL_PixelFormat(356651010);
    pub const SDL_PIXELFORMAT_ABGR4444: SDL_PixelFormat = SDL_PixelFormat(359796738);
    pub const SDL_PIXELFORMAT_BGRA4444: SDL_PixelFormat = SDL_PixelFormat(360845314);
    pub const SDL_PIXELFORMAT_ARGB1555: SDL_PixelFormat = SDL_PixelFormat(355667970);
    pub const SDL_PIXELFORMAT_RGBA5551: SDL_PixelFormat = SDL_PixelFormat(356782082);
    pub const SDL_PIXELFORMAT_ABGR1555: SDL_PixelFormat = SDL_PixelFormat(359862274);
    pub const SDL_PIXELFORMAT_BGRA5551: SDL_PixelFormat = SDL_PixelFormat(360976386);
    pub const SDL_PIXELFORMAT_RGB565: SDL_PixelFormat = SDL_PixelFormat(353701890);
    pub const SDL_PIXELFORMAT_BGR565: SDL_PixelFormat = SDL_PixelFormat(357896194);
    pub const SDL_PIXELFORMAT_RGB24: SDL_PixelFormat = SDL_PixelFormat(386930691);
    pub const SDL_PIXELFORMAT_BGR24: SDL_PixelFormat = SDL_PixelFormat(390076419);
    pub const SDL_PIXELFORMAT_XRGB8888: SDL_PixelFormat = SDL_PixelFormat(370546692);
    pub const SDL_PIXELFORMAT_RGBX8888: SDL_PixelFormat = SDL_PixelFormat(371595268);
    pub const SDL_PIXELFORMAT_XBGR8888: SDL_PixelFormat = SDL_PixelFormat(374740996);
    pub const SDL_PIXELFORMAT_BGRX8888: SDL_PixelFormat = SDL_PixelFormat(375789572);
    pub const SDL_PIXELFORMAT_ARGB8888: SDL_PixelFormat = SDL_PixelFormat(372645892);
    pub const SDL_PIXELFORMAT_RGBA8888: SDL_PixelFormat = SDL_PixelFormat(373694468);
    pub const SDL_PIXELFORMAT_ABGR8888: SDL_PixelFormat = SDL_PixelFormat(376840196);
    pub const SDL_PIXELFORMAT_BGRA8888: SDL_PixelFormat = SDL_PixelFormat(377888772);
    pub const SDL_PIXELFORMAT_XRGB2101010: SDL_PixelFormat = SDL_PixelFormat(370614276);
    pub const SDL_PIXELFORMAT_XBGR2101010: SDL_PixelFormat = SDL_PixelFormat(374808580);
    pub const SDL_PIXELFORMAT_ARGB2101010: SDL_PixelFormat = SDL_PixelFormat(372711428);
    pub const SDL_PIXELFORMAT_ABGR2101010: SDL_PixelFormat = SDL_PixelFormat(376905732);
    pub const SDL_PIXELFORMAT_RGB48: SDL_PixelFormat = SDL_PixelFormat(403714054);
    pub const SDL_PIXELFORMAT_BGR48: SDL_PixelFormat = SDL_PixelFormat(406859782);
    pub const SDL_PIXELFORMAT_RGBA64: SDL_PixelFormat = SDL_PixelFormat(404766728);
    pub const SDL_PIXELFORMAT_ARGB64: SDL_PixelFormat = SDL_PixelFormat(405815304);
    pub const SDL_PIXELFORMAT_BGRA64: SDL_PixelFormat = SDL_PixelFormat(407912456);
    pub const SDL_PIXELFORMAT_ABGR64: SDL_PixelFormat = SDL_PixelFormat(408961032);
    pub const SDL_PIXELFORMAT_RGB48_FLOAT: SDL_PixelFormat = SDL_PixelFormat(437268486);
    pub const SDL_PIXELFORMAT_BGR48_FLOAT: SDL_PixelFormat = SDL_PixelFormat(440414214);
    pub const SDL_PIXELFORMAT_RGBA64_FLOAT: SDL_PixelFormat = SDL_PixelFormat(438321160);
    pub const SDL_PIXELFORMAT_ARGB64_FLOAT: SDL_PixelFormat = SDL_PixelFormat(439369736);
    pub const SDL_PIXELFORMAT_BGRA64_FLOAT: SDL_PixelFormat = SDL_PixelFormat(441466888);
    pub const SDL_PIXELFORMAT_ABGR64_FLOAT: SDL_PixelFormat = SDL_PixelFormat(442515464);
    pub const SDL_PIXELFORMAT_RGB96_FLOAT: SDL_PixelFormat = SDL_PixelFormat(454057996);
    pub const SDL_PIXELFORMAT_BGR96_FLOAT: SDL_PixelFormat = SDL_PixelFormat(457203724);
    pub const SDL_PIXELFORMAT_RGBA128_FLOAT: SDL_PixelFormat = SDL_PixelFormat(455114768);
    pub const SDL_PIXELFORMAT_ARGB128_FLOAT: SDL_PixelFormat = SDL_PixelFormat(456163344);
    pub const SDL_PIXELFORMAT_BGRA128_FLOAT: SDL_PixelFormat = SDL_PixelFormat(458260496);
    pub const SDL_PIXELFORMAT_ABGR128_FLOAT: SDL_PixelFormat = SDL_PixelFormat(459309072);
    #[doc = "< Planar mode: Y + V + U  (3 planes)\n"]
    pub const SDL_PIXELFORMAT_YV12: SDL_PixelFormat = SDL_PixelFormat(842094169);
    #[doc = "< Planar mode: Y + U + V  (3 planes)\n"]
    pub const SDL_PIXELFORMAT_IYUV: SDL_PixelFormat = SDL_PixelFormat(1448433993);
    #[doc = "< Packed mode: Y0+U0+Y1+V0 (1 plane)\n"]
    pub const SDL_PIXELFORMAT_YUY2: SDL_PixelFormat = SDL_PixelFormat(844715353);
    #[doc = "< Packed mode: U0+Y0+V0+Y1 (1 plane)\n"]
    pub const SDL_PIXELFORMAT_UYVY: SDL_PixelFormat = SDL_PixelFormat(1498831189);
    #[doc = "< Packed mode: Y0+V0+Y1+U0 (1 plane)\n"]
    pub const SDL_PIXELFORMAT_YVYU: SDL_PixelFormat = SDL_PixelFormat(1431918169);
    #[doc = "< Planar mode: Y + U/V interleaved  (2 planes)\n"]
    pub const SDL_PIXELFORMAT_NV12: SDL_PixelFormat = SDL_PixelFormat(842094158);
    #[doc = "< Planar mode: Y + V/U interleaved  (2 planes)\n"]
    pub const SDL_PIXELFORMAT_NV21: SDL_PixelFormat = SDL_PixelFormat(825382478);
    #[doc = "< Planar mode: Y + U/V interleaved  (2 planes)\n"]
    pub const SDL_PIXELFORMAT_P010: SDL_PixelFormat = SDL_PixelFormat(808530000);
    #[doc = "< Android video texture format\n"]
    pub const SDL_PIXELFORMAT_EXTERNAL_OES: SDL_PixelFormat = SDL_PixelFormat(542328143);
    #[doc = "< Motion JPEG\n"]
    pub const SDL_PIXELFORMAT_MJPG: SDL_PixelFormat = SDL_PixelFormat(1196444237);
    pub const SDL_PIXELFORMAT_RGBA32: SDL_PixelFormat = SDL_PixelFormat(376840196);
    pub const SDL_PIXELFORMAT_ARGB32: SDL_PixelFormat = SDL_PixelFormat(377888772);
    pub const SDL_PIXELFORMAT_BGRA32: SDL_PixelFormat = SDL_PixelFormat(372645892);
    pub const SDL_PIXELFORMAT_ABGR32: SDL_PixelFormat = SDL_PixelFormat(373694468);
    pub const SDL_PIXELFORMAT_RGBX32: SDL_PixelFormat = SDL_PixelFormat(374740996);
    pub const SDL_PIXELFORMAT_XRGB32: SDL_PixelFormat = SDL_PixelFormat(375789572);
    pub const SDL_PIXELFORMAT_BGRX32: SDL_PixelFormat = SDL_PixelFormat(370546692);
    pub const SDL_PIXELFORMAT_XBGR32: SDL_PixelFormat = SDL_PixelFormat(371595268);
}
#[repr(transparent)]
#[doc = " Pixel format.\n\n SDL's pixel formats have the following naming convention:\n\n - Names with a list of components and a single bit count, such as RGB24 and\n   ABGR32, define a platform-independent encoding into bytes in the order\n   specified. For example, in RGB24 data, each pixel is encoded in 3 bytes\n   (red, green, blue) in that order, and in ABGR32 data, each pixel is\n   encoded in 4 bytes (alpha, blue, green, red) in that order. Use these\n   names if the property of a format that is important to you is the order\n   of the bytes in memory or on disk.\n - Names with a bit count per component, such as ARGB8888 and XRGB1555, are\n   \"packed\" into an appropriately-sized integer in the platform's native\n   endianness. For example, ARGB8888 is a sequence of 32-bit integers; in\n   each integer, the most significant bits are alpha, and the least\n   significant bits are blue. On a little-endian CPU such as x86, the least\n   significant bits of each integer are arranged first in memory, but on a\n   big-endian CPU such as s390x, the most significant bits are arranged\n   first. Use these names if the property of a format that is important to\n   you is the meaning of each bit position within a native-endianness\n   integer.\n - In indexed formats such as INDEX4LSB, each pixel is represented by\n   encoding an index into the palette into the indicated number of bits,\n   with multiple pixels packed into each byte if appropriate. In LSB\n   formats, the first (leftmost) pixel is stored in the least-significant\n   bits of the byte; in MSB formats, it's stored in the most-significant\n   bits. INDEX8 does not need LSB/MSB variants, because each pixel exactly\n   fills one byte.\n\n The 32-bit byte-array encodings such as RGBA32 are aliases for the\n appropriate 8888 encoding for the current platform. For example, RGBA32 is\n an alias for ABGR8888 on little-endian CPUs like x86, or an alias for\n RGBA8888 on big-endian CPUs.\n\n **Available Since:** This enum is available since SDL 3.2.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_PixelFormat(pub core::ffi::c_uint);
#[doc = " The flags on an SDL_Surface.\n\n These are generally considered read-only.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n"]
pub type SDL_SurfaceFlags = Uint32;
#[doc = " A collection of pixels used in software blitting.\n\n Pixels are arranged in memory in rows, with the top row first. Each row\n occupies an amount of memory given by the pitch (sometimes known as the row\n stride in non-SDL APIs).\n\n Within each row, pixels are arranged from left to right until the width is\n reached. Each pixel occupies a number of bits appropriate for its format,\n with most formats representing each pixel as one or more whole bytes (in\n some indexed formats, instead multiple pixels are packed into each byte),\n and a byte order given by the format. After encoding all pixels, any\n remaining bytes to reach the pitch are used as padding to reach a desired\n alignment, and have undefined contents.\n\n When a surface holds YUV format data, the planes are assumed to be\n contiguous without padding between them, e.g. a 32x32 surface in NV12\n format with a pitch of 32 would consist of 32x32 bytes of Y plane followed\n by 32x16 bytes of UV plane.\n\n When a surface holds MJPG format data, pixels points at the compressed JPEG\n image and pitch is the length of that data.\n\n **Available Since:** This struct is available since SDL 3.2.0.\n\n **See Also:** SDL_CreateSurface\n **See Also:** SDL_DestroySurface\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct SDL_Surface {
    #[doc = "< The flags of the surface, read-only\n"]
    pub flags: SDL_SurfaceFlags,
    #[doc = "< The format of the surface, read-only\n"]
    pub format: SDL_PixelFormat,
    #[doc = "< The width of the surface, read-only.\n"]
    pub w: core::ffi::c_int,
    #[doc = "< The height of the surface, read-only.\n"]
    pub h: core::ffi::c_int,
    #[doc = "< The distance in bytes between rows of pixels, read-only\n"]
    pub pitch: core::ffi::c_int,
    #[doc = "< A pointer to the pixels of the surface, the pixels are writeable if non-NULL\n"]
    pub pixels: *mut core::ffi::c_void,
    #[doc = "< Application reference count, used when freeing surface\n"]
    pub refcount: core::ffi::c_int,
    #[doc = "< Reserved for internal use\n"]
    pub reserved: *mut core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Surface"][::core::mem::size_of::<SDL_Surface>() - 48usize];
    ["Alignment of SDL_Surface"][::core::mem::align_of::<SDL_Surface>() - 8usize];
    ["Offset of field: SDL_Surface::flags"][::core::mem::offset_of!(SDL_Surface, flags) - 0usize];
    ["Offset of field: SDL_Surface::format"][::core::mem::offset_of!(SDL_Surface, format) - 4usize];
    ["Offset of field: SDL_Surface::w"][::core::mem::offset_of!(SDL_Surface, w) - 8usize];
    ["Offset of field: SDL_Surface::h"][::core::mem::offset_of!(SDL_Surface, h) - 12usize];
    ["Offset of field: SDL_Surface::pitch"][::core::mem::offset_of!(SDL_Surface, pitch) - 16usize];
    ["Offset of field: SDL_Surface::pixels"]
        [::core::mem::offset_of!(SDL_Surface, pixels) - 24usize];
    ["Offset of field: SDL_Surface::refcount"]
        [::core::mem::offset_of!(SDL_Surface, refcount) - 32usize];
    ["Offset of field: SDL_Surface::reserved"]
        [::core::mem::offset_of!(SDL_Surface, reserved) - 40usize];
};
impl Default for SDL_Surface {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Renderer {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn pixelColor(renderer: *mut SDL_Renderer, x: f32, y: f32, color: Uint32) -> bool;
}
unsafe extern "C" {
    pub fn pixelRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn hlineColor(renderer: *mut SDL_Renderer, x1: f32, x2: f32, y: f32, color: Uint32)
    -> bool;
}
unsafe extern "C" {
    pub fn hlineRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        x2: f32,
        y: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn vlineColor(renderer: *mut SDL_Renderer, x: f32, y1: f32, y2: f32, color: Uint32)
    -> bool;
}
unsafe extern "C" {
    pub fn vlineRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y1: f32,
        y2: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn rectangleColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn rectangleRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn roundedRectangleColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        rad: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn roundedRectangleRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        rad: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn boxColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn boxRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn roundedBoxColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        rad: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn roundedBoxRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        rad: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lineColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn lineRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aalineColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aalineRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn thickLineColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        width: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn thickLineRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        width: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn circleColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn circleRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn arcColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn arcRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aacircleColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aacircleRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledCircleColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        r: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledCircleRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ellipseColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn ellipseRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aaellipseColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aaellipseRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledEllipseColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledEllipseRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rx: f32,
        ry: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn pieColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn pieRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledPieColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledPieRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        rad: f32,
        start: Sint32,
        end: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn trigonColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn trigonRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aatrigonColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aatrigonRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledTrigonColor(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledTrigonRGBA(
        renderer: *mut SDL_Renderer,
        x1: f32,
        y1: f32,
        x2: f32,
        y2: f32,
        x3: f32,
        y3: f32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn polygonColor(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn polygonRGBA(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aapolygonColor(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn aapolygonRGBA(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledPolygonColor(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn filledPolygonRGBA(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn texturedPolygon(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        texture: *mut SDL_Surface,
        texture_dx: Sint32,
        texture_dy: Sint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn bezierColor(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        s: Sint32,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn bezierRGBA(
        renderer: *mut SDL_Renderer,
        vx: *const f32,
        vy: *const f32,
        n: Sint32,
        s: Sint32,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn gfxPrimitivesSetFont(fontdata: *const core::ffi::c_void, cw: Uint32, ch: Uint32);
}
unsafe extern "C" {
    pub fn gfxPrimitivesSetFontRotation(rotation: Uint32);
}
unsafe extern "C" {
    pub fn characterColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        c: core::ffi::c_char,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn characterRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        c: core::ffi::c_char,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
unsafe extern "C" {
    pub fn stringColor(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        s: *const core::ffi::c_char,
        color: Uint32,
    ) -> bool;
}
unsafe extern "C" {
    pub fn stringRGBA(
        renderer: *mut SDL_Renderer,
        x: f32,
        y: f32,
        s: *const core::ffi::c_char,
        r: Uint8,
        g: Uint8,
        b: Uint8,
        a: Uint8,
    ) -> bool;
}
