/* automatically generated by rust-bindgen 0.72.1 */

pub const SDL_PLATFORM_WINDOWS: u32 = 1;
pub const HAVE_WINAPIFAMILY_H: u32 = 0;
pub const WINAPI_FAMILY_WINRT: u32 = 0;
pub const SDL_WINAPI_FAMILY_PHONE: u32 = 0;
pub const SDL_PLATFORM_WIN32: u32 = 1;
pub const __MINGW64_VERSION_MAJOR: u32 = 13;
pub const __MINGW64_VERSION_MINOR: u32 = 0;
pub const __MINGW64_VERSION_BUGFIX: u32 = 0;
pub const __MINGW64_VERSION_RC: u32 = 0;
pub const __MINGW64_VERSION_STATE: &[u8; 6] = b"alpha\0";
pub const __MINGW32_MAJOR_VERSION: u32 = 3;
pub const __MINGW32_MINOR_VERSION: u32 = 11;
pub const _M_AMD64: u32 = 100;
pub const _M_X64: u32 = 100;
pub const __: u32 = 1;
pub const __MINGW_USE_UNDERSCORE_PREFIX: u32 = 0;
pub const __MINGW_HAVE_ANSI_C99_PRINTF: u32 = 1;
pub const __MINGW_HAVE_WIDE_C99_PRINTF: u32 = 1;
pub const __MINGW_HAVE_ANSI_C99_SCANF: u32 = 1;
pub const __MINGW_HAVE_WIDE_C99_SCANF: u32 = 1;
pub const __MINGW_SEC_WARN_STR : & [u8 ; 92] = b"This function or variable may be unsafe, use _CRT_SECURE_NO_WARNINGS to disable deprecation\0" ;
pub const __MINGW_MSVC2005_DEPREC_STR : & [u8 ; 117] = b"This POSIX function is deprecated beginning in Visual C++ 2005, use _CRT_NONSTDC_NO_DEPRECATE to disable deprecation\0" ;
pub const __MINGW_FORTIFY_LEVEL: u32 = 0;
pub const __MINGW_FORTIFY_VA_ARG: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;

pub const SDL_PROP_TEXTURE_OPENGLES2_TEXTURE_TARGET_NUMBER: &[u8; 29] =
    b"SDL.texture.opengles2.target\0";
pub const SDL_PROP_TEXTURE_VULKAN_TEXTURE_NUMBER: &[u8; 27] = b"SDL.texture.vulkan.texture\0";
pub const SDL_PROP_TEXTURE_GPU_TEXTURE_POINTER: &[u8; 24] = b"SDL.texture.gpu.texture\0";
pub const SDL_PROP_TEXTURE_GPU_TEXTURE_UV_POINTER: &[u8; 27] = b"SDL.texture.gpu.texture_uv\0";
pub const SDL_PROP_TEXTURE_GPU_TEXTURE_U_POINTER: &[u8; 26] = b"SDL.texture.gpu.texture_u\0";
pub const SDL_PROP_TEXTURE_GPU_TEXTURE_V_POINTER: &[u8; 26] = b"SDL.texture.gpu.texture_v\0";
pub const SDL_RENDERER_VSYNC_DISABLED: u32 = 0;
pub const SDL_RENDERER_VSYNC_ADAPTIVE: i32 = -1;
pub const SDL_DEBUG_TEXT_FONT_CHARACTER_SIZE: u32 = 8;
pub const SDL_MS_PER_SECOND: u32 = 1000;
pub const SDL_US_PER_SECOND: u32 = 1000000;
pub const SDL_NS_PER_SECOND: u32 = 1000000000;
pub const SDL_NS_PER_MS: u32 = 1000000;
pub const SDL_NS_PER_US: u32 = 1000;
pub const SDL_TRAYENTRY_BUTTON: u32 = 1;
pub const SDL_TRAYENTRY_CHECKBOX: u32 = 2;
pub const SDL_TRAYENTRY_SUBMENU: u32 = 4;
pub const SDL_TRAYENTRY_DISABLED: u32 = 2147483648;
pub const SDL_TRAYENTRY_CHECKED: u32 = 1073741824;
pub const SDL_PROP_TRAY_CREATE_ICON_POINTER: &[u8; 21] = b"SDL.tray.create.icon\0";
pub const SDL_PROP_TRAY_CREATE_TOOLTIP_STRING: &[u8; 24] = b"SDL.tray.create.tooltip\0";
pub const SDL_PROP_TRAY_CREATE_USERDATA_POINTER: &[u8; 25] = b"SDL.tray.create.userdata\0";
pub const SDL_PROP_TRAY_CREATE_LEFTCLICK_CALLBACK_POINTER: &[u8; 35] =
    b"SDL.tray.create.leftclick_callback\0";
pub const SDL_PROP_TRAY_CREATE_RIGHTCLICK_CALLBACK_POINTER: &[u8; 36] =
    b"SDL.tray.create.rightclick_callback\0";
pub const SDL_PROP_TRAY_CREATE_MIDDLECLICK_CALLBACK_POINTER: &[u8; 37] =
    b"SDL.tray.create.middleclick_callback\0";
pub const SDL_MAJOR_VERSION: u32 = 3;
pub const SDL_MINOR_VERSION: u32 = 5;
pub const SDL_MICRO_VERSION: u32 = 0;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
unsafe extern "C" {
    pub fn __debugbreak();
}
unsafe extern "C" {
    pub fn __fastfail(code: core::ffi::c_uint) -> !;
}
unsafe extern "C" {
    pub fn __mingw_get_crt_info() -> *const core::ffi::c_char;
}
pub type rsize_t = usize;
pub type wchar_t = core::ffi::c_ushort;
pub type wint_t = core::ffi::c_ushort;
pub type wctype_t = core::ffi::c_ushort;
pub type errno_t = core::ffi::c_int;
pub type __time32_t = core::ffi::c_long;
pub type __time64_t = core::ffi::c_longlong;
pub type time_t = __time64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct threadmbcinfostruct {
    _unused: [u8; 0],
}
pub type pthreadlocinfo = *mut threadlocaleinfostruct;
pub type pthreadmbcinfo = *mut threadmbcinfostruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lc_time_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct localeinfo_struct {
    pub locinfo: pthreadlocinfo,
    pub mbcinfo: pthreadmbcinfo,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of localeinfo_struct"][::core::mem::size_of::<localeinfo_struct>() - 16usize];
    ["Alignment of localeinfo_struct"][::core::mem::align_of::<localeinfo_struct>() - 8usize];
    ["Offset of field: localeinfo_struct::locinfo"]
        [::core::mem::offset_of!(localeinfo_struct, locinfo) - 0usize];
    ["Offset of field: localeinfo_struct::mbcinfo"]
        [::core::mem::offset_of!(localeinfo_struct, mbcinfo) - 8usize];
};
impl Default for localeinfo_struct {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_tstruct = localeinfo_struct;
pub type _locale_t = *mut localeinfo_struct;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct tagLC_ID {
    pub wLanguage: core::ffi::c_ushort,
    pub wCountry: core::ffi::c_ushort,
    pub wCodePage: core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tagLC_ID"][::core::mem::size_of::<tagLC_ID>() - 6usize];
    ["Alignment of tagLC_ID"][::core::mem::align_of::<tagLC_ID>() - 2usize];
    ["Offset of field: tagLC_ID::wLanguage"][::core::mem::offset_of!(tagLC_ID, wLanguage) - 0usize];
    ["Offset of field: tagLC_ID::wCountry"][::core::mem::offset_of!(tagLC_ID, wCountry) - 2usize];
    ["Offset of field: tagLC_ID::wCodePage"][::core::mem::offset_of!(tagLC_ID, wCodePage) - 4usize];
};
pub type LC_ID = tagLC_ID;
pub type LPLC_ID = *mut tagLC_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct threadlocaleinfostruct {
    pub _locale_pctype: *const core::ffi::c_ushort,
    pub _locale_mb_cur_max: core::ffi::c_int,
    pub _locale_lc_codepage: core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of threadlocaleinfostruct"][::core::mem::size_of::<threadlocaleinfostruct>() - 16usize];
    ["Alignment of threadlocaleinfostruct"]
        [::core::mem::align_of::<threadlocaleinfostruct>() - 8usize];
    ["Offset of field: threadlocaleinfostruct::_locale_pctype"]
        [::core::mem::offset_of!(threadlocaleinfostruct, _locale_pctype) - 0usize];
    ["Offset of field: threadlocaleinfostruct::_locale_mb_cur_max"]
        [::core::mem::offset_of!(threadlocaleinfostruct, _locale_mb_cur_max) - 8usize];
    ["Offset of field: threadlocaleinfostruct::_locale_lc_codepage"]
        [::core::mem::offset_of!(threadlocaleinfostruct, _locale_lc_codepage) - 12usize];
};
impl Default for threadlocaleinfostruct {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type threadlocinfo = threadlocaleinfostruct;
unsafe extern "C" {
    pub fn _memccpy(
        _Dst: *mut core::ffi::c_void,
        _Src: *const core::ffi::c_void,
        _Val: core::ffi::c_int,
        _MaxCount: usize,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memchr(
        _Buf: *const core::ffi::c_void,
        _Val: core::ffi::c_int,
        _MaxCount: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _memicmp(
        _Buf1: *const core::ffi::c_void,
        _Buf2: *const core::ffi::c_void,
        _Size: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const core::ffi::c_void,
        _Buf2: *const core::ffi::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memcmp(
        _Buf1: *const core::ffi::c_void,
        _Buf2: *const core::ffi::c_void,
        _Size: core::ffi::c_ulonglong,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        _Dst: *mut core::ffi::c_void,
        _Src: *const core::ffi::c_void,
        _Size: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memcpy_s(
        _dest: *mut core::ffi::c_void,
        _numberOfElements: usize,
        _src: *const core::ffi::c_void,
        _count: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn mempcpy(
        _Dst: *mut core::ffi::c_void,
        _Src: *const core::ffi::c_void,
        _Size: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset(
        _Dst: *mut core::ffi::c_void,
        _Val: core::ffi::c_int,
        _Size: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        _Dst: *mut core::ffi::c_void,
        _Src: *const core::ffi::c_void,
        _Val: core::ffi::c_int,
        _Size: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memicmp(
        _Buf1: *const core::ffi::c_void,
        _Buf2: *const core::ffi::c_void,
        _Size: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strset(_Str: *mut core::ffi::c_char, _Val: core::ffi::c_int) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strset_l(
        _Str: *mut core::ffi::c_char,
        _Val: core::ffi::c_int,
        _Locale: _locale_t,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcpy(
        _Dest: *mut core::ffi::c_char,
        _Source: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        _Dest: *mut core::ffi::c_char,
        _Source: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strlen(_Str: *const core::ffi::c_char) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn strnlen(_Str: *const core::ffi::c_char, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn memmove(
        _Dst: *mut core::ffi::c_void,
        _Src: *const core::ffi::c_void,
        _Size: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    pub fn _strdup(_Src: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strchr(_Str: *const core::ffi::c_char, _Val: core::ffi::c_int)
    -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _stricmp(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strcmpi(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _stricmp_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strcoll_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _stricoll(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _stricoll_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strncoll(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strncoll_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strnicoll(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strnicoll_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcspn(
        _Str: *const core::ffi::c_char,
        _Control: *const core::ffi::c_char,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strerror(_ErrMsg: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strerror(arg1: core::ffi::c_int) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strlwr(_String: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlwr_l(_String: *mut core::ffi::c_char, _Locale: _locale_t) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        _Dest: *mut core::ffi::c_char,
        _Source: *const core::ffi::c_char,
        _Count: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: core::ffi::c_ulonglong,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strnicmp(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strnicmp_l(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        _Dest: *mut core::ffi::c_char,
        _Source: *const core::ffi::c_char,
        _Count: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strnset(
        _Str: *mut core::ffi::c_char,
        _Val: core::ffi::c_int,
        _MaxCount: usize,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strnset_l(
        str_: *mut core::ffi::c_char,
        c: core::ffi::c_int,
        count: usize,
        _Locale: _locale_t,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(
        _Str: *const core::ffi::c_char,
        _Control: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrchr(_Str: *const core::ffi::c_char, _Ch: core::ffi::c_int)
    -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strrev(_Str: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strspn(
        _Str: *const core::ffi::c_char,
        _Control: *const core::ffi::c_char,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn strstr(
        _Str: *const core::ffi::c_char,
        _SubStr: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        _Str: *mut core::ffi::c_char,
        _Delim: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        _Str: *mut core::ffi::c_char,
        _Delim: *const core::ffi::c_char,
        __last: *mut *mut core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strupr(_String: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strupr_l(_String: *mut core::ffi::c_char, _Locale: _locale_t)
    -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        _Dst: *mut core::ffi::c_char,
        _Src: *const core::ffi::c_char,
        _MaxCount: core::ffi::c_ulonglong,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strxfrm_l(
        _Dst: *mut core::ffi::c_char,
        _Src: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(_Src: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmpi(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn stricmp(
        _Str1: *const core::ffi::c_char,
        _Str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strlwr(_Str: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strnicmp(
        _Str1: *const core::ffi::c_char,
        _Str: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const core::ffi::c_char,
        arg2: *const core::ffi::c_char,
        arg3: core::ffi::c_ulonglong,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        arg1: *const core::ffi::c_char,
        arg2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strnset(
        _Str: *mut core::ffi::c_char,
        _Val: core::ffi::c_int,
        _MaxCount: usize,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrev(_Str: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strset(_Str: *mut core::ffi::c_char, _Val: core::ffi::c_int) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strupr(_Str: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _wcsdup(_Str: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscat(_Dest: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcschr(
        _Str: *const core::ffi::c_ushort,
        _Ch: core::ffi::c_ushort,
    ) -> *mut core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn wcscmp(
        _Str1: *const core::ffi::c_ushort,
        _Str2: *const core::ffi::c_ushort,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcscpy(_Dest: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscspn(_Str: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcslen(_Str: *const core::ffi::c_ushort) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn wcsnlen(_Src: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcsncat(_Dest: *mut wchar_t, _Source: *const wchar_t, _Count: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsncmp(
        _Str1: *const core::ffi::c_ushort,
        _Str2: *const core::ffi::c_ushort,
        _MaxCount: core::ffi::c_ulonglong,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcsncpy(_Dest: *mut wchar_t, _Source: *const wchar_t, _Count: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsncpy_l(
        _Dest: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
        _Locale: _locale_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcspbrk(_Str: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsspn(_Str: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcstok(
        _Str: *mut wchar_t,
        _Delim: *const wchar_t,
        _Ptr: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcstok(_Str: *mut wchar_t, _Delim: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcserror(_ErrNum: core::ffi::c_int) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn __wcserror(_Str: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsicmp(_Str1: *const wchar_t, _Str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsicmp_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicmp(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicmp_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsnset(_Str: *mut wchar_t, _Val: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsrev(_Str: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsset(_Str: *mut wchar_t, _Val: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsxfrm(_Dst: *mut wchar_t, _Src: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn _wcsxfrm_l(
        _Dst: *mut wchar_t,
        _Src: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcscoll(_Str1: *const wchar_t, _Str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcscoll_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsicoll(_Str1: *const wchar_t, _Str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsicoll_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsncoll(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsncoll_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicoll(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicoll_l(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcsdup(_Str: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicmp(_Str1: *const wchar_t, _Str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcsnicmp(
        _Str1: *const wchar_t,
        _Str2: *const wchar_t,
        _MaxCount: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcsnset(_Str: *mut wchar_t, _Val: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsrev(_Str: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsset(_Str: *mut wchar_t, _Val: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcslwr(_Str: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsupr(_Str: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicoll(_Str1: *const wchar_t, _Str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strset_s(
        _Dst: *mut core::ffi::c_char,
        _DstSize: usize,
        _Value: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strerror_s(
        _Buf: *mut core::ffi::c_char,
        _SizeInBytes: usize,
        _ErrMsg: *const core::ffi::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strerror_s(
        _Buf: *mut core::ffi::c_char,
        _SizeInBytes: usize,
        _ErrNum: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strlwr_s(_Str: *mut core::ffi::c_char, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _strlwr_s_l(_Str: *mut core::ffi::c_char, _Size: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _strnset_s(
        _Str: *mut core::ffi::c_char,
        _Size: usize,
        _Val: core::ffi::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strupr_s(_Str: *mut core::ffi::c_char, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _strupr_s_l(_Str: *mut core::ffi::c_char, _Size: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn strncat_s(
        _Dst: *mut core::ffi::c_char,
        _DstSizeInChars: usize,
        _Src: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strncat_s_l(
        _Dst: *mut core::ffi::c_char,
        _DstSizeInChars: usize,
        _Src: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strcpy_s(
        _Dst: *mut core::ffi::c_char,
        _SizeInBytes: rsize_t,
        _Src: *const core::ffi::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strncpy_s(
        _Dst: *mut core::ffi::c_char,
        _DstSizeInChars: usize,
        _Src: *const core::ffi::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strncpy_s_l(
        _Dst: *mut core::ffi::c_char,
        _DstSizeInChars: usize,
        _Src: *const core::ffi::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strtok_s(
        _Str: *mut core::ffi::c_char,
        _Delim: *const core::ffi::c_char,
        _Context: *mut *mut core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strtok_s_l(
        _Str: *mut core::ffi::c_char,
        _Delim: *const core::ffi::c_char,
        _Context: *mut *mut core::ffi::c_char,
        _Locale: _locale_t,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcat_s(
        _Dst: *mut core::ffi::c_char,
        _SizeInBytes: rsize_t,
        _Src: *const core::ffi::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn memmove_s(
        _dest: *mut core::ffi::c_void,
        _numberOfElements: usize,
        _src: *const core::ffi::c_void,
        _count: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstok_s(
        _Str: *mut wchar_t,
        _Delim: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcserror_s(
        _Buf: *mut wchar_t,
        _SizeInWords: usize,
        _ErrNum: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrMsg: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsnset_s(
        _Dst: *mut wchar_t,
        _DstSizeInWords: usize,
        _Val: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsset_s(_Str: *mut wchar_t, _SizeInWords: usize, _Val: wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcslwr_s(_Str: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcslwr_s_l(_Str: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsupr_s(_Str: *mut wchar_t, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsupr_s_l(_Str: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn wcscpy_s(_Dst: *mut wchar_t, _SizeInWords: rsize_t, _Src: *const wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn wcscat_s(_Dst: *mut wchar_t, _SizeInWords: rsize_t, _Src: *const wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncat_s(
        _Dst: *mut wchar_t,
        _DstSizeInChars: usize,
        _Src: *const wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsncat_s_l(
        _Dst: *mut wchar_t,
        _DstSizeInChars: usize,
        _Src: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncpy_s(
        _Dst: *mut wchar_t,
        _DstSizeInChars: usize,
        _Src: *const wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsncpy_s_l(
        _Dst: *mut wchar_t,
        _DstSizeInChars: usize,
        _Src: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcstok_s_l(
        _Str: *mut wchar_t,
        _Delim: *const wchar_t,
        _Context: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsset_s_l(
        _Str: *mut wchar_t,
        _SizeInChars: usize,
        _Val: wchar_t,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsnset_s_l(
        _Str: *mut wchar_t,
        _SizeInChars: usize,
        _Val: wchar_t,
        _Count: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn __local_stdio_printf_options() -> *mut core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn __local_stdio_scanf_options() -> *mut core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut wchar_t,
        _BufferSizeInWords: *mut usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _itow_s(
        _Val: core::ffi::c_int,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _Radix: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ltow_s(
        _Val: core::ffi::c_long,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _Radix: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ultow_s(
        _Val: core::ffi::c_ulong,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _Radix: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wgetenv_s(
        _ReturnSize: *mut usize,
        _DstBuf: *mut wchar_t,
        _DstSizeInWords: usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _i64tow_s(
        _Val: core::ffi::c_longlong,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _Radix: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ui64tow_s(
        _Val: core::ffi::c_ulonglong,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _Radix: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wmakepath_s(
        _PathResult: *mut wchar_t,
        _SizeInWords: usize,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wputenv_s(_Name: *const wchar_t, _Value: *const wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const wchar_t,
        _EnvVar: *const wchar_t,
        _ResultPath: *mut wchar_t,
        _SizeInWords: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _DriveSizeInWords: usize,
        _Dir: *mut wchar_t,
        _DirSizeInWords: usize,
        _Filename: *mut wchar_t,
        _FilenameSizeInWords: usize,
        _Ext: *mut wchar_t,
        _ExtSizeInWords: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn __pctype_func() -> *const core::ffi::c_ushort;
}
unsafe extern "C" {
    pub static mut __imp__wctype: *mut *const core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn __pwctype_func() -> *const wctype_t;
}
unsafe extern "C" {
    pub fn iswalpha(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswupper(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswlower(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswdigit(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswxdigit(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswspace(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswpunct(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswalnum(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswprint(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswgraph(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswcntrl(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswascii(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn isleadbyte(_C: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn towupper(_C: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn towlower(_C: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn iswctype(_C: wint_t, _Type: wctype_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __iswcsymf(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __iswcsym(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn iswblank(_C: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswalpha_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswupper_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswlower_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswdigit_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswxdigit_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswspace_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswpunct_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswalnum_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswprint_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswgraph_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswcntrl_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _towupper_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _towlower_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _isleadbyte_l(_C: core::ffi::c_int, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswctype_l(_C: wint_t, _Type: wctype_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswblank_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswcsymf_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _iswcsym_l(_C: wint_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn is_wctype(_C: wint_t, _Type: wctype_t) -> core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct _iobuf {
    pub _ptr: *mut core::ffi::c_char,
    pub _cnt: core::ffi::c_int,
    pub _base: *mut core::ffi::c_char,
    pub _flag: core::ffi::c_int,
    pub _file: core::ffi::c_int,
    pub _charbuf: core::ffi::c_int,
    pub _bufsiz: core::ffi::c_int,
    pub _tmpfname: *mut core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _iobuf"][::core::mem::size_of::<_iobuf>() - 48usize];
    ["Alignment of _iobuf"][::core::mem::align_of::<_iobuf>() - 8usize];
    ["Offset of field: _iobuf::_ptr"][::core::mem::offset_of!(_iobuf, _ptr) - 0usize];
    ["Offset of field: _iobuf::_cnt"][::core::mem::offset_of!(_iobuf, _cnt) - 8usize];
    ["Offset of field: _iobuf::_base"][::core::mem::offset_of!(_iobuf, _base) - 16usize];
    ["Offset of field: _iobuf::_flag"][::core::mem::offset_of!(_iobuf, _flag) - 24usize];
    ["Offset of field: _iobuf::_file"][::core::mem::offset_of!(_iobuf, _file) - 28usize];
    ["Offset of field: _iobuf::_charbuf"][::core::mem::offset_of!(_iobuf, _charbuf) - 32usize];
    ["Offset of field: _iobuf::_bufsiz"][::core::mem::offset_of!(_iobuf, _bufsiz) - 36usize];
    ["Offset of field: _iobuf::_tmpfname"][::core::mem::offset_of!(_iobuf, _tmpfname) - 40usize];
};
impl Default for _iobuf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = _iobuf;
unsafe extern "C" {
    pub fn __acrt_iob_func(index: core::ffi::c_uint) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __iob_func() -> *mut FILE;
}
pub type _fsize_t = core::ffi::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct _wfinddata32_t {
    pub attrib: core::ffi::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: _fsize_t,
    pub name: [wchar_t; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata32_t"][::core::mem::size_of::<_wfinddata32_t>() - 540usize];
    ["Alignment of _wfinddata32_t"][::core::mem::align_of::<_wfinddata32_t>() - 4usize];
    ["Offset of field: _wfinddata32_t::attrib"]
        [::core::mem::offset_of!(_wfinddata32_t, attrib) - 0usize];
    ["Offset of field: _wfinddata32_t::time_create"]
        [::core::mem::offset_of!(_wfinddata32_t, time_create) - 4usize];
    ["Offset of field: _wfinddata32_t::time_access"]
        [::core::mem::offset_of!(_wfinddata32_t, time_access) - 8usize];
    ["Offset of field: _wfinddata32_t::time_write"]
        [::core::mem::offset_of!(_wfinddata32_t, time_write) - 12usize];
    ["Offset of field: _wfinddata32_t::size"]
        [::core::mem::offset_of!(_wfinddata32_t, size) - 16usize];
    ["Offset of field: _wfinddata32_t::name"]
        [::core::mem::offset_of!(_wfinddata32_t, name) - 20usize];
};
impl Default for _wfinddata32_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct _wfinddata32i64_t {
    pub attrib: core::ffi::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: core::ffi::c_longlong,
    pub name: [wchar_t; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata32i64_t"][::core::mem::size_of::<_wfinddata32i64_t>() - 544usize];
    ["Alignment of _wfinddata32i64_t"][::core::mem::align_of::<_wfinddata32i64_t>() - 8usize];
    ["Offset of field: _wfinddata32i64_t::attrib"]
        [::core::mem::offset_of!(_wfinddata32i64_t, attrib) - 0usize];
    ["Offset of field: _wfinddata32i64_t::time_create"]
        [::core::mem::offset_of!(_wfinddata32i64_t, time_create) - 4usize];
    ["Offset of field: _wfinddata32i64_t::time_access"]
        [::core::mem::offset_of!(_wfinddata32i64_t, time_access) - 8usize];
    ["Offset of field: _wfinddata32i64_t::time_write"]
        [::core::mem::offset_of!(_wfinddata32i64_t, time_write) - 12usize];
    ["Offset of field: _wfinddata32i64_t::size"]
        [::core::mem::offset_of!(_wfinddata32i64_t, size) - 16usize];
    ["Offset of field: _wfinddata32i64_t::name"]
        [::core::mem::offset_of!(_wfinddata32i64_t, name) - 24usize];
};
impl Default for _wfinddata32i64_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct _wfinddata64i32_t {
    pub attrib: core::ffi::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: _fsize_t,
    pub name: [wchar_t; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata64i32_t"][::core::mem::size_of::<_wfinddata64i32_t>() - 560usize];
    ["Alignment of _wfinddata64i32_t"][::core::mem::align_of::<_wfinddata64i32_t>() - 8usize];
    ["Offset of field: _wfinddata64i32_t::attrib"]
        [::core::mem::offset_of!(_wfinddata64i32_t, attrib) - 0usize];
    ["Offset of field: _wfinddata64i32_t::time_create"]
        [::core::mem::offset_of!(_wfinddata64i32_t, time_create) - 8usize];
    ["Offset of field: _wfinddata64i32_t::time_access"]
        [::core::mem::offset_of!(_wfinddata64i32_t, time_access) - 16usize];
    ["Offset of field: _wfinddata64i32_t::time_write"]
        [::core::mem::offset_of!(_wfinddata64i32_t, time_write) - 24usize];
    ["Offset of field: _wfinddata64i32_t::size"]
        [::core::mem::offset_of!(_wfinddata64i32_t, size) - 32usize];
    ["Offset of field: _wfinddata64i32_t::name"]
        [::core::mem::offset_of!(_wfinddata64i32_t, name) - 36usize];
};
impl Default for _wfinddata64i32_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct _wfinddata64_t {
    pub attrib: core::ffi::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: core::ffi::c_longlong,
    pub name: [wchar_t; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata64_t"][::core::mem::size_of::<_wfinddata64_t>() - 560usize];
    ["Alignment of _wfinddata64_t"][::core::mem::align_of::<_wfinddata64_t>() - 8usize];
    ["Offset of field: _wfinddata64_t::attrib"]
        [::core::mem::offset_of!(_wfinddata64_t, attrib) - 0usize];
    ["Offset of field: _wfinddata64_t::time_create"]
        [::core::mem::offset_of!(_wfinddata64_t, time_create) - 8usize];
    ["Offset of field: _wfinddata64_t::time_access"]
        [::core::mem::offset_of!(_wfinddata64_t, time_access) - 16usize];
    ["Offset of field: _wfinddata64_t::time_write"]
        [::core::mem::offset_of!(_wfinddata64_t, time_write) - 24usize];
    ["Offset of field: _wfinddata64_t::size"]
        [::core::mem::offset_of!(_wfinddata64_t, size) - 32usize];
    ["Offset of field: _wfinddata64_t::name"]
        [::core::mem::offset_of!(_wfinddata64_t, name) - 40usize];
};
impl Default for _wfinddata64_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn _wgetcwd(_DstBuf: *mut wchar_t, _SizeInWords: core::ffi::c_int) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wgetdcwd(
        _Drive: core::ffi::c_int,
        _DstBuf: *mut wchar_t,
        _SizeInWords: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wgetdcwd_nolock(
        _Drive: core::ffi::c_int,
        _DstBuf: *mut wchar_t,
        _SizeInWords: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wchdir(_Path: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wmkdir(_Path: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wrmdir(_Path: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _waccess(_Filename: *const wchar_t, _AccessMode: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wchmod(_Filename: *const wchar_t, _Mode: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wcreat(
        _Filename: *const wchar_t,
        _PermissionMode: core::ffi::c_int,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wfindfirst32(_Filename: *const wchar_t, _FindData: *mut _wfinddata32_t) -> isize;
}
unsafe extern "C" {
    pub fn _wfindnext32(_FindHandle: isize, _FindData: *mut _wfinddata32_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wunlink(_Filename: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wrename(_OldFilename: *const wchar_t, _NewFilename: *const wchar_t)
    -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wmktemp(_TemplateName: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wfindfirst32i64(_Filename: *const wchar_t, _FindData: *mut _wfinddata32i64_t) -> isize;
}
unsafe extern "C" {
    pub fn _wfindfirst64i32(_Filename: *const wchar_t, _FindData: *mut _wfinddata64i32_t) -> isize;
}
unsafe extern "C" {
    pub fn _wfindfirst64(_Filename: *const wchar_t, _FindData: *mut _wfinddata64_t) -> isize;
}
unsafe extern "C" {
    pub fn _wfindnext32i64(
        _FindHandle: isize,
        _FindData: *mut _wfinddata32i64_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wfindnext64i32(
        _FindHandle: isize,
        _FindData: *mut _wfinddata64i32_t,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wfindnext64(_FindHandle: isize, _FindData: *mut _wfinddata64_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wsopen_s(
        _FileHandle: *mut core::ffi::c_int,
        _Filename: *const wchar_t,
        _OpenFlag: core::ffi::c_int,
        _ShareFlag: core::ffi::c_int,
        _PermissionFlag: core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wopen(_Filename: *const wchar_t, _OpenFlag: core::ffi::c_int, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wsopen(
        _Filename: *const wchar_t,
        _OpenFlag: core::ffi::c_int,
        _ShareFlag: core::ffi::c_int,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wsetlocale(_Category: core::ffi::c_int, _Locale: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcreate_locale(_Category: core::ffi::c_int, _Locale: *const wchar_t) -> _locale_t;
}
unsafe extern "C" {
    pub fn _wexecl(_Filename: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
unsafe extern "C" {
    pub fn _wexecle(_Filename: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
unsafe extern "C" {
    pub fn _wexeclp(_Filename: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
unsafe extern "C" {
    pub fn _wexeclpe(_Filename: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
unsafe extern "C" {
    pub fn _wexecv(_Filename: *const wchar_t, _ArgList: *const *const wchar_t) -> isize;
}
unsafe extern "C" {
    pub fn _wexecve(
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wexecvp(_Filename: *const wchar_t, _ArgList: *const *const wchar_t) -> isize;
}
unsafe extern "C" {
    pub fn _wexecvpe(
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnl(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnle(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnlp(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnlpe(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnv(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnve(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnvp(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wspawnvpe(
        _Mode: core::ffi::c_int,
        _Filename: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
unsafe extern "C" {
    pub fn _wsystem(_Command: *const wchar_t) -> core::ffi::c_int;
}
pub type _ino_t = core::ffi::c_ushort;
pub type ino_t = core::ffi::c_ushort;
pub type _dev_t = core::ffi::c_uint;
pub type dev_t = core::ffi::c_uint;
pub type _off_t = core::ffi::c_long;
pub type off32_t = core::ffi::c_long;
pub type _off64_t = core::ffi::c_longlong;
pub type off64_t = core::ffi::c_longlong;
pub type off_t = off32_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct _stat32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: core::ffi::c_ushort,
    pub st_nlink: core::ffi::c_short,
    pub st_uid: core::ffi::c_short,
    pub st_gid: core::ffi::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat32"][::core::mem::size_of::<_stat32>() - 36usize];
    ["Alignment of _stat32"][::core::mem::align_of::<_stat32>() - 4usize];
    ["Offset of field: _stat32::st_dev"][::core::mem::offset_of!(_stat32, st_dev) - 0usize];
    ["Offset of field: _stat32::st_ino"][::core::mem::offset_of!(_stat32, st_ino) - 4usize];
    ["Offset of field: _stat32::st_mode"][::core::mem::offset_of!(_stat32, st_mode) - 6usize];
    ["Offset of field: _stat32::st_nlink"][::core::mem::offset_of!(_stat32, st_nlink) - 8usize];
    ["Offset of field: _stat32::st_uid"][::core::mem::offset_of!(_stat32, st_uid) - 10usize];
    ["Offset of field: _stat32::st_gid"][::core::mem::offset_of!(_stat32, st_gid) - 12usize];
    ["Offset of field: _stat32::st_rdev"][::core::mem::offset_of!(_stat32, st_rdev) - 16usize];
    ["Offset of field: _stat32::st_size"][::core::mem::offset_of!(_stat32, st_size) - 20usize];
    ["Offset of field: _stat32::st_atime"][::core::mem::offset_of!(_stat32, st_atime) - 24usize];
    ["Offset of field: _stat32::st_mtime"][::core::mem::offset_of!(_stat32, st_mtime) - 28usize];
    ["Offset of field: _stat32::st_ctime"][::core::mem::offset_of!(_stat32, st_ctime) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct _stat32i64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: core::ffi::c_ushort,
    pub st_nlink: core::ffi::c_short,
    pub st_uid: core::ffi::c_short,
    pub st_gid: core::ffi::c_short,
    pub st_rdev: _dev_t,
    pub st_size: core::ffi::c_longlong,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat32i64"][::core::mem::size_of::<_stat32i64>() - 48usize];
    ["Alignment of _stat32i64"][::core::mem::align_of::<_stat32i64>() - 8usize];
    ["Offset of field: _stat32i64::st_dev"][::core::mem::offset_of!(_stat32i64, st_dev) - 0usize];
    ["Offset of field: _stat32i64::st_ino"][::core::mem::offset_of!(_stat32i64, st_ino) - 4usize];
    ["Offset of field: _stat32i64::st_mode"][::core::mem::offset_of!(_stat32i64, st_mode) - 6usize];
    ["Offset of field: _stat32i64::st_nlink"]
        [::core::mem::offset_of!(_stat32i64, st_nlink) - 8usize];
    ["Offset of field: _stat32i64::st_uid"][::core::mem::offset_of!(_stat32i64, st_uid) - 10usize];
    ["Offset of field: _stat32i64::st_gid"][::core::mem::offset_of!(_stat32i64, st_gid) - 12usize];
    ["Offset of field: _stat32i64::st_rdev"]
        [::core::mem::offset_of!(_stat32i64, st_rdev) - 16usize];
    ["Offset of field: _stat32i64::st_size"]
        [::core::mem::offset_of!(_stat32i64, st_size) - 24usize];
    ["Offset of field: _stat32i64::st_atime"]
        [::core::mem::offset_of!(_stat32i64, st_atime) - 32usize];
    ["Offset of field: _stat32i64::st_mtime"]
        [::core::mem::offset_of!(_stat32i64, st_mtime) - 36usize];
    ["Offset of field: _stat32i64::st_ctime"]
        [::core::mem::offset_of!(_stat32i64, st_ctime) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct _stat64i32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: core::ffi::c_ushort,
    pub st_nlink: core::ffi::c_short,
    pub st_uid: core::ffi::c_short,
    pub st_gid: core::ffi::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat64i32"][::core::mem::size_of::<_stat64i32>() - 48usize];
    ["Alignment of _stat64i32"][::core::mem::align_of::<_stat64i32>() - 8usize];
    ["Offset of field: _stat64i32::st_dev"][::core::mem::offset_of!(_stat64i32, st_dev) - 0usize];
    ["Offset of field: _stat64i32::st_ino"][::core::mem::offset_of!(_stat64i32, st_ino) - 4usize];
    ["Offset of field: _stat64i32::st_mode"][::core::mem::offset_of!(_stat64i32, st_mode) - 6usize];
    ["Offset of field: _stat64i32::st_nlink"]
        [::core::mem::offset_of!(_stat64i32, st_nlink) - 8usize];
    ["Offset of field: _stat64i32::st_uid"][::core::mem::offset_of!(_stat64i32, st_uid) - 10usize];
    ["Offset of field: _stat64i32::st_gid"][::core::mem::offset_of!(_stat64i32, st_gid) - 12usize];
    ["Offset of field: _stat64i32::st_rdev"]
        [::core::mem::offset_of!(_stat64i32, st_rdev) - 16usize];
    ["Offset of field: _stat64i32::st_size"]
        [::core::mem::offset_of!(_stat64i32, st_size) - 20usize];
    ["Offset of field: _stat64i32::st_atime"]
        [::core::mem::offset_of!(_stat64i32, st_atime) - 24usize];
    ["Offset of field: _stat64i32::st_mtime"]
        [::core::mem::offset_of!(_stat64i32, st_mtime) - 32usize];
    ["Offset of field: _stat64i32::st_ctime"]
        [::core::mem::offset_of!(_stat64i32, st_ctime) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct _stat64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: core::ffi::c_ushort,
    pub st_nlink: core::ffi::c_short,
    pub st_uid: core::ffi::c_short,
    pub st_gid: core::ffi::c_short,
    pub st_rdev: _dev_t,
    pub st_size: core::ffi::c_longlong,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat64"][::core::mem::size_of::<_stat64>() - 56usize];
    ["Alignment of _stat64"][::core::mem::align_of::<_stat64>() - 8usize];
    ["Offset of field: _stat64::st_dev"][::core::mem::offset_of!(_stat64, st_dev) - 0usize];
    ["Offset of field: _stat64::st_ino"][::core::mem::offset_of!(_stat64, st_ino) - 4usize];
    ["Offset of field: _stat64::st_mode"][::core::mem::offset_of!(_stat64, st_mode) - 6usize];
    ["Offset of field: _stat64::st_nlink"][::core::mem::offset_of!(_stat64, st_nlink) - 8usize];
    ["Offset of field: _stat64::st_uid"][::core::mem::offset_of!(_stat64, st_uid) - 10usize];
    ["Offset of field: _stat64::st_gid"][::core::mem::offset_of!(_stat64, st_gid) - 12usize];
    ["Offset of field: _stat64::st_rdev"][::core::mem::offset_of!(_stat64, st_rdev) - 16usize];
    ["Offset of field: _stat64::st_size"][::core::mem::offset_of!(_stat64, st_size) - 24usize];
    ["Offset of field: _stat64::st_atime"][::core::mem::offset_of!(_stat64, st_atime) - 32usize];
    ["Offset of field: _stat64::st_mtime"][::core::mem::offset_of!(_stat64, st_mtime) - 40usize];
    ["Offset of field: _stat64::st_ctime"][::core::mem::offset_of!(_stat64, st_ctime) - 48usize];
};
unsafe extern "C" {
    pub fn _wstat32(_Name: *const wchar_t, _Stat: *mut _stat32) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wstat32i64(_Name: *const wchar_t, _Stat: *mut _stat32i64) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wstat64i32(_Name: *const wchar_t, _Stat: *mut _stat64i32) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wstat64(_Name: *const wchar_t, _Stat: *mut _stat64) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cgetws(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _getwch() -> wint_t;
}
unsafe extern "C" {
    pub fn _getwche() -> wint_t;
}
unsafe extern "C" {
    pub fn _putwch(_WCh: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _ungetwch(_WCh: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _cputws(_String: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwprintf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwscanf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwscanf_l(_Format: *const wchar_t, _Locale: _locale_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwprintf_p(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf_p(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwprintf_l(_Format: *const wchar_t, _Locale: _locale_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwprintf_p_l(_Format: *const wchar_t, _Locale: _locale_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf_p_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _putwch_nolock(_WCh: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _getwch_nolock() -> wint_t;
}
unsafe extern "C" {
    pub fn _getwche_nolock() -> wint_t;
}
unsafe extern "C" {
    pub fn _ungetwch_nolock(_WCh: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: core::ffi::c_ulonglong,
        _Str: *mut wchar_t,
        _Len: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: core::ffi::c_ulonglong,
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_swscanf(_Src: *const wchar_t, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vswscanf(
        _Str: *const wchar_t,
        Format: *const wchar_t,
        argp: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_wscanf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vwscanf(Format: *const wchar_t, argp: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_fwscanf(_File: *mut FILE, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vfwscanf(
        fp: *mut FILE,
        Format: *const wchar_t,
        argp: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_fwprintf(_File: *mut FILE, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_wprintf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vfwprintf(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vwprintf(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_snwprintf(
        s: *mut wchar_t,
        n: usize,
        format: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vsnwprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        arg4: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_swprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_vswprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        arg4: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}swscanf"]
    pub fn __ms_swscanf(_Src: *const wchar_t, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vswscanf"]
    pub fn __ms_vswscanf(
        _Src: *const wchar_t,
        _Format: *const wchar_t,
        arg1: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}wscanf"]
    pub fn __ms_wscanf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vwscanf"]
    pub fn __ms_vwscanf(_Format: *const wchar_t, arg1: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}fwscanf"]
    pub fn __ms_fwscanf(_File: *mut FILE, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vfwscanf"]
    pub fn __ms_vfwscanf(
        _File: *mut FILE,
        _Format: *const wchar_t,
        arg1: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __ms_fwprintf(_File: *mut FILE, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}wprintf"]
    pub fn __ms_wprintf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vfwprintf"]
    pub fn __ms_vfwprintf(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vwprintf"]
    pub fn __ms_vwprintf(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}swprintf"]
    pub fn __ms_swprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vswprintf"]
    pub fn __ms_vswprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        arg4: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}snwprintf"]
    pub fn __ms_snwprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "\u{1}vsnwprintf"]
    pub fn __ms_vsnwprintf(
        arg1: *mut wchar_t,
        arg2: usize,
        arg3: *const wchar_t,
        arg4: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf(
        options: core::ffi::c_ulonglong,
        str_: *mut wchar_t,
        len: usize,
        format: *const wchar_t,
        locale: _locale_t,
        valist: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf(
        options: core::ffi::c_ulonglong,
        file: *mut FILE,
        format: *const wchar_t,
        locale: _locale_t,
        valist: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswscanf(
        options: core::ffi::c_ulonglong,
        input: *const wchar_t,
        length: usize,
        format: *const wchar_t,
        locale: _locale_t,
        valist: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwscanf(
        options: core::ffi::c_ulonglong,
        file: *mut FILE,
        format: *const wchar_t,
        locale: _locale_t,
        valist: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fwprintf(_File: *mut FILE, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wfsopen(
        _Filename: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: core::ffi::c_int,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fgetwc(_File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
unsafe extern "C" {
    pub fn fputwc(_Ch: wchar_t, _File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fputwchar(_Ch: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn getwc(_File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn getwchar() -> wint_t;
}
unsafe extern "C" {
    pub fn putwc(_Ch: wchar_t, _File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn putwchar(_Ch: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn ungetwc(_Ch: wint_t, _File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn fgetws(
        _Dst: *mut wchar_t,
        _SizeInWords: core::ffi::c_int,
        _File: *mut FILE,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn fputws(_Str: *const wchar_t, _File: *mut FILE) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _getws(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _putws(_Str: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _scwprintf(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _snwprintf(
        _Dest: *mut wchar_t,
        _Count: usize,
        _Format: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vsnwprintf(
        _Dest: *mut wchar_t,
        _Count: usize,
        _Format: *const wchar_t,
        _Args: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwscanf_l__extern"]
    pub fn _vfwscanf_l(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwscanf_l__extern"]
    pub fn _vwscanf_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vsnwscanf_l__extern"]
    pub fn _vsnwscanf_l(
        _Src: *const wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswscanf_l__extern"]
    pub fn _vswscanf_l(
        _Src: *const wchar_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwprintf_p_l__extern"]
    pub fn _vfwprintf_p_l(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwprintf_p_l__extern"]
    pub fn _vwprintf_p_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwprintf_p__extern"]
    pub fn _vfwprintf_p(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwprintf_p__extern"]
    pub fn _vwprintf_p(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwprintf_l__extern"]
    pub fn _vfwprintf_l(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwprintf_l__extern"]
    pub fn _vwprintf_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswprintf_p_l__extern"]
    pub fn _vswprintf_p_l(
        _DstBuf: *mut wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswprintf_p__extern"]
    pub fn _vswprintf_p(
        _DstBuf: *mut wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vsnwprintf_l__extern"]
    pub fn _vsnwprintf_l(
        _DstBuf: *mut wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vscwprintf_p_l__extern"]
    pub fn _vscwprintf_p_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vscwprintf_p__extern"]
    pub fn _vscwprintf_p(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vscwprintf_l__extern"]
    pub fn _vscwprintf_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vscwprintf(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswprintf_c_l__extern"]
    pub fn _vswprintf_c_l(
        _DstBuf: *mut wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "__vswprintf_l__extern"]
    pub fn __vswprintf_l(
        _DstBuf: *mut wchar_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswprintf_l__extern"]
    pub fn _vswprintf_l(
        _DstBuf: *mut wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vswprintf(
        _Dest: *mut wchar_t,
        _Format: *const wchar_t,
        _Args: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _swprintf(_Dest: *mut wchar_t, _Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wfdopen(_FileHandle: core::ffi::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wfopen(_Filename: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wfreopen(
        _Filename: *const wchar_t,
        _Mode: *const wchar_t,
        _OldFile: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wperror(_ErrMsg: *const wchar_t);
}
unsafe extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wremove(_Filename: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _fgetwc_nolock(_File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fputwc_nolock(_Ch: wchar_t, _File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _ungetwc_nolock(_Ch: wint_t, _File: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _itow(
        _Value: core::ffi::c_int,
        _Dest: *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ltow(
        _Value: core::ffi::c_long,
        _Dest: *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ultow(
        _Value: core::ffi::c_ulong,
        _Dest: *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcstod_l(_Str: *const wchar_t, _EndPtr: *mut *mut wchar_t, _Locale: _locale_t) -> f64;
}
unsafe extern "C" {
    pub fn __mingw_wcstod(_Str: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn __mingw_wcstof(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f32;
}
unsafe extern "C" {
    pub fn __mingw_wcstold(arg1: *const wchar_t, arg2: *mut *mut wchar_t) -> u128;
}
unsafe extern "C" {
    pub fn wcstod(_Str: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn wcstof(nptr: *const wchar_t, endptr: *mut *mut wchar_t) -> f32;
}
unsafe extern "C" {
    pub fn wcstold(arg1: *const wchar_t, arg2: *mut *mut wchar_t) -> u128;
}
unsafe extern "C" {
    pub fn wcstol(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _wcstol_l(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
        _Locale: _locale_t,
    ) -> core::ffi::c_long;
}
unsafe extern "C" {
    pub fn wcstoul(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn _wcstoul_l(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
        _Locale: _locale_t,
    ) -> core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn _wgetenv(_VarName: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wtof(_Str: *const wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn _wtof_l(_Str: *const wchar_t, _Locale: _locale_t) -> f64;
}
unsafe extern "C" {
    pub fn _wtoi(_Str: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wtoi_l(_Str: *const wchar_t, _Locale: _locale_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wtol(_Str: *const wchar_t) -> core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _wtol_l(_Str: *const wchar_t, _Locale: _locale_t) -> core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _i64tow(
        _Val: core::ffi::c_longlong,
        _DstBuf: *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ui64tow(
        _Val: core::ffi::c_ulonglong,
        _DstBuf: *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wtoi64(_Str: *const wchar_t) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn _wtoi64_l(_Str: *const wchar_t, _Locale: _locale_t) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoi64(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoi64_l(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
        _Locale: _locale_t,
    ) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoui64(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wcstoui64_l(
        _Str: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: core::ffi::c_int,
        _Locale: _locale_t,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wfullpath(
        _FullPath: *mut wchar_t,
        _Path: *const wchar_t,
        _SizeInWords: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wmakepath(
        _ResultPath: *mut wchar_t,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    );
}
unsafe extern "C" {
    pub fn _wputenv(_EnvString: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wsearchenv(
        _Filename: *const wchar_t,
        _EnvVar: *const wchar_t,
        _ResultPath: *mut wchar_t,
    );
}
unsafe extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _Dir: *mut wchar_t,
        _Filename: *mut wchar_t,
        _Ext: *mut wchar_t,
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct tm {
    pub tm_sec: core::ffi::c_int,
    pub tm_min: core::ffi::c_int,
    pub tm_hour: core::ffi::c_int,
    pub tm_mday: core::ffi::c_int,
    pub tm_mon: core::ffi::c_int,
    pub tm_year: core::ffi::c_int,
    pub tm_wday: core::ffi::c_int,
    pub tm_yday: core::ffi::c_int,
    pub tm_isdst: core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::core::mem::size_of::<tm>() - 36usize];
    ["Alignment of tm"][::core::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::core::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::core::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::core::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::core::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::core::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::core::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::core::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::core::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::core::mem::offset_of!(tm, tm_isdst) - 32usize];
};
unsafe extern "C" {
    pub fn _wasctime(_Tm: *const tm) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wasctime_s(_Buf: *mut wchar_t, _SizeInWords: usize, _Tm: *const tm) -> errno_t;
}
unsafe extern "C" {
    pub fn _wctime32(_Time: *const __time32_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wctime32_s(
        _Buf: *mut wchar_t,
        _SizeInWords: usize,
        _Time: *const __time32_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsftime(
        _Buf: *mut wchar_t,
        _SizeInWords: usize,
        _Format: *const wchar_t,
        _Tm: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _wcsftime_l(
        _Buf: *mut wchar_t,
        _SizeInWords: usize,
        _Format: *const wchar_t,
        _Tm: *const tm,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _wstrdate(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wstrdate_s(_Buf: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wstrtime(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wstrtime_s(_Buf: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wctime64(_Time: *const __time64_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wctime64_s(
        _Buf: *mut wchar_t,
        _SizeInWords: usize,
        _Time: *const __time64_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wctime(_Time: *const time_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wctime_s(arg1: *mut wchar_t, arg2: usize, arg3: *const time_t) -> errno_t;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct _Mbstatet {
    pub _Wchar: core::ffi::c_ulong,
    pub _Byte: core::ffi::c_ushort,
    pub _State: core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type _Wint_t = wchar_t;
unsafe extern "C" {
    pub fn btowc(arg1: core::ffi::c_int) -> wint_t;
}
unsafe extern "C" {
    pub fn mbrlen(
        _Ch: *const core::ffi::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mbrtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const core::ffi::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mbsrtowcs(
        _Dest: *mut wchar_t,
        _PSrc: *mut *const core::ffi::c_char,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcrtomb(
        _Dest: *mut core::ffi::c_char,
        _Source: wchar_t,
        _State: *mut mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcsrtombs(
        _Dest: *mut core::ffi::c_char,
        _PSource: *mut *const wchar_t,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wctob(_WCh: wint_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wmemset(s: *mut wchar_t, c: wchar_t, n: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wmemchr(
        s: *const core::ffi::c_ushort,
        c: core::ffi::c_ushort,
        n: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn wmemcmp(
        s1: *const core::ffi::c_ushort,
        s2: *const core::ffi::c_ushort,
        n: core::ffi::c_ulonglong,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wmemcpy(
        s1: *mut core::ffi::c_ushort,
        s2: *const core::ffi::c_ushort,
        n: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn wmempcpy(_Dst: *mut wchar_t, _Src: *const wchar_t, _Size: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wmemmove(
        s1: *mut core::ffi::c_ushort,
        s2: *const core::ffi::c_ushort,
        n: core::ffi::c_ulonglong,
    ) -> *mut core::ffi::c_ushort;
}
unsafe extern "C" {
    pub fn fwide(stream: *mut FILE, mode: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "mbsinit__extern"]
    pub fn mbsinit(_P: *const mbstate_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn wcstoll(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: core::ffi::c_int,
    ) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn wcstoull(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: core::ffi::c_int,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn __mingw_str_wide_utf8(
        wptr: *const wchar_t,
        mbptr: *mut *mut core::ffi::c_char,
        buflen: *mut usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_str_utf8_wide(
        mbptr: *const core::ffi::c_char,
        wptr: *mut *mut wchar_t,
        buflen: *mut usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __mingw_str_free(ptr: *mut core::ffi::c_void);
}
unsafe extern "C" {
    pub fn _waccess_s(_Filename: *const wchar_t, _AccessMode: core::ffi::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _wmktemp_s(_TemplateName: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _cgetws_s(_Buffer: *mut wchar_t, _SizeInWords: usize, _SizeRead: *mut usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _cwprintf_s(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwscanf_s(_Format: *const wchar_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwscanf_s_l(_Format: *const wchar_t, _Locale: _locale_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf_s(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _cwprintf_s_l(_Format: *const wchar_t, _Locale: _locale_t, ...) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _vcwprintf_s_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _getws_s(_Str: *mut wchar_t, _SizeInWords: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: core::ffi::c_ulonglong,
        _Str: *mut wchar_t,
        _Len: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: core::ffi::c_ulonglong,
        _Str: *mut wchar_t,
        _Len: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: core::ffi::c_ulonglong,
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwscanf_s_l__extern"]
    pub fn _vfwscanf_s_l(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vfwscanf_s__extern"]
    pub fn vfwscanf_s(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwscanf_s_l__extern"]
    pub fn _vwscanf_s_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vwscanf_s__extern"]
    pub fn vwscanf_s(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswscanf_s_l__extern"]
    pub fn _vswscanf_s_l(
        _Src: *const wchar_t,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vswscanf_s__extern"]
    pub fn vswscanf_s(
        _Src: *const wchar_t,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vsnwscanf_s_l__extern"]
    pub fn _vsnwscanf_s_l(
        _Src: *const wchar_t,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vfwprintf_s_l__extern"]
    pub fn _vfwprintf_s_l(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vwprintf_s_l__extern"]
    pub fn _vwprintf_s_l(
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vfwprintf_s__extern"]
    pub fn vfwprintf_s(
        _File: *mut FILE,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vwprintf_s__extern"]
    pub fn vwprintf_s(_Format: *const wchar_t, _ArgList: va_list) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vswprintf_s_l__extern"]
    pub fn _vswprintf_s_l(
        _DstBuf: *mut wchar_t,
        _DstSize: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "vswprintf_s__extern"]
    pub fn vswprintf_s(
        _DstBuf: *mut wchar_t,
        _DstSize: usize,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vsnwprintf_s_l__extern"]
    pub fn _vsnwprintf_s_l(
        _DstBuf: *mut wchar_t,
        _DstSize: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[link_name = "_vsnwprintf_s__extern"]
    pub fn _vsnwprintf_s(
        _DstBuf: *mut wchar_t,
        _DstSize: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _ArgList: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wfopen_s(
        _File: *mut *mut FILE,
        _Filename: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wfreopen_s(
        _File: *mut *mut FILE,
        _Filename: *const wchar_t,
        _Mode: *const wchar_t,
        _OldFile: *mut FILE,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wtmpnam_s(_DstBuf: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn mbsrtowcs_s(
        _Retval: *mut usize,
        _Dst: *mut wchar_t,
        _SizeInWords: usize,
        _PSrc: *mut *const core::ffi::c_char,
        _N: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcrtomb_s(
        _Retval: *mut usize,
        _Dst: *mut core::ffi::c_char,
        _SizeInBytes: usize,
        _Ch: wchar_t,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsrtombs_s(
        _Retval: *mut usize,
        _Dst: *mut core::ffi::c_char,
        _SizeInBytes: usize,
        _Src: *mut *const wchar_t,
        _Size: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wmemcpy_s(
        _dest: *mut wchar_t,
        _numberOfElements: usize,
        _src: *const wchar_t,
        _count: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wmemmove_s(
        _dest: *mut wchar_t,
        _numberOfElements: usize,
        _src: *const wchar_t,
        _count: usize,
    ) -> errno_t;
}
pub type int_least8_t = core::ffi::c_schar;
pub type uint_least8_t = core::ffi::c_uchar;
pub type int_least16_t = core::ffi::c_short;
pub type uint_least16_t = core::ffi::c_ushort;
pub type int_least32_t = core::ffi::c_int;
pub type uint_least32_t = core::ffi::c_uint;
pub type int_least64_t = core::ffi::c_longlong;
pub type uint_least64_t = core::ffi::c_ulonglong;
pub type int_fast8_t = core::ffi::c_schar;
pub type uint_fast8_t = core::ffi::c_uchar;
pub type int_fast16_t = core::ffi::c_short;
pub type uint_fast16_t = core::ffi::c_ushort;
pub type int_fast32_t = core::ffi::c_int;
pub type uint_fast32_t = core::ffi::c_uint;
pub type int_fast64_t = core::ffi::c_longlong;
pub type uint_fast64_t = core::ffi::c_ulonglong;
pub type intmax_t = core::ffi::c_longlong;
pub type uintmax_t = core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::core::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::core::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::core::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::core::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(numer: intmax_t, denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        nptr: *const core::ffi::c_char,
        endptr: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        nptr: *const core::ffi::c_char,
        endptr: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: core::ffi::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        nptr: *const wchar_t,
        endptr: *mut *mut wchar_t,
        base: core::ffi::c_int,
    ) -> uintmax_t;
}
#[doc = " A signed 8-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Sint8 = i8;
#[doc = " An unsigned 8-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Uint8 = u8;
#[doc = " A signed 16-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Sint16 = i16;
#[doc = " An unsigned 16-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Uint16 = u16;
#[doc = " A signed 32-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Sint32 = i32;
#[doc = " An unsigned 32-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n"]
pub type Uint32 = u32;
#[doc = " A signed 64-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n\n **See Also:** SDL_SINT64_C\n"]
pub type Sint64 = i64;
#[doc = " An unsigned 64-bit integer type.\n\n **Available Since:** This macro is available since SDL 3.2.0.\n\n **See Also:** SDL_UINT64_C\n"]
pub type Uint64 = u64;
#[doc = " SDL times are signed, 64-bit integers representing nanoseconds since the\n Unix epoch (Jan 1, 1970).\n\n They can be converted between POSIX time_t values with SDL_NS_TO_SECONDS()\n and SDL_SECONDS_TO_NS(), and between Windows FILETIME values with\n SDL_TimeToWindows() and SDL_TimeFromWindows().\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_MAX_SINT64\n **See Also:** SDL_MIN_SINT64\n"]
pub type SDL_Time = Sint64;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct SDL_alignment_test {
    pub a: Uint8,
    pub b: *mut core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_alignment_test"][::core::mem::size_of::<SDL_alignment_test>() - 16usize];
    ["Alignment of SDL_alignment_test"][::core::mem::align_of::<SDL_alignment_test>() - 8usize];
    ["Offset of field: SDL_alignment_test::a"]
        [::core::mem::offset_of!(SDL_alignment_test, a) - 0usize];
    ["Offset of field: SDL_alignment_test::b"]
        [::core::mem::offset_of!(SDL_alignment_test, b) - 8usize];
};
impl Default for SDL_alignment_test {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl SDL_DUMMY_ENUM {
    pub const DUMMY_ENUM_VALUE: SDL_DUMMY_ENUM = SDL_DUMMY_ENUM(0);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_DUMMY_ENUM(pub core::ffi::c_uint);
unsafe extern "C" {
    #[doc = " Allocate uninitialized memory.\n\n The allocated memory returned by this function must be freed with\n SDL_free().\n\n If `size` is 0, it will be set to 1.\n\n If the allocation is successful, the returned pointer is guaranteed to be\n aligned to either the *fundamental alignment* (`alignof(max_align_t)` in\n C11 and later) or `2 * sizeof(void *)`, whichever is smaller. Use\n SDL_aligned_alloc() if you need to allocate memory aligned to an alignment\n greater than this guarantee.\n\n **Parameter:** size the size to allocate.\n **Returns:** a pointer to the allocated memory, or NULL if allocation failed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_free\n **See Also:** SDL_calloc\n **See Also:** SDL_realloc\n **See Also:** SDL_aligned_alloc\n"]
    pub fn SDL_malloc(size: usize) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Allocate a zero-initialized array.\n\n The memory returned by this function must be freed with SDL_free().\n\n If either of `nmemb` or `size` is 0, they will both be set to 1.\n\n If the allocation is successful, the returned pointer is guaranteed to be\n aligned to either the *fundamental alignment* (`alignof(max_align_t)` in\n C11 and later) or `2 * sizeof(void *)`, whichever is smaller.\n\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of each element of the array.\n **Returns:** a pointer to the allocated array, or NULL if allocation failed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_free\n **See Also:** SDL_malloc\n **See Also:** SDL_realloc\n"]
    pub fn SDL_calloc(nmemb: usize, size: usize) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Change the size of allocated memory.\n\n The memory returned by this function must be freed with SDL_free().\n\n If `size` is 0, it will be set to 1. Note that this is unlike some other C\n runtime `realloc` implementations, which may treat `realloc(mem, 0)` the\n same way as `free(mem)`.\n\n If `mem` is NULL, the behavior of this function is equivalent to\n SDL_malloc(). Otherwise, the function can have one of three possible\n outcomes:\n\n - If it returns the same pointer as `mem`, it means that `mem` was resized\n   in place without freeing.\n - If it returns a different non-NULL pointer, it means that `mem` was freed\n   and cannot be dereferenced anymore.\n - If it returns NULL (indicating failure), then `mem` will remain valid and\n   must still be freed with SDL_free().\n\n If the allocation is successfully resized, the returned pointer is\n guaranteed to be aligned to either the *fundamental alignment*\n (`alignof(max_align_t)` in C11 and later) or `2 * sizeof(void *)`,\n whichever is smaller.\n\n **Parameter:** mem a pointer to allocated memory to reallocate, or NULL.\n **Parameter:** size the new size of the memory.\n **Returns:** a pointer to the newly allocated memory, or NULL if allocation\n          failed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_free\n **See Also:** SDL_malloc\n **See Also:** SDL_calloc\n"]
    pub fn SDL_realloc(mem: *mut core::ffi::c_void, size: usize) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Free allocated memory.\n\n The pointer is no longer valid after this call and cannot be dereferenced\n anymore.\n\n If `mem` is NULL, this function does nothing.\n\n **Parameter:** mem a pointer to allocated memory, or NULL.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_malloc\n **See Also:** SDL_calloc\n **See Also:** SDL_realloc\n"]
    pub fn SDL_free(mem: *mut core::ffi::c_void);
}
#[doc = " A callback used to implement SDL_malloc().\n\n SDL will always ensure that the passed `size` is greater than 0.\n\n **Parameter:** size the size to allocate.\n **Returns:** a pointer to the allocated memory, or NULL if allocation failed.\n\n **Thread Safety:** It should be safe to call this callback from any thread.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_malloc\n **See Also:** SDL_GetOriginalMemoryFunctions\n **See Also:** SDL_GetMemoryFunctions\n **See Also:** SDL_SetMemoryFunctions\n"]
pub type SDL_malloc_func =
    ::core::option::Option<unsafe extern "C" fn(size: usize) -> *mut core::ffi::c_void>;
#[doc = " A callback used to implement SDL_calloc().\n\n SDL will always ensure that the passed `nmemb` and `size` are both greater\n than 0.\n\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of each element of the array.\n **Returns:** a pointer to the allocated array, or NULL if allocation failed.\n\n **Thread Safety:** It should be safe to call this callback from any thread.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_calloc\n **See Also:** SDL_GetOriginalMemoryFunctions\n **See Also:** SDL_GetMemoryFunctions\n **See Also:** SDL_SetMemoryFunctions\n"]
pub type SDL_calloc_func = ::core::option::Option<
    unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut core::ffi::c_void,
>;
#[doc = " A callback used to implement SDL_realloc().\n\n SDL will always ensure that the passed `size` is greater than 0.\n\n **Parameter:** mem a pointer to allocated memory to reallocate, or NULL.\n **Parameter:** size the new size of the memory.\n **Returns:** a pointer to the newly allocated memory, or NULL if allocation\n          failed.\n\n **Thread Safety:** It should be safe to call this callback from any thread.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_realloc\n **See Also:** SDL_GetOriginalMemoryFunctions\n **See Also:** SDL_GetMemoryFunctions\n **See Also:** SDL_SetMemoryFunctions\n"]
pub type SDL_realloc_func = ::core::option::Option<
    unsafe extern "C" fn(mem: *mut core::ffi::c_void, size: usize) -> *mut core::ffi::c_void,
>;
#[doc = " A callback used to implement SDL_free().\n\n SDL will always ensure that the passed `mem` is a non-NULL pointer.\n\n **Parameter:** mem a pointer to allocated memory.\n\n **Thread Safety:** It should be safe to call this callback from any thread.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_free\n **See Also:** SDL_GetOriginalMemoryFunctions\n **See Also:** SDL_GetMemoryFunctions\n **See Also:** SDL_SetMemoryFunctions\n"]
pub type SDL_free_func = ::core::option::Option<unsafe extern "C" fn(mem: *mut core::ffi::c_void)>;
unsafe extern "C" {
    #[doc = " Get the original set of SDL memory functions.\n\n This is what SDL_malloc and friends will use by default, if there has been\n no call to SDL_SetMemoryFunctions. This is not necessarily using the C\n runtime's `malloc` functions behind the scenes! Different platforms and\n build configurations might do any number of unexpected things.\n\n **Parameter:** malloc_func filled with malloc function.\n **Parameter:** calloc_func filled with calloc function.\n **Parameter:** realloc_func filled with realloc function.\n **Parameter:** free_func filled with free function.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_GetOriginalMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
unsafe extern "C" {
    #[doc = " Get the current set of SDL memory functions.\n\n **Parameter:** malloc_func filled with malloc function.\n **Parameter:** calloc_func filled with calloc function.\n **Parameter:** realloc_func filled with realloc function.\n **Parameter:** free_func filled with free function.\n\n **Thread Safety:** This does not hold a lock, so do not call this in the\n               unlikely event of a background thread calling\n               SDL_SetMemoryFunctions simultaneously.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_SetMemoryFunctions\n **See Also:** SDL_GetOriginalMemoryFunctions\n"]
    pub fn SDL_GetMemoryFunctions(
        malloc_func: *mut SDL_malloc_func,
        calloc_func: *mut SDL_calloc_func,
        realloc_func: *mut SDL_realloc_func,
        free_func: *mut SDL_free_func,
    );
}
unsafe extern "C" {
    #[doc = " Replace SDL's memory allocation functions with a custom set.\n\n It is not safe to call this function once any allocations have been made,\n as future calls to SDL_free will use the new allocator, even if they came\n from an SDL_malloc made with the old one!\n\n If used, usually this needs to be the first call made into the SDL library,\n if not the very first thing done at program startup time.\n\n **Parameter:** malloc_func custom malloc function.\n **Parameter:** calloc_func custom calloc function.\n **Parameter:** realloc_func custom realloc function.\n **Parameter:** free_func custom free function.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread, but one\n               should not replace the memory functions once any allocations\n               are made!\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetMemoryFunctions\n **See Also:** SDL_GetOriginalMemoryFunctions\n"]
    pub fn SDL_SetMemoryFunctions(
        malloc_func: SDL_malloc_func,
        calloc_func: SDL_calloc_func,
        realloc_func: SDL_realloc_func,
        free_func: SDL_free_func,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Allocate memory aligned to a specific alignment.\n\n The memory returned by this function must be freed with SDL_aligned_free(),\n _not_ SDL_free().\n\n If `alignment` is less than the size of `void *`, it will be increased to\n match that.\n\n The returned memory address will be a multiple of the alignment value, and\n the size of the memory allocated will be a multiple of the alignment value.\n\n **Parameter:** alignment the alignment of the memory.\n **Parameter:** size the size to allocate.\n **Returns:** a pointer to the aligned memory, or NULL if allocation failed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_aligned_free\n"]
    pub fn SDL_aligned_alloc(alignment: usize, size: usize) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Free memory allocated by SDL_aligned_alloc().\n\n The pointer is no longer valid after this call and cannot be dereferenced\n anymore.\n\n If `mem` is NULL, this function does nothing.\n\n **Parameter:** mem a pointer previously returned by SDL_aligned_alloc(), or NULL.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_aligned_alloc\n"]
    pub fn SDL_aligned_free(mem: *mut core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " Get the number of outstanding (unfreed) allocations.\n\n **Returns:** the number of allocations or -1 if allocation counting is\n          disabled.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_GetNumAllocations() -> core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Environment {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Get the process environment.\n\n This is initialized at application start and is not affected by setenv()\n and unsetenv() calls after that point. Use SDL_SetEnvironmentVariable() and\n SDL_UnsetEnvironmentVariable() if you want to modify this environment, or\n SDL_setenv_unsafe() or SDL_unsetenv_unsafe() if you want changes to persist\n in the C runtime environment after SDL_Quit().\n\n **Returns:** a pointer to the environment for the process or NULL on failure;\n          call SDL_GetError() for more information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironmentVariable\n **See Also:** SDL_GetEnvironmentVariables\n **See Also:** SDL_SetEnvironmentVariable\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_GetEnvironment() -> *mut SDL_Environment;
}
unsafe extern "C" {
    #[doc = " Create a set of environment variables\n\n **Parameter:** populated true to initialize it from the C runtime environment,\n                  false to create an empty environment.\n **Returns:** a pointer to the new environment or NULL on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** If `populated` is false, it is safe to call this function\n               from any thread, otherwise it is safe if no other threads are\n               calling setenv() or unsetenv()\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironmentVariable\n **See Also:** SDL_GetEnvironmentVariables\n **See Also:** SDL_SetEnvironmentVariable\n **See Also:** SDL_UnsetEnvironmentVariable\n **See Also:** SDL_DestroyEnvironment\n"]
    pub fn SDL_CreateEnvironment(populated: bool) -> *mut SDL_Environment;
}
unsafe extern "C" {
    #[doc = " Get the value of a variable in the environment.\n\n **Parameter:** env the environment to query.\n **Parameter:** name the name of the variable to get.\n **Returns:** a pointer to the value of the variable or NULL if it can't be\n          found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironment\n **See Also:** SDL_CreateEnvironment\n **See Also:** SDL_GetEnvironmentVariables\n **See Also:** SDL_SetEnvironmentVariable\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_GetEnvironmentVariable(
        env: *mut SDL_Environment,
        name: *const core::ffi::c_char,
    ) -> *const core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Get all variables in the environment.\n\n **Parameter:** env the environment to query.\n **Returns:** a NULL terminated array of pointers to environment variables in\n          the form \"variable=value\" or NULL on failure; call SDL_GetError()\n          for more information. This is a single allocation that should be\n          freed with SDL_free() when it is no longer needed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironment\n **See Also:** SDL_CreateEnvironment\n **See Also:** SDL_GetEnvironmentVariable\n **See Also:** SDL_SetEnvironmentVariable\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_GetEnvironmentVariables(env: *mut SDL_Environment) -> *mut *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Set the value of a variable in the environment.\n\n **Parameter:** env the environment to modify.\n **Parameter:** name the name of the variable to set.\n **Parameter:** value the value of the variable to set.\n **Parameter:** overwrite true to overwrite the variable if it exists, false to\n                  return success without setting the variable if it already\n                  exists.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironment\n **See Also:** SDL_CreateEnvironment\n **See Also:** SDL_GetEnvironmentVariable\n **See Also:** SDL_GetEnvironmentVariables\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_SetEnvironmentVariable(
        env: *mut SDL_Environment,
        name: *const core::ffi::c_char,
        value: *const core::ffi::c_char,
        overwrite: bool,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Clear a variable from the environment.\n\n **Parameter:** env the environment to modify.\n **Parameter:** name the name of the variable to unset.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetEnvironment\n **See Also:** SDL_CreateEnvironment\n **See Also:** SDL_GetEnvironmentVariable\n **See Also:** SDL_GetEnvironmentVariables\n **See Also:** SDL_SetEnvironmentVariable\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_UnsetEnvironmentVariable(
        env: *mut SDL_Environment,
        name: *const core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Destroy a set of environment variables.\n\n **Parameter:** env the environment to destroy.\n\n **Thread Safety:** It is safe to call this function from any thread, as long as\n               the environment is no longer in use.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_CreateEnvironment\n"]
    pub fn SDL_DestroyEnvironment(env: *mut SDL_Environment);
}
unsafe extern "C" {
    #[doc = " Get the value of a variable in the environment.\n\n The name of the variable is case sensitive on all platforms.\n\n This function uses SDL's cached copy of the environment and is thread-safe.\n\n **Parameter:** name the name of the variable to get.\n **Returns:** a pointer to the value of the variable or NULL if it can't be\n          found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_getenv(name: *const core::ffi::c_char) -> *const core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Get the value of a variable in the environment.\n\n This function bypasses SDL's cached copy of the environment and is not\n thread-safe.\n\n On some platforms, this may make case-insensitive matches, while other\n platforms are case-sensitive. It is best to be precise with strings used\n for queries through this interface. SDL_getenv is always case-sensitive,\n however.\n\n **Parameter:** name the name of the variable to get.\n **Returns:** a pointer to the value of the variable or NULL if it can't be\n          found.\n\n **Thread Safety:** This function is not thread safe, consider using SDL_getenv()\n               instead.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_getenv\n"]
    pub fn SDL_getenv_unsafe(name: *const core::ffi::c_char) -> *const core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Set the value of a variable in the environment.\n\n **Parameter:** name the name of the variable to set.\n **Parameter:** value the value of the variable to set.\n **Parameter:** overwrite 1 to overwrite the variable if it exists, 0 to return\n                  success without setting the variable if it already exists.\n **Returns:** 0 on success, -1 on error.\n\n **Thread Safety:** This function is not thread safe, consider using\n               SDL_SetEnvironmentVariable() instead.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_SetEnvironmentVariable\n"]
    pub fn SDL_setenv_unsafe(
        name: *const core::ffi::c_char,
        value: *const core::ffi::c_char,
        overwrite: core::ffi::c_int,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Clear a variable from the environment.\n\n **Parameter:** name the name of the variable to unset.\n **Returns:** 0 on success, -1 on error.\n\n **Thread Safety:** This function is not thread safe, consider using\n               SDL_UnsetEnvironmentVariable() instead.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_UnsetEnvironmentVariable\n"]
    pub fn SDL_unsetenv_unsafe(name: *const core::ffi::c_char) -> core::ffi::c_int;
}
#[doc = " A callback used with SDL sorting and binary search functions.\n\n **Parameter:** a a pointer to the first element being compared.\n **Parameter:** b a pointer to the second element being compared.\n **Returns:** -1 if `a` should be sorted before `b`, 1 if `b` should be sorted\n          before `a`, 0 if they are equal. If two elements are equal, their\n          order in the sorted array is undefined.\n\n **Available Since:** This callback is available since SDL 3.2.0.\n\n **See Also:** SDL_bsearch\n **See Also:** SDL_qsort\n"]
pub type SDL_CompareCallback = ::core::option::Option<
    unsafe extern "C" fn(
        a: *const core::ffi::c_void,
        b: *const core::ffi::c_void,
    ) -> core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = " Sort an array.\n\n For example:\n\n ```c\n typedef struct {\n     int key;\n     const char *string;\n } data;\n\n int SDLCALL compare(const void *a, const void *b)\n {\n     const data *A = (const data *)a;\n     const data *B = (const data *)b;\n\n     if (A->n < B->n) {\n         return -1;\n     } else if (B->n < A->n) {\n         return 1;\n     } else {\n         return 0;\n     }\n }\n\n data values[] = {\n     { 3, \"third\" }, { 1, \"first\" }, { 2, \"second\" }\n };\n\n SDL_qsort(values, SDL_arraysize(values), sizeof(values[0]), compare);\n ```\n\n **Parameter:** base a pointer to the start of the array.\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of the elements in the array.\n **Parameter:** compare a function used to compare elements in the array.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_bsearch\n **See Also:** SDL_qsort_r\n"]
    pub fn SDL_qsort(
        base: *mut core::ffi::c_void,
        nmemb: usize,
        size: usize,
        compare: SDL_CompareCallback,
    );
}
unsafe extern "C" {
    #[doc = " Perform a binary search on a previously sorted array.\n\n For example:\n\n ```c\n typedef struct {\n     int key;\n     const char *string;\n } data;\n\n int SDLCALL compare(const void *a, const void *b)\n {\n     const data *A = (const data *)a;\n     const data *B = (const data *)b;\n\n     if (A->n < B->n) {\n         return -1;\n     } else if (B->n < A->n) {\n         return 1;\n     } else {\n         return 0;\n     }\n }\n\n data values[] = {\n     { 1, \"first\" }, { 2, \"second\" }, { 3, \"third\" }\n };\n data key = { 2, NULL };\n\n data *result = SDL_bsearch(&key, values, SDL_arraysize(values), sizeof(values[0]), compare);\n ```\n\n **Parameter:** key a pointer to a key equal to the element being searched for.\n **Parameter:** base a pointer to the start of the array.\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of the elements in the array.\n **Parameter:** compare a function used to compare elements in the array.\n **Returns:** a pointer to the matching element in the array, or NULL if not\n          found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_bsearch_r\n **See Also:** SDL_qsort\n"]
    pub fn SDL_bsearch(
        key: *const core::ffi::c_void,
        base: *const core::ffi::c_void,
        nmemb: usize,
        size: usize,
        compare: SDL_CompareCallback,
    ) -> *mut core::ffi::c_void;
}
#[doc = " A callback used with SDL sorting and binary search functions.\n\n **Parameter:** userdata the `userdata` pointer passed to the sort function.\n **Parameter:** a a pointer to the first element being compared.\n **Parameter:** b a pointer to the second element being compared.\n **Returns:** -1 if `a` should be sorted before `b`, 1 if `b` should be sorted\n          before `a`, 0 if they are equal. If two elements are equal, their\n          order in the sorted array is undefined.\n\n **Available Since:** This callback is available since SDL 3.2.0.\n\n **See Also:** SDL_qsort_r\n **See Also:** SDL_bsearch_r\n"]
pub type SDL_CompareCallback_r = ::core::option::Option<
    unsafe extern "C" fn(
        userdata: *mut core::ffi::c_void,
        a: *const core::ffi::c_void,
        b: *const core::ffi::c_void,
    ) -> core::ffi::c_int,
>;
unsafe extern "C" {
    #[doc = " Sort an array, passing a userdata pointer to the compare function.\n\n For example:\n\n ```c\n typedef enum {\n     sort_increasing,\n     sort_decreasing,\n } sort_method;\n\n typedef struct {\n     int key;\n     const char *string;\n } data;\n\n int SDLCALL compare(const void *userdata, const void *a, const void *b)\n {\n     sort_method method = (sort_method)(uintptr_t)userdata;\n     const data *A = (const data *)a;\n     const data *B = (const data *)b;\n\n     if (A->key < B->key) {\n         return (method == sort_increasing) ? -1 : 1;\n     } else if (B->key < A->key) {\n         return (method == sort_increasing) ? 1 : -1;\n     } else {\n         return 0;\n     }\n }\n\n data values[] = {\n     { 3, \"third\" }, { 1, \"first\" }, { 2, \"second\" }\n };\n\n SDL_qsort_r(values, SDL_arraysize(values), sizeof(values[0]), compare, (const void *)(uintptr_t)sort_increasing);\n ```\n\n **Parameter:** base a pointer to the start of the array.\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of the elements in the array.\n **Parameter:** compare a function used to compare elements in the array.\n **Parameter:** userdata a pointer to pass to the compare function.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_bsearch_r\n **See Also:** SDL_qsort\n"]
    pub fn SDL_qsort_r(
        base: *mut core::ffi::c_void,
        nmemb: usize,
        size: usize,
        compare: SDL_CompareCallback_r,
        userdata: *mut core::ffi::c_void,
    );
}
unsafe extern "C" {
    #[doc = " Perform a binary search on a previously sorted array, passing a userdata\n pointer to the compare function.\n\n For example:\n\n ```c\n typedef enum {\n     sort_increasing,\n     sort_decreasing,\n } sort_method;\n\n typedef struct {\n     int key;\n     const char *string;\n } data;\n\n int SDLCALL compare(const void *userdata, const void *a, const void *b)\n {\n     sort_method method = (sort_method)(uintptr_t)userdata;\n     const data *A = (const data *)a;\n     const data *B = (const data *)b;\n\n     if (A->key < B->key) {\n         return (method == sort_increasing) ? -1 : 1;\n     } else if (B->key < A->key) {\n         return (method == sort_increasing) ? 1 : -1;\n     } else {\n         return 0;\n     }\n }\n\n data values[] = {\n     { 1, \"first\" }, { 2, \"second\" }, { 3, \"third\" }\n };\n data key = { 2, NULL };\n\n data *result = SDL_bsearch_r(&key, values, SDL_arraysize(values), sizeof(values[0]), compare, (const void *)(uintptr_t)sort_increasing);\n ```\n\n **Parameter:** key a pointer to a key equal to the element being searched for.\n **Parameter:** base a pointer to the start of the array.\n **Parameter:** nmemb the number of elements in the array.\n **Parameter:** size the size of the elements in the array.\n **Parameter:** compare a function used to compare elements in the array.\n **Parameter:** userdata a pointer to pass to the compare function.\n **Returns:** a pointer to the matching element in the array, or NULL if not\n          found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_bsearch\n **See Also:** SDL_qsort_r\n"]
    pub fn SDL_bsearch_r(
        key: *const core::ffi::c_void,
        base: *const core::ffi::c_void,
        nmemb: usize,
        size: usize,
        compare: SDL_CompareCallback_r,
        userdata: *mut core::ffi::c_void,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Compute the absolute value of `x`.\n\n **Parameter:** x an integer value.\n **Returns:** the absolute value of x.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_abs(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query if a character is alphabetic (a letter).\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n for English 'a-z' and 'A-Z' as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isalpha(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query if a character is alphabetic (a letter) or a number.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n for English 'a-z', 'A-Z', and '0-9' as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isalnum(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is blank (a space or tab).\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n 0x20 (space) or 0x9 (tab) as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isblank(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is a control character.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n 0 through 0x1F, and 0x7F, as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_iscntrl(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is a numeric digit.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n '0' (0x30) through '9' (0x39), as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isdigit(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is a hexadecimal digit.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n 'A' through 'F', 'a' through 'f', and '0' through '9', as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isxdigit(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is a punctuation mark.\n\n **WARNING**: Regardless of system locale, this is equivalent to\n `((SDL_isgraph(x)) && (!SDL_isalnum(x)))`.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isgraph\n **See Also:** SDL_isalnum\n"]
    pub fn SDL_ispunct(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is whitespace.\n\n **WARNING**: Regardless of system locale, this will only treat the\n following ASCII values as true:\n\n - space (0x20)\n - tab (0x09)\n - newline (0x0A)\n - vertical tab (0x0B)\n - form feed (0x0C)\n - return (0x0D)\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isspace(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is upper case.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n 'A' through 'Z' as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isupper(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is lower case.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n 'a' through 'z' as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_islower(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is \"printable\".\n\n Be advised that \"printable\" has a definition that goes back to text\n terminals from the dawn of computing, making this a sort of special case\n function that is not suitable for Unicode (or most any) text management.\n\n **WARNING**: Regardless of system locale, this will only treat ASCII values\n ' ' (0x20) through '~' (0x7E) as true.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_isprint(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Report if a character is any \"printable\" except space.\n\n Be advised that \"printable\" has a definition that goes back to text\n terminals from the dawn of computing, making this a sort of special case\n function that is not suitable for Unicode (or most any) text management.\n\n **WARNING**: Regardless of system locale, this is equivalent to\n `(SDL_isprint(x)) && ((x) != ' ')`.\n\n **Parameter:** x character value to check.\n **Returns:** non-zero if x falls within the character class, zero otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isprint\n"]
    pub fn SDL_isgraph(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Convert low-ASCII English letters to uppercase.\n\n **WARNING**: Regardless of system locale, this will only convert ASCII\n values 'a' through 'z' to uppercase.\n\n This function returns the uppercase equivalent of `x`. If a character\n cannot be converted, or is already uppercase, this function returns `x`.\n\n **Parameter:** x character value to check.\n **Returns:** capitalized version of x, or x if no conversion available.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_toupper(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Convert low-ASCII English letters to lowercase.\n\n **WARNING**: Regardless of system locale, this will only convert ASCII\n values 'A' through 'Z' to lowercase.\n\n This function returns the lowercase equivalent of `x`. If a character\n cannot be converted, or is already lowercase, this function returns `x`.\n\n **Parameter:** x character value to check.\n **Returns:** lowercase version of x, or x if no conversion available.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_tolower(x: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Calculate a CRC-16 value.\n\n https://en.wikipedia.org/wiki/Cyclic_redundancy_check\n\n This function can be called multiple times, to stream data to be\n checksummed in blocks. Each call must provide the previous CRC-16 return\n value to be updated with the next block. The first call to this function\n for a set of blocks should pass in a zero CRC value.\n\n **Parameter:** crc the current checksum for this data set, or 0 for a new data set.\n **Parameter:** data a new block of data to add to the checksum.\n **Parameter:** len the size, in bytes, of the new block of data.\n **Returns:** a CRC-16 checksum value of all blocks in the data set.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_crc16(crc: Uint16, data: *const core::ffi::c_void, len: usize) -> Uint16;
}
unsafe extern "C" {
    #[doc = " Calculate a CRC-32 value.\n\n https://en.wikipedia.org/wiki/Cyclic_redundancy_check\n\n This function can be called multiple times, to stream data to be\n checksummed in blocks. Each call must provide the previous CRC-32 return\n value to be updated with the next block. The first call to this function\n for a set of blocks should pass in a zero CRC value.\n\n **Parameter:** crc the current checksum for this data set, or 0 for a new data set.\n **Parameter:** data a new block of data to add to the checksum.\n **Parameter:** len the size, in bytes, of the new block of data.\n **Returns:** a CRC-32 checksum value of all blocks in the data set.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_crc32(crc: Uint32, data: *const core::ffi::c_void, len: usize) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Calculate a 32-bit MurmurHash3 value for a block of data.\n\n https://en.wikipedia.org/wiki/MurmurHash\n\n A seed may be specified, which changes the final results consistently, but\n this does not work like SDL_crc16 and SDL_crc32: you can't feed a previous\n result from this function back into itself as the next seed value to\n calculate a hash in chunks; it won't produce the same hash as it would if\n the same data was provided in a single call.\n\n If you aren't sure what to provide for a seed, zero is fine. Murmur3 is not\n cryptographically secure, so it shouldn't be used for hashing top-secret\n data.\n\n **Parameter:** data the data to be hashed.\n **Parameter:** len the size of data, in bytes.\n **Parameter:** seed a value that alters the final hash value.\n **Returns:** a Murmur3 32-bit hash value.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_murmur3_32(data: *const core::ffi::c_void, len: usize, seed: Uint32) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Copy non-overlapping memory.\n\n The memory regions must not overlap. If they do, use SDL_memmove() instead.\n\n **Parameter:** dst The destination memory region. Must not be NULL, and must not\n            overlap with `src`.\n **Parameter:** src The source memory region. Must not be NULL, and must not overlap\n            with `dst`.\n **Parameter:** len The length in bytes of both `dst` and `src`.\n **Returns:** `dst`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_memmove\n"]
    pub fn SDL_memcpy(
        dst: *mut core::ffi::c_void,
        src: *const core::ffi::c_void,
        len: usize,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Copy memory ranges that might overlap.\n\n It is okay for the memory regions to overlap. If you are confident that the\n regions never overlap, using SDL_memcpy() may improve performance.\n\n **Parameter:** dst The destination memory region. Must not be NULL.\n **Parameter:** src The source memory region. Must not be NULL.\n **Parameter:** len The length in bytes of both `dst` and `src`.\n **Returns:** `dst`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_memcpy\n"]
    pub fn SDL_memmove(
        dst: *mut core::ffi::c_void,
        src: *const core::ffi::c_void,
        len: usize,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Initialize all bytes of buffer of memory to a specific value.\n\n This function will set `len` bytes, pointed to by `dst`, to the value\n specified in `c`.\n\n Despite `c` being an `int` instead of a `char`, this only operates on\n bytes; `c` must be a value between 0 and 255, inclusive.\n\n **Parameter:** dst the destination memory region. Must not be NULL.\n **Parameter:** c the byte value to set.\n **Parameter:** len the length, in bytes, to set in `dst`.\n **Returns:** `dst`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_memset(
        dst: *mut core::ffi::c_void,
        c: core::ffi::c_int,
        len: usize,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Initialize all 32-bit words of buffer of memory to a specific value.\n\n This function will set a buffer of `dwords` Uint32 values, pointed to by\n `dst`, to the value specified in `val`.\n\n Unlike SDL_memset, this sets 32-bit values, not bytes, so it's not limited\n to a range of 0-255.\n\n **Parameter:** dst the destination memory region. Must not be NULL.\n **Parameter:** val the Uint32 value to set.\n **Parameter:** dwords the number of Uint32 values to set in `dst`.\n **Returns:** `dst`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_memset4(
        dst: *mut core::ffi::c_void,
        val: Uint32,
        dwords: usize,
    ) -> *mut core::ffi::c_void;
}
unsafe extern "C" {
    #[doc = " Compare two buffers of memory.\n\n **Parameter:** s1 the first buffer to compare. NULL is not permitted!\n **Parameter:** s2 the second buffer to compare. NULL is not permitted!\n **Parameter:** len the number of bytes to compare between the buffers.\n **Returns:** less than zero if s1 is \"less than\" s2, greater than zero if s1 is\n          \"greater than\" s2, and zero if the buffers match exactly for `len`\n          bytes.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_memcmp(
        s1: *const core::ffi::c_void,
        s2: *const core::ffi::c_void,
        len: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like wcslen() but doesn't require access to a C runtime.\n\n Counts the number of wchar_t values in `wstr`, excluding the null\n terminator.\n\n Like SDL_strlen only counts bytes and not codepoints in a UTF-8 string,\n this counts wchar_t values in a string, even if the string's encoding is of\n variable width, like UTF-16.\n\n Also be aware that wchar_t is different sizes on different platforms (4\n bytes on Linux, 2 on Windows, etc).\n\n **Parameter:** wstr The null-terminated wide string to read. Must not be NULL.\n **Returns:** the length (in wchar_t values, excluding the null terminator) of\n          `wstr`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_wcsnlen\n **See Also:** SDL_utf8strlen\n **See Also:** SDL_utf8strnlen\n"]
    pub fn SDL_wcslen(wstr: *const wchar_t) -> usize;
}
unsafe extern "C" {
    #[doc = " This works exactly like wcsnlen() but doesn't require access to a C\n runtime.\n\n Counts up to a maximum of `maxlen` wchar_t values in `wstr`, excluding the\n null terminator.\n\n Like SDL_strnlen only counts bytes and not codepoints in a UTF-8 string,\n this counts wchar_t values in a string, even if the string's encoding is of\n variable width, like UTF-16.\n\n Also be aware that wchar_t is different sizes on different platforms (4\n bytes on Linux, 2 on Windows, etc).\n\n Also, `maxlen` is a count of wide characters, not bytes!\n\n **Parameter:** wstr The null-terminated wide string to read. Must not be NULL.\n **Parameter:** maxlen The maximum amount of wide characters to count.\n **Returns:** the length (in wide characters, excluding the null terminator) of\n          `wstr` but never more than `maxlen`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_wcslen\n **See Also:** SDL_utf8strlen\n **See Also:** SDL_utf8strnlen\n"]
    pub fn SDL_wcsnlen(wstr: *const wchar_t, maxlen: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Copy a wide string.\n\n This function copies `maxlen` - 1 wide characters from `src` to `dst`, then\n appends a null terminator.\n\n `src` and `dst` must not overlap.\n\n If `maxlen` is 0, no wide characters are copied and no null terminator is\n written.\n\n **Parameter:** dst The destination buffer. Must not be NULL, and must not overlap\n            with `src`.\n **Parameter:** src The null-terminated wide string to copy. Must not be NULL, and\n            must not overlap with `dst`.\n **Parameter:** maxlen The length (in wide characters) of the destination buffer.\n **Returns:** the length (in wide characters, excluding the null terminator) of\n          `src`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_wcslcat\n"]
    pub fn SDL_wcslcpy(dst: *mut wchar_t, src: *const wchar_t, maxlen: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Concatenate wide strings.\n\n This function appends up to `maxlen` - SDL_wcslen(dst) - 1 wide characters\n from `src` to the end of the wide string in `dst`, then appends a null\n terminator.\n\n `src` and `dst` must not overlap.\n\n If `maxlen` - SDL_wcslen(dst) - 1 is less than or equal to 0, then `dst` is\n unmodified.\n\n **Parameter:** dst The destination buffer already containing the first\n            null-terminated wide string. Must not be NULL and must not\n            overlap with `src`.\n **Parameter:** src The second null-terminated wide string. Must not be NULL, and\n            must not overlap with `dst`.\n **Parameter:** maxlen The length (in wide characters) of the destination buffer.\n **Returns:** the length (in wide characters, excluding the null terminator) of\n          the string in `dst` plus the length of `src`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_wcslcpy\n"]
    pub fn SDL_wcslcat(dst: *mut wchar_t, src: *const wchar_t, maxlen: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Allocate a copy of a wide string.\n\n This allocates enough space for a null-terminated copy of `wstr`, using\n SDL_malloc, and then makes a copy of the string into this space.\n\n The returned string is owned by the caller, and should be passed to\n SDL_free when no longer needed.\n\n **Parameter:** wstr the string to copy.\n **Returns:** a pointer to the newly-allocated wide string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcsdup(wstr: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    #[doc = " Search a wide string for the first instance of a specific substring.\n\n The search ends once it finds the requested substring, or a null terminator\n byte to end the string.\n\n Note that this looks for strings of _wide characters_, not _codepoints_, so\n it's legal to search for malformed and incomplete UTF-16 sequences.\n\n **Parameter:** haystack the wide string to search. Must not be NULL.\n **Parameter:** needle the wide string to search for. Must not be NULL.\n **Returns:** a pointer to the first instance of `needle` in the string, or NULL\n          if not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcsstr(haystack: *const wchar_t, needle: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    #[doc = " Search a wide string, up to n wide chars, for the first instance of a\n specific substring.\n\n The search ends once it finds the requested substring, or a null terminator\n value to end the string, or `maxlen` wide character have been examined. It\n is possible to use this function on a wide string without a null\n terminator.\n\n Note that this looks for strings of _wide characters_, not _codepoints_, so\n it's legal to search for malformed and incomplete UTF-16 sequences.\n\n **Parameter:** haystack the wide string to search. Must not be NULL.\n **Parameter:** needle the wide string to search for. Must not be NULL.\n **Parameter:** maxlen the maximum number of wide characters to search in\n               `haystack`.\n **Returns:** a pointer to the first instance of `needle` in the string, or NULL\n          if not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcsnstr(
        haystack: *const wchar_t,
        needle: *const wchar_t,
        maxlen: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    #[doc = " Compare two null-terminated wide strings.\n\n This only compares wchar_t values until it hits a null-terminating\n character; it does not care if the string is well-formed UTF-16 (or UTF-32,\n depending on your platform's wchar_t size), or uses valid Unicode values.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcscmp(str1: *const wchar_t, str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two wide strings up to a number of wchar_t values.\n\n This only compares wchar_t values; it does not care if the string is\n well-formed UTF-16 (or UTF-32, depending on your platform's wchar_t size),\n or uses valid Unicode values.\n\n Note that while this function is intended to be used with UTF-16 (or\n UTF-32, depending on your platform's definition of wchar_t), it is\n comparing raw wchar_t values and not Unicode codepoints: `maxlen` specifies\n a wchar_t limit! If the limit lands in the middle of a multi-wchar UTF-16\n sequence, it will only compare a portion of the final character.\n\n `maxlen` specifies a maximum number of wchar_t to compare; if the strings\n match to this number of wide chars (or both have matched to a\n null-terminator character before this count), they will be considered\n equal.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Parameter:** maxlen the maximum number of wchar_t to compare.\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcsncmp(
        str1: *const wchar_t,
        str2: *const wchar_t,
        maxlen: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two null-terminated wide strings, case-insensitively.\n\n This will work with Unicode strings, using a technique called\n \"case-folding\" to handle the vast majority of case-sensitive human\n languages regardless of system locale. It can deal with expanding values: a\n German Eszett character can compare against two ASCII 's' chars and be\n considered a match, for example. A notable exception: it does not handle\n the Turkish 'i' character; human language is complicated!\n\n Depending on your platform, \"wchar_t\" might be 2 bytes, and expected to be\n UTF-16 encoded (like Windows), or 4 bytes in UTF-32 format. Since this\n handles Unicode, it expects the string to be well-formed and not a\n null-terminated string of arbitrary bytes. Characters that are not valid\n UTF-16 (or UTF-32) are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), which is to say two strings of random bits may turn out to\n match if they convert to the same amount of replacement characters.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcscasecmp(str1: *const wchar_t, str2: *const wchar_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two wide strings, case-insensitively, up to a number of wchar_t.\n\n This will work with Unicode strings, using a technique called\n \"case-folding\" to handle the vast majority of case-sensitive human\n languages regardless of system locale. It can deal with expanding values: a\n German Eszett character can compare against two ASCII 's' chars and be\n considered a match, for example. A notable exception: it does not handle\n the Turkish 'i' character; human language is complicated!\n\n Depending on your platform, \"wchar_t\" might be 2 bytes, and expected to be\n UTF-16 encoded (like Windows), or 4 bytes in UTF-32 format. Since this\n handles Unicode, it expects the string to be well-formed and not a\n null-terminated string of arbitrary bytes. Characters that are not valid\n UTF-16 (or UTF-32) are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), which is to say two strings of random bits may turn out to\n match if they convert to the same amount of replacement characters.\n\n Note that while this function might deal with variable-sized characters,\n `maxlen` specifies a _wchar_ limit! If the limit lands in the middle of a\n multi-byte UTF-16 sequence, it may convert a portion of the final character\n to one or more Unicode character U+FFFD (REPLACEMENT CHARACTER) so as not\n to overflow a buffer.\n\n `maxlen` specifies a maximum number of wchar_t values to compare; if the\n strings match to this number of wchar_t (or both have matched to a\n null-terminator character before this number of bytes), they will be\n considered equal.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Parameter:** maxlen the maximum number of wchar_t values to compare.\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_wcsncasecmp(
        str1: *const wchar_t,
        str2: *const wchar_t,
        maxlen: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Parse a `long` from a wide string.\n\n If `str` starts with whitespace, then those whitespace characters are\n skipped before attempting to parse the number.\n\n If the parsed number does not fit inside a `long`, the result is clamped to\n the minimum and maximum representable `long` values.\n\n **Parameter:** str The null-terminated wide string to read. Must not be NULL.\n **Parameter:** endp If not NULL, the address of the first invalid wide character\n             (i.e. the next character after the parsed number) will be\n             written to this pointer.\n **Parameter:** base The base of the integer to read. Supported values are 0 and 2\n             to 36 inclusive. If 0, the base will be inferred from the\n             number's prefix (0x for hexadecimal, 0 for octal, decimal\n             otherwise).\n **Returns:** the parsed `long`, or 0 if no number could be parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strtol\n"]
    pub fn SDL_wcstol(
        str_: *const wchar_t,
        endp: *mut *mut wchar_t,
        base: core::ffi::c_int,
    ) -> core::ffi::c_long;
}
unsafe extern "C" {
    #[doc = " This works exactly like strlen() but doesn't require access to a C runtime.\n\n Counts the bytes in `str`, excluding the null terminator.\n\n If you need the length of a UTF-8 string, consider using SDL_utf8strlen().\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Returns:** the length (in bytes, excluding the null terminator) of `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strnlen\n **See Also:** SDL_utf8strlen\n **See Also:** SDL_utf8strnlen\n"]
    pub fn SDL_strlen(str_: *const core::ffi::c_char) -> usize;
}
unsafe extern "C" {
    #[doc = " This works exactly like strnlen() but doesn't require access to a C\n runtime.\n\n Counts up to a maximum of `maxlen` bytes in `str`, excluding the null\n terminator.\n\n If you need the length of a UTF-8 string, consider using SDL_utf8strnlen().\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Parameter:** maxlen The maximum amount of bytes to count.\n **Returns:** the length (in bytes, excluding the null terminator) of `src` but\n          never more than `maxlen`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strlen\n **See Also:** SDL_utf8strlen\n **See Also:** SDL_utf8strnlen\n"]
    pub fn SDL_strnlen(str_: *const core::ffi::c_char, maxlen: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Copy a string.\n\n This function copies up to `maxlen` - 1 characters from `src` to `dst`,\n then appends a null terminator.\n\n If `maxlen` is 0, no characters are copied and no null terminator is\n written.\n\n If you want to copy an UTF-8 string but need to ensure that multi-byte\n sequences are not truncated, consider using SDL_utf8strlcpy().\n\n **Parameter:** dst The destination buffer. Must not be NULL, and must not overlap\n            with `src`.\n **Parameter:** src The null-terminated string to copy. Must not be NULL, and must\n            not overlap with `dst`.\n **Parameter:** maxlen The length (in characters) of the destination buffer.\n **Returns:** the length (in characters, excluding the null terminator) of\n          `src`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strlcat\n **See Also:** SDL_utf8strlcpy\n"]
    pub fn SDL_strlcpy(
        dst: *mut core::ffi::c_char,
        src: *const core::ffi::c_char,
        maxlen: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Copy an UTF-8 string.\n\n This function copies up to `dst_bytes` - 1 bytes from `src` to `dst` while\n also ensuring that the string written to `dst` does not end in a truncated\n multi-byte sequence. Finally, it appends a null terminator.\n\n `src` and `dst` must not overlap.\n\n Note that unlike SDL_strlcpy(), this function returns the number of bytes\n written, not the length of `src`.\n\n **Parameter:** dst The destination buffer. Must not be NULL, and must not overlap\n            with `src`.\n **Parameter:** src The null-terminated UTF-8 string to copy. Must not be NULL, and\n            must not overlap with `dst`.\n **Parameter:** dst_bytes The length (in bytes) of the destination buffer. Must not\n                  be 0.\n **Returns:** the number of bytes written, excluding the null terminator.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strlcpy\n"]
    pub fn SDL_utf8strlcpy(
        dst: *mut core::ffi::c_char,
        src: *const core::ffi::c_char,
        dst_bytes: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Concatenate strings.\n\n This function appends up to `maxlen` - SDL_strlen(dst) - 1 characters from\n `src` to the end of the string in `dst`, then appends a null terminator.\n\n `src` and `dst` must not overlap.\n\n If `maxlen` - SDL_strlen(dst) - 1 is less than or equal to 0, then `dst` is\n unmodified.\n\n **Parameter:** dst The destination buffer already containing the first\n            null-terminated string. Must not be NULL and must not overlap\n            with `src`.\n **Parameter:** src The second null-terminated string. Must not be NULL, and must\n            not overlap with `dst`.\n **Parameter:** maxlen The length (in characters) of the destination buffer.\n **Returns:** the length (in characters, excluding the null terminator) of the\n          string in `dst` plus the length of `src`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strlcpy\n"]
    pub fn SDL_strlcat(
        dst: *mut core::ffi::c_char,
        src: *const core::ffi::c_char,
        maxlen: usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Allocate a copy of a string.\n\n This allocates enough space for a null-terminated copy of `str`, using\n SDL_malloc, and then makes a copy of the string into this space.\n\n The returned string is owned by the caller, and should be passed to\n SDL_free when no longer needed.\n\n **Parameter:** str the string to copy.\n **Returns:** a pointer to the newly-allocated string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strdup(str_: *const core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Allocate a copy of a string, up to n characters.\n\n This allocates enough space for a null-terminated copy of `str`, up to\n `maxlen` bytes, using SDL_malloc, and then makes a copy of the string into\n this space.\n\n If the string is longer than `maxlen` bytes, the returned string will be\n `maxlen` bytes long, plus a null-terminator character that isn't included\n in the count.\n\n The returned string is owned by the caller, and should be passed to\n SDL_free when no longer needed.\n\n **Parameter:** str the string to copy.\n **Parameter:** maxlen the maximum length of the copied string, not counting the\n               null-terminator character.\n **Returns:** a pointer to the newly-allocated string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strndup(str_: *const core::ffi::c_char, maxlen: usize) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Reverse a string's contents.\n\n This reverses a null-terminated string in-place. Only the content of the\n string is reversed; the null-terminator character remains at the end of the\n reversed string.\n\n **WARNING**: This function reverses the _bytes_ of the string, not the\n codepoints. If `str` is a UTF-8 string with Unicode codepoints > 127, this\n will ruin the string data. You should only use this function on strings\n that are completely comprised of low ASCII characters.\n\n **Parameter:** str the string to reverse.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strrev(str_: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert a string to uppercase.\n\n **WARNING**: Regardless of system locale, this will only convert ASCII\n values 'a' through 'z' to uppercase.\n\n This function operates on a null-terminated string of bytes--even if it is\n malformed UTF-8!--and converts ASCII characters 'a' through 'z' to their\n uppercase equivalents in-place, returning the original `str` pointer.\n\n **Parameter:** str the string to convert in-place. Can not be NULL.\n **Returns:** the `str` pointer passed into this function.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strlwr\n"]
    pub fn SDL_strupr(str_: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert a string to lowercase.\n\n **WARNING**: Regardless of system locale, this will only convert ASCII\n values 'A' through 'Z' to lowercase.\n\n This function operates on a null-terminated string of bytes--even if it is\n malformed UTF-8!--and converts ASCII characters 'A' through 'Z' to their\n lowercase equivalents in-place, returning the original `str` pointer.\n\n **Parameter:** str the string to convert in-place. Can not be NULL.\n **Returns:** the `str` pointer passed into this function.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_strupr\n"]
    pub fn SDL_strlwr(str_: *mut core::ffi::c_char) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Search a string for the first instance of a specific byte.\n\n The search ends once it finds the requested byte value, or a null\n terminator byte to end the string.\n\n Note that this looks for _bytes_, not _characters_, so you cannot match\n against a Unicode codepoint > 255, regardless of character encoding.\n\n **Parameter:** str the string to search. Must not be NULL.\n **Parameter:** c the byte value to search for.\n **Returns:** a pointer to the first instance of `c` in the string, or NULL if\n          not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strchr(
        str_: *const core::ffi::c_char,
        c: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Search a string for the last instance of a specific byte.\n\n The search must go until it finds a null terminator byte to end the string.\n\n Note that this looks for _bytes_, not _characters_, so you cannot match\n against a Unicode codepoint > 255, regardless of character encoding.\n\n **Parameter:** str the string to search. Must not be NULL.\n **Parameter:** c the byte value to search for.\n **Returns:** a pointer to the last instance of `c` in the string, or NULL if\n          not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strrchr(
        str_: *const core::ffi::c_char,
        c: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Search a string for the first instance of a specific substring.\n\n The search ends once it finds the requested substring, or a null terminator\n byte to end the string.\n\n Note that this looks for strings of _bytes_, not _characters_, so it's\n legal to search for malformed and incomplete UTF-8 sequences.\n\n **Parameter:** haystack the string to search. Must not be NULL.\n **Parameter:** needle the string to search for. Must not be NULL.\n **Returns:** a pointer to the first instance of `needle` in the string, or NULL\n          if not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strstr(
        haystack: *const core::ffi::c_char,
        needle: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Search a string, up to n bytes, for the first instance of a specific\n substring.\n\n The search ends once it finds the requested substring, or a null terminator\n byte to end the string, or `maxlen` bytes have been examined. It is\n possible to use this function on a string without a null terminator.\n\n Note that this looks for strings of _bytes_, not _characters_, so it's\n legal to search for malformed and incomplete UTF-8 sequences.\n\n **Parameter:** haystack the string to search. Must not be NULL.\n **Parameter:** needle the string to search for. Must not be NULL.\n **Parameter:** maxlen the maximum number of bytes to search in `haystack`.\n **Returns:** a pointer to the first instance of `needle` in the string, or NULL\n          if not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strnstr(
        haystack: *const core::ffi::c_char,
        needle: *const core::ffi::c_char,
        maxlen: usize,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Search a UTF-8 string for the first instance of a specific substring,\n case-insensitively.\n\n This will work with Unicode strings, using a technique called\n \"case-folding\" to handle the vast majority of case-sensitive human\n languages regardless of system locale. It can deal with expanding values: a\n German Eszett character can compare against two ASCII 's' chars and be\n considered a match, for example. A notable exception: it does not handle\n the Turkish 'i' character; human language is complicated!\n\n Since this handles Unicode, it expects the strings to be well-formed UTF-8\n and not a null-terminated string of arbitrary bytes. Bytes that are not\n valid UTF-8 are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), which is to say two strings of random bits may turn out to\n match if they convert to the same amount of replacement characters.\n\n **Parameter:** haystack the string to search. Must not be NULL.\n **Parameter:** needle the string to search for. Must not be NULL.\n **Returns:** a pointer to the first instance of `needle` in the string, or NULL\n          if not found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strcasestr(
        haystack: *const core::ffi::c_char,
        needle: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " This works exactly like strtok_r() but doesn't require access to a C\n runtime.\n\n Break a string up into a series of tokens.\n\n To start tokenizing a new string, `str` should be the non-NULL address of\n the string to start tokenizing. Future calls to get the next token from the\n same string should specify a NULL.\n\n Note that this function will overwrite pieces of `str` with null chars to\n split it into tokens. This function cannot be used with const/read-only\n strings!\n\n `saveptr` just needs to point to a `char *` that can be overwritten; SDL\n will use this to save tokenizing state between calls. It is initialized if\n `str` is non-NULL, and used to resume tokenizing when `str` is NULL.\n\n **Parameter:** str the string to tokenize, or NULL to continue tokenizing.\n **Parameter:** delim the delimiter string that separates tokens.\n **Parameter:** saveptr pointer to a char *, used for ongoing state.\n **Returns:** A pointer to the next token, or NULL if no tokens remain.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strtok_r(
        str_: *mut core::ffi::c_char,
        delim: *const core::ffi::c_char,
        saveptr: *mut *mut core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Count the number of codepoints in a UTF-8 string.\n\n Counts the _codepoints_, not _bytes_, in `str`, excluding the null\n terminator.\n\n If you need to count the bytes in a string instead, consider using\n SDL_strlen().\n\n Since this handles Unicode, it expects the strings to be well-formed UTF-8\n and not a null-terminated string of arbitrary bytes. Bytes that are not\n valid UTF-8 are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), so a malformed or incomplete UTF-8 sequence might increase the\n count by several replacement characters.\n\n **Parameter:** str The null-terminated UTF-8 string to read. Must not be NULL.\n **Returns:** The length (in codepoints, excluding the null terminator) of\n          `src`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_utf8strnlen\n **See Also:** SDL_strlen\n"]
    pub fn SDL_utf8strlen(str_: *const core::ffi::c_char) -> usize;
}
unsafe extern "C" {
    #[doc = " Count the number of codepoints in a UTF-8 string, up to n bytes.\n\n Counts the _codepoints_, not _bytes_, in `str`, excluding the null\n terminator.\n\n If you need to count the bytes in a string instead, consider using\n SDL_strnlen().\n\n The counting stops at `bytes` bytes (not codepoints!). This seems\n counterintuitive, but makes it easy to express the total size of the\n string's buffer.\n\n Since this handles Unicode, it expects the strings to be well-formed UTF-8\n and not a null-terminated string of arbitrary bytes. Bytes that are not\n valid UTF-8 are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), so a malformed or incomplete UTF-8 sequence might increase the\n count by several replacement characters.\n\n **Parameter:** str The null-terminated UTF-8 string to read. Must not be NULL.\n **Parameter:** bytes The maximum amount of bytes to count.\n **Returns:** The length (in codepoints, excluding the null terminator) of `src`\n          but never more than `maxlen`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_utf8strlen\n **See Also:** SDL_strnlen\n"]
    pub fn SDL_utf8strnlen(str_: *const core::ffi::c_char, bytes: usize) -> usize;
}
unsafe extern "C" {
    #[doc = " Convert an integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget possible negative\n signs, null terminator bytes, etc).\n\n **Parameter:** value the integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_uitoa\n **See Also:** SDL_ltoa\n **See Also:** SDL_lltoa\n"]
    pub fn SDL_itoa(
        value: core::ffi::c_int,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert an unsigned integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget null terminator\n bytes, etc).\n\n **Parameter:** value the unsigned integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_itoa\n **See Also:** SDL_ultoa\n **See Also:** SDL_ulltoa\n"]
    pub fn SDL_uitoa(
        value: core::ffi::c_uint,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert a long integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget possible negative\n signs, null terminator bytes, etc).\n\n **Parameter:** value the long integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ultoa\n **See Also:** SDL_itoa\n **See Also:** SDL_lltoa\n"]
    pub fn SDL_ltoa(
        value: core::ffi::c_long,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert an unsigned long integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget null terminator\n bytes, etc).\n\n **Parameter:** value the unsigned long integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ltoa\n **See Also:** SDL_uitoa\n **See Also:** SDL_ulltoa\n"]
    pub fn SDL_ultoa(
        value: core::ffi::c_ulong,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert a long long integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget possible negative\n signs, null terminator bytes, etc).\n\n **Parameter:** value the long long integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ulltoa\n **See Also:** SDL_itoa\n **See Also:** SDL_ltoa\n"]
    pub fn SDL_lltoa(
        value: core::ffi::c_longlong,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Convert an unsigned long long integer into a string.\n\n This requires a radix to specified for string format. Specifying 10\n produces a decimal number, 16 hexadecimal, etc. Must be in the range of 2\n to 36.\n\n Note that this function will overflow a buffer if `str` is not large enough\n to hold the output! It may be safer to use SDL_snprintf to clamp output, or\n SDL_asprintf to allocate a buffer. Otherwise, it doesn't hurt to allocate\n much more space than you expect to use (and don't forget null terminator\n bytes, etc).\n\n **Parameter:** value the unsigned long long integer to convert.\n **Parameter:** str the buffer to write the string into.\n **Parameter:** radix the radix to use for string generation.\n **Returns:** `str`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_lltoa\n **See Also:** SDL_uitoa\n **See Also:** SDL_ultoa\n"]
    pub fn SDL_ulltoa(
        value: core::ffi::c_ulonglong,
        str_: *mut core::ffi::c_char,
        radix: core::ffi::c_int,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Parse an `int` from a string.\n\n The result of calling `SDL_atoi(str)` is equivalent to\n `(int)SDL_strtol(str, NULL, 10)`.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Returns:** the parsed `int`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atof\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoull\n **See Also:** SDL_strtod\n **See Also:** SDL_itoa\n"]
    pub fn SDL_atoi(str_: *const core::ffi::c_char) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Parse a `double` from a string.\n\n The result of calling `SDL_atof(str)` is equivalent to `SDL_strtod(str,\n NULL)`.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Returns:** the parsed `double`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoull\n **See Also:** SDL_strtod\n"]
    pub fn SDL_atof(str_: *const core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    #[doc = " Parse a `long` from a string.\n\n If `str` starts with whitespace, then those whitespace characters are\n skipped before attempting to parse the number.\n\n If the parsed number does not fit inside a `long`, the result is clamped to\n the minimum and maximum representable `long` values.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Parameter:** endp If not NULL, the address of the first invalid character (i.e.\n             the next character after the parsed number) will be written to\n             this pointer.\n **Parameter:** base The base of the integer to read. Supported values are 0 and 2\n             to 36 inclusive. If 0, the base will be inferred from the\n             number's prefix (0x for hexadecimal, 0 for octal, decimal\n             otherwise).\n **Returns:** the parsed `long`, or 0 if no number could be parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_atof\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoull\n **See Also:** SDL_strtod\n **See Also:** SDL_ltoa\n **See Also:** SDL_wcstol\n"]
    pub fn SDL_strtol(
        str_: *const core::ffi::c_char,
        endp: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> core::ffi::c_long;
}
unsafe extern "C" {
    #[doc = " Parse an `unsigned long` from a string.\n\n If `str` starts with whitespace, then those whitespace characters are\n skipped before attempting to parse the number.\n\n If the parsed number does not fit inside an `unsigned long`, the result is\n clamped to the maximum representable `unsigned long` value.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Parameter:** endp If not NULL, the address of the first invalid character (i.e.\n             the next character after the parsed number) will be written to\n             this pointer.\n **Parameter:** base The base of the integer to read. Supported values are 0 and 2\n             to 36 inclusive. If 0, the base will be inferred from the\n             number's prefix (0x for hexadecimal, 0 for octal, decimal\n             otherwise).\n **Returns:** the parsed `unsigned long`, or 0 if no number could be parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_atof\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoull\n **See Also:** SDL_strtod\n **See Also:** SDL_ultoa\n"]
    pub fn SDL_strtoul(
        str_: *const core::ffi::c_char,
        endp: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> core::ffi::c_ulong;
}
unsafe extern "C" {
    #[doc = " Parse a `long long` from a string.\n\n If `str` starts with whitespace, then those whitespace characters are\n skipped before attempting to parse the number.\n\n If the parsed number does not fit inside a `long long`, the result is\n clamped to the minimum and maximum representable `long long` values.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Parameter:** endp If not NULL, the address of the first invalid character (i.e.\n             the next character after the parsed number) will be written to\n             this pointer.\n **Parameter:** base The base of the integer to read. Supported values are 0 and 2\n             to 36 inclusive. If 0, the base will be inferred from the\n             number's prefix (0x for hexadecimal, 0 for octal, decimal\n             otherwise).\n **Returns:** the parsed `long long`, or 0 if no number could be parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_atof\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtoull\n **See Also:** SDL_strtod\n **See Also:** SDL_lltoa\n"]
    pub fn SDL_strtoll(
        str_: *const core::ffi::c_char,
        endp: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> core::ffi::c_longlong;
}
unsafe extern "C" {
    #[doc = " Parse an `unsigned long long` from a string.\n\n If `str` starts with whitespace, then those whitespace characters are\n skipped before attempting to parse the number.\n\n If the parsed number does not fit inside an `unsigned long long`, the\n result is clamped to the maximum representable `unsigned long long` value.\n\n **Parameter:** str The null-terminated string to read. Must not be NULL.\n **Parameter:** endp If not NULL, the address of the first invalid character (i.e.\n             the next character after the parsed number) will be written to\n             this pointer.\n **Parameter:** base The base of the integer to read. Supported values are 0 and 2\n             to 36 inclusive. If 0, the base will be inferred from the\n             number's prefix (0x for hexadecimal, 0 for octal, decimal\n             otherwise).\n **Returns:** the parsed `unsigned long long`, or 0 if no number could be\n          parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_atof\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtod\n **See Also:** SDL_ulltoa\n"]
    pub fn SDL_strtoull(
        str_: *const core::ffi::c_char,
        endp: *mut *mut core::ffi::c_char,
        base: core::ffi::c_int,
    ) -> core::ffi::c_ulonglong;
}
unsafe extern "C" {
    #[doc = " Parse a `double` from a string.\n\n This function makes fewer guarantees than the C runtime `strtod`:\n\n - Only decimal notation is guaranteed to be supported. The handling of\n   scientific and hexadecimal notation is unspecified.\n - Whether or not INF and NAN can be parsed is unspecified.\n - The precision of the result is unspecified.\n\n **Parameter:** str the null-terminated string to read. Must not be NULL.\n **Parameter:** endp if not NULL, the address of the first invalid character (i.e.\n             the next character after the parsed number) will be written to\n             this pointer.\n **Returns:** the parsed `double`, or 0 if no number could be parsed.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atoi\n **See Also:** SDL_atof\n **See Also:** SDL_strtol\n **See Also:** SDL_strtoll\n **See Also:** SDL_strtoul\n **See Also:** SDL_strtoull\n"]
    pub fn SDL_strtod(str_: *const core::ffi::c_char, endp: *mut *mut core::ffi::c_char) -> f64;
}
unsafe extern "C" {
    #[doc = " Compare two null-terminated UTF-8 strings.\n\n Due to the nature of UTF-8 encoding, this will work with Unicode strings,\n since effectively this function just compares bytes until it hits a\n null-terminating character. Also due to the nature of UTF-8, this can be\n used with SDL_qsort() to put strings in (roughly) alphabetical order.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strcmp(
        str1: *const core::ffi::c_char,
        str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two UTF-8 strings up to a number of bytes.\n\n Due to the nature of UTF-8 encoding, this will work with Unicode strings,\n since effectively this function just compares bytes until it hits a\n null-terminating character. Also due to the nature of UTF-8, this can be\n used with SDL_qsort() to put strings in (roughly) alphabetical order.\n\n Note that while this function is intended to be used with UTF-8, it is\n doing a bytewise comparison, and `maxlen` specifies a _byte_ limit! If the\n limit lands in the middle of a multi-byte UTF-8 sequence, it will only\n compare a portion of the final character.\n\n `maxlen` specifies a maximum number of bytes to compare; if the strings\n match to this number of bytes (or both have matched to a null-terminator\n character before this number of bytes), they will be considered equal.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Parameter:** maxlen the maximum number of _bytes_ to compare.\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strncmp(
        str1: *const core::ffi::c_char,
        str2: *const core::ffi::c_char,
        maxlen: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two null-terminated UTF-8 strings, case-insensitively.\n\n This will work with Unicode strings, using a technique called\n \"case-folding\" to handle the vast majority of case-sensitive human\n languages regardless of system locale. It can deal with expanding values: a\n German Eszett character can compare against two ASCII 's' chars and be\n considered a match, for example. A notable exception: it does not handle\n the Turkish 'i' character; human language is complicated!\n\n Since this handles Unicode, it expects the string to be well-formed UTF-8\n and not a null-terminated string of arbitrary bytes. Bytes that are not\n valid UTF-8 are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), which is to say two strings of random bits may turn out to\n match if they convert to the same amount of replacement characters.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strcasecmp(
        str1: *const core::ffi::c_char,
        str2: *const core::ffi::c_char,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compare two UTF-8 strings, case-insensitively, up to a number of bytes.\n\n This will work with Unicode strings, using a technique called\n \"case-folding\" to handle the vast majority of case-sensitive human\n languages regardless of system locale. It can deal with expanding values: a\n German Eszett character can compare against two ASCII 's' chars and be\n considered a match, for example. A notable exception: it does not handle\n the Turkish 'i' character; human language is complicated!\n\n Since this handles Unicode, it expects the string to be well-formed UTF-8\n and not a null-terminated string of arbitrary bytes. Bytes that are not\n valid UTF-8 are treated as Unicode character U+FFFD (REPLACEMENT\n CHARACTER), which is to say two strings of random bits may turn out to\n match if they convert to the same amount of replacement characters.\n\n Note that while this function is intended to be used with UTF-8, `maxlen`\n specifies a _byte_ limit! If the limit lands in the middle of a multi-byte\n UTF-8 sequence, it may convert a portion of the final character to one or\n more Unicode character U+FFFD (REPLACEMENT CHARACTER) so as not to overflow\n a buffer.\n\n `maxlen` specifies a maximum number of bytes to compare; if the strings\n match to this number of bytes (or both have matched to a null-terminator\n character before this number of bytes), they will be considered equal.\n\n **Parameter:** str1 the first string to compare. NULL is not permitted!\n **Parameter:** str2 the second string to compare. NULL is not permitted!\n **Parameter:** maxlen the maximum number of bytes to compare.\n **Returns:** less than zero if str1 is \"less than\" str2, greater than zero if\n          str1 is \"greater than\" str2, and zero if the strings match\n          exactly.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strncasecmp(
        str1: *const core::ffi::c_char,
        str2: *const core::ffi::c_char,
        maxlen: usize,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Searches a string for the first occurrence of any character contained in a\n breakset, and returns a pointer from the string to that character.\n\n **Parameter:** str The null-terminated string to be searched. Must not be NULL, and\n            must not overlap with `breakset`.\n **Parameter:** breakset A null-terminated string containing the list of characters\n                 to look for. Must not be NULL, and must not overlap with\n                 `str`.\n **Returns:** A pointer to the location, in str, of the first occurrence of a\n          character present in the breakset, or NULL if none is found.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_strpbrk(
        str_: *const core::ffi::c_char,
        breakset: *const core::ffi::c_char,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Decode a UTF-8 string, one Unicode codepoint at a time.\n\n This will return the first Unicode codepoint in the UTF-8 encoded string in\n `*pstr`, and then advance `*pstr` past any consumed bytes before returning.\n\n It will not access more than `*pslen` bytes from the string. `*pslen` will\n be adjusted, as well, subtracting the number of bytes consumed.\n\n `pslen` is allowed to be NULL, in which case the string _must_ be\n NULL-terminated, as the function will blindly read until it sees the NULL\n char.\n\n if `*pslen` is zero, it assumes the end of string is reached and returns a\n zero codepoint regardless of the contents of the string buffer.\n\n If the resulting codepoint is zero (a NULL terminator), or `*pslen` is\n zero, it will not advance `*pstr` or `*pslen` at all.\n\n Generally this function is called in a loop until it returns zero,\n adjusting its parameters each iteration.\n\n If an invalid UTF-8 sequence is encountered, this function returns\n SDL_INVALID_UNICODE_CODEPOINT and advances the string/length by one byte\n (which is to say, a multibyte sequence might produce several\n SDL_INVALID_UNICODE_CODEPOINT returns before it syncs to the next valid\n UTF-8 sequence).\n\n Several things can generate invalid UTF-8 sequences, including overlong\n encodings, the use of UTF-16 surrogate values, and truncated data. Please\n refer to\n [RFC3629](https://www.ietf.org/rfc/rfc3629.txt)\n for details.\n\n **Parameter:** pstr a pointer to a UTF-8 string pointer to be read and adjusted.\n **Parameter:** pslen a pointer to the number of bytes in the string, to be read and\n              adjusted. NULL is allowed.\n **Returns:** the first Unicode codepoint in the string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_StepUTF8(pstr: *mut *const core::ffi::c_char, pslen: *mut usize) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Decode a UTF-8 string in reverse, one Unicode codepoint at a time.\n\n This will go to the start of the previous Unicode codepoint in the string,\n move `*pstr` to that location and return that codepoint.\n\n If `*pstr` is already at the start of the string), it will not advance\n `*pstr` at all.\n\n Generally this function is called in a loop until it returns zero,\n adjusting its parameter each iteration.\n\n If an invalid UTF-8 sequence is encountered, this function returns\n SDL_INVALID_UNICODE_CODEPOINT.\n\n Several things can generate invalid UTF-8 sequences, including overlong\n encodings, the use of UTF-16 surrogate values, and truncated data. Please\n refer to\n [RFC3629](https://www.ietf.org/rfc/rfc3629.txt)\n for details.\n\n **Parameter:** start a pointer to the beginning of the UTF-8 string.\n **Parameter:** pstr a pointer to a UTF-8 string pointer to be read and adjusted.\n **Returns:** the previous Unicode codepoint in the string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_StepBackUTF8(
        start: *const core::ffi::c_char,
        pstr: *mut *const core::ffi::c_char,
    ) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Convert a single Unicode codepoint to UTF-8.\n\n The buffer pointed to by `dst` must be at least 4 bytes long, as this\n function may generate between 1 and 4 bytes of output.\n\n This function returns the first byte _after_ the newly-written UTF-8\n sequence, which is useful for encoding multiple codepoints in a loop, or\n knowing where to write a NULL-terminator character to end the string (in\n either case, plan to have a buffer of _more_ than 4 bytes!).\n\n If `codepoint` is an invalid value (outside the Unicode range, or a UTF-16\n surrogate value, etc), this will use U+FFFD (REPLACEMENT CHARACTER) for the\n codepoint instead, and not set an error.\n\n If `dst` is NULL, this returns NULL immediately without writing to the\n pointer and without setting an error.\n\n **Parameter:** codepoint a Unicode codepoint to convert to UTF-8.\n **Parameter:** dst the location to write the encoded UTF-8. Must point to at least\n            4 bytes!\n **Returns:** the first byte past the newly-written UTF-8 sequence.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_UCS4ToUTF8(codepoint: Uint32, dst: *mut core::ffi::c_char)
    -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " This works exactly like sscanf() but doesn't require access to a C runtime.\n\n Scan a string, matching a format string, converting each '%' item and\n storing it to pointers provided through variable arguments.\n\n **Parameter:** text the string to scan. Must not be NULL.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ... a list of pointers to values to be filled in with scanned items.\n **Returns:** the number of items that matched the format string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_sscanf(
        text: *const core::ffi::c_char,
        fmt: *const core::ffi::c_char,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like vsscanf() but doesn't require access to a C\n runtime.\n\n Functions identically to SDL_sscanf(), except it takes a `va_list` instead\n of using `...` variable arguments.\n\n **Parameter:** text the string to scan. Must not be NULL.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ap a `va_list` of pointers to values to be filled in with scanned\n           items.\n **Returns:** the number of items that matched the format string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_vsscanf(
        text: *const core::ffi::c_char,
        fmt: *const core::ffi::c_char,
        ap: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like snprintf() but doesn't require access to a C\n runtime.\n\n Format a string of up to `maxlen`-1 bytes, converting each '%' item with\n values provided through variable arguments.\n\n While some C runtimes differ on how to deal with too-large strings, this\n function null-terminates the output, by treating the null-terminator as\n part of the `maxlen` count. Note that if `maxlen` is zero, however, no\n bytes will be written at all.\n\n This function returns the number of _bytes_ (not _characters_) that should\n be written, excluding the null-terminator character. If this returns a\n number >= `maxlen`, it means the output string was truncated. A negative\n return value means an error occurred.\n\n Referencing the output string's pointer with a format item is undefined\n behavior.\n\n **Parameter:** text the buffer to write the string into. Must not be NULL.\n **Parameter:** maxlen the maximum bytes to write, including the null-terminator.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ... a list of values to be used with the format string.\n **Returns:** the number of bytes that should be written, not counting the\n          null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_snprintf(
        text: *mut core::ffi::c_char,
        maxlen: usize,
        fmt: *const core::ffi::c_char,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like swprintf() but doesn't require access to a C\n runtime.\n\n Format a wide string of up to `maxlen`-1 wchar_t values, converting each\n '%' item with values provided through variable arguments.\n\n While some C runtimes differ on how to deal with too-large strings, this\n function null-terminates the output, by treating the null-terminator as\n part of the `maxlen` count. Note that if `maxlen` is zero, however, no wide\n characters will be written at all.\n\n This function returns the number of _wide characters_ (not _codepoints_)\n that should be written, excluding the null-terminator character. If this\n returns a number >= `maxlen`, it means the output string was truncated. A\n negative return value means an error occurred.\n\n Referencing the output string's pointer with a format item is undefined\n behavior.\n\n **Parameter:** text the buffer to write the wide string into. Must not be NULL.\n **Parameter:** maxlen the maximum wchar_t values to write, including the\n               null-terminator.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ... a list of values to be used with the format string.\n **Returns:** the number of wide characters that should be written, not counting\n          the null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_swprintf(
        text: *mut wchar_t,
        maxlen: usize,
        fmt: *const wchar_t,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like vsnprintf() but doesn't require access to a C\n runtime.\n\n Functions identically to SDL_snprintf(), except it takes a `va_list`\n instead of using `...` variable arguments.\n\n **Parameter:** text the buffer to write the string into. Must not be NULL.\n **Parameter:** maxlen the maximum bytes to write, including the null-terminator.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ap a `va_list` values to be used with the format string.\n **Returns:** the number of bytes that should be written, not counting the\n          null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_vsnprintf(
        text: *mut core::ffi::c_char,
        maxlen: usize,
        fmt: *const core::ffi::c_char,
        ap: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like vswprintf() but doesn't require access to a C\n runtime.\n\n Functions identically to SDL_swprintf(), except it takes a `va_list`\n instead of using `...` variable arguments.\n\n **Parameter:** text the buffer to write the string into. Must not be NULL.\n **Parameter:** maxlen the maximum wide characters to write, including the\n               null-terminator.\n **Parameter:** fmt a printf-style format wide string. Must not be NULL.\n **Parameter:** ap a `va_list` values to be used with the format string.\n **Returns:** the number of wide characters that should be written, not counting\n          the null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_vswprintf(
        text: *mut wchar_t,
        maxlen: usize,
        fmt: *const wchar_t,
        ap: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like asprintf() but doesn't require access to a C\n runtime.\n\n Functions identically to SDL_snprintf(), except it allocates a buffer large\n enough to hold the output string on behalf of the caller.\n\n On success, this function returns the number of bytes (not characters)\n comprising the output string, not counting the null-terminator character,\n and sets `*strp` to the newly-allocated string.\n\n On error, this function returns a negative number, and the value of `*strp`\n is undefined.\n\n The returned string is owned by the caller, and should be passed to\n SDL_free when no longer needed.\n\n **Parameter:** strp on output, is set to the new string. Must not be NULL.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ... a list of values to be used with the format string.\n **Returns:** the number of bytes in the newly-allocated string, not counting\n          the null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_asprintf(
        strp: *mut *mut core::ffi::c_char,
        fmt: *const core::ffi::c_char,
        ...
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This works exactly like vasprintf() but doesn't require access to a C\n runtime.\n\n Functions identically to SDL_asprintf(), except it takes a `va_list`\n instead of using `...` variable arguments.\n\n **Parameter:** strp on output, is set to the new string. Must not be NULL.\n **Parameter:** fmt a printf-style format string. Must not be NULL.\n **Parameter:** ap a `va_list` values to be used with the format string.\n **Returns:** the number of bytes in the newly-allocated string, not counting\n          the null-terminator char, or a negative value on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_vasprintf(
        strp: *mut *mut core::ffi::c_char,
        fmt: *const core::ffi::c_char,
        ap: va_list,
    ) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Seeds the pseudo-random number generator.\n\n Reusing the seed number will cause SDL_rand() to repeat the same stream of\n 'random' numbers.\n\n **Parameter:** seed the value to use as a random number seed, or 0 to use\n             SDL_GetPerformanceCounter().\n\n **Thread Safety:** This should be called on the same thread that calls\n               SDL_rand()\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_rand\n **See Also:** SDL_rand_bits\n **See Also:** SDL_randf\n"]
    pub fn SDL_srand(seed: Uint64);
}
unsafe extern "C" {
    #[doc = " Generate a pseudo-random number less than n for positive n\n\n The method used is faster and of better quality than `rand() % n`. Odds are\n roughly 99.9% even for n = 1 million. Evenness is better for smaller n, and\n much worse as n gets bigger.\n\n Example: to simulate a d6 use `SDL_rand(6) + 1` The +1 converts 0..5 to\n 1..6\n\n If you want to generate a pseudo-random number in the full range of Sint32,\n you should use: (Sint32)SDL_rand_bits()\n\n If you want reproducible output, be sure to initialize with SDL_srand()\n first.\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Parameter:** n the number of possible outcomes. n must be positive.\n **Returns:** a random value in the range of [0 .. n-1].\n\n **Thread Safety:** All calls should be made from a single thread\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_srand\n **See Also:** SDL_randf\n"]
    pub fn SDL_rand(n: Sint32) -> Sint32;
}
unsafe extern "C" {
    #[doc = " Generate a uniform pseudo-random floating point number less than 1.0\n\n If you want reproducible output, be sure to initialize with SDL_srand()\n first.\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Returns:** a random value in the range of [0.0, 1.0).\n\n **Thread Safety:** All calls should be made from a single thread\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_srand\n **See Also:** SDL_rand\n"]
    pub fn SDL_randf() -> f32;
}
unsafe extern "C" {
    #[doc = " Generate 32 pseudo-random bits.\n\n You likely want to use SDL_rand() to get a pseudo-random number instead.\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Returns:** a random value in the range of [0-SDL_MAX_UINT32].\n\n **Thread Safety:** All calls should be made from a single thread\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_rand\n **See Also:** SDL_randf\n **See Also:** SDL_srand\n"]
    pub fn SDL_rand_bits() -> Uint32;
}
unsafe extern "C" {
    #[doc = " Generate a pseudo-random number less than n for positive n\n\n The method used is faster and of better quality than `rand() % n`. Odds are\n roughly 99.9% even for n = 1 million. Evenness is better for smaller n, and\n much worse as n gets bigger.\n\n Example: to simulate a d6 use `SDL_rand_r(state, 6) + 1` The +1 converts\n 0..5 to 1..6\n\n If you want to generate a pseudo-random number in the full range of Sint32,\n you should use: (Sint32)SDL_rand_bits_r(state)\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Parameter:** state a pointer to the current random number state, this may not be\n              NULL.\n **Parameter:** n the number of possible outcomes. n must be positive.\n **Returns:** a random value in the range of [0 .. n-1].\n\n **Thread Safety:** This function is thread-safe, as long as the state pointer\n               isn't shared between threads.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_rand\n **See Also:** SDL_rand_bits_r\n **See Also:** SDL_randf_r\n"]
    pub fn SDL_rand_r(state: *mut Uint64, n: Sint32) -> Sint32;
}
unsafe extern "C" {
    #[doc = " Generate a uniform pseudo-random floating point number less than 1.0\n\n If you want reproducible output, be sure to initialize with SDL_srand()\n first.\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Parameter:** state a pointer to the current random number state, this may not be\n              NULL.\n **Returns:** a random value in the range of [0.0, 1.0).\n\n **Thread Safety:** This function is thread-safe, as long as the state pointer\n               isn't shared between threads.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_rand_bits_r\n **See Also:** SDL_rand_r\n **See Also:** SDL_randf\n"]
    pub fn SDL_randf_r(state: *mut Uint64) -> f32;
}
unsafe extern "C" {
    #[doc = " Generate 32 pseudo-random bits.\n\n You likely want to use SDL_rand_r() to get a pseudo-random number instead.\n\n There are no guarantees as to the quality of the random sequence produced,\n and this should not be used for security (cryptography, passwords) or where\n money is on the line (loot-boxes, casinos). There are many random number\n libraries available with different characteristics and you should pick one\n of those to meet any serious needs.\n\n **Parameter:** state a pointer to the current random number state, this may not be\n              NULL.\n **Returns:** a random value in the range of [0-SDL_MAX_UINT32].\n\n **Thread Safety:** This function is thread-safe, as long as the state pointer\n               isn't shared between threads.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_rand_r\n **See Also:** SDL_randf_r\n"]
    pub fn SDL_rand_bits_r(state: *mut Uint64) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Compute the arc cosine of `x`.\n\n The definition of `y = acos(x)` is `x = cos(y)`.\n\n Domain: `-1 <= x <= 1`\n\n Range: `0 <= y <= Pi`\n\n This function operates on double-precision floating point values, use\n SDL_acosf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc cosine of `x`, in radians.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_acosf\n **See Also:** SDL_asin\n **See Also:** SDL_cos\n"]
    pub fn SDL_acos(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the arc cosine of `x`.\n\n The definition of `y = acos(x)` is `x = cos(y)`.\n\n Domain: `-1 <= x <= 1`\n\n Range: `0 <= y <= Pi`\n\n This function operates on single-precision floating point values, use\n SDL_acos for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc cosine of `x`, in radians.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_acos\n **See Also:** SDL_asinf\n **See Also:** SDL_cosf\n"]
    pub fn SDL_acosf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the arc sine of `x`.\n\n The definition of `y = asin(x)` is `x = sin(y)`.\n\n Domain: `-1 <= x <= 1`\n\n Range: `-Pi/2 <= y <= Pi/2`\n\n This function operates on double-precision floating point values, use\n SDL_asinf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc sine of `x`, in radians.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_asinf\n **See Also:** SDL_acos\n **See Also:** SDL_sin\n"]
    pub fn SDL_asin(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the arc sine of `x`.\n\n The definition of `y = asin(x)` is `x = sin(y)`.\n\n Domain: `-1 <= x <= 1`\n\n Range: `-Pi/2 <= y <= Pi/2`\n\n This function operates on single-precision floating point values, use\n SDL_asin for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc sine of `x`, in radians.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_asin\n **See Also:** SDL_acosf\n **See Also:** SDL_sinf\n"]
    pub fn SDL_asinf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the arc tangent of `x`.\n\n The definition of `y = atan(x)` is `x = tan(y)`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-Pi/2 <= y <= Pi/2`\n\n This function operates on double-precision floating point values, use\n SDL_atanf for single-precision floats.\n\n To calculate the arc tangent of y / x, use SDL_atan2.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc tangent of of `x` in radians, or 0 if `x = 0`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atanf\n **See Also:** SDL_atan2\n **See Also:** SDL_tan\n"]
    pub fn SDL_atan(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the arc tangent of `x`.\n\n The definition of `y = atan(x)` is `x = tan(y)`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-Pi/2 <= y <= Pi/2`\n\n This function operates on single-precision floating point values, use\n SDL_atan for dboule-precision floats.\n\n To calculate the arc tangent of y / x, use SDL_atan2f.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** arc tangent of of `x` in radians, or 0 if `x = 0`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atan\n **See Also:** SDL_atan2f\n **See Also:** SDL_tanf\n"]
    pub fn SDL_atanf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the arc tangent of `y / x`, using the signs of x and y to adjust\n the result's quadrant.\n\n The definition of `z = atan2(x, y)` is `y = x tan(z)`, where the quadrant\n of z is determined based on the signs of x and y.\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`\n\n Range: `-Pi <= z <= Pi`\n\n This function operates on double-precision floating point values, use\n SDL_atan2f for single-precision floats.\n\n To calculate the arc tangent of a single value, use SDL_atan.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** y floating point value of the numerator (y coordinate).\n **Parameter:** x floating point value of the denominator (x coordinate).\n **Returns:** arc tangent of `y / x` in radians, or, if `x = 0`, either `-Pi/2`,\n          `0`, or `Pi/2`, depending on the value of `y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atan2f\n **See Also:** SDL_atan\n **See Also:** SDL_tan\n"]
    pub fn SDL_atan2(y: f64, x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the arc tangent of `y / x`, using the signs of x and y to adjust\n the result's quadrant.\n\n The definition of `z = atan2(x, y)` is `y = x tan(z)`, where the quadrant\n of z is determined based on the signs of x and y.\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`\n\n Range: `-Pi <= y <= Pi`\n\n This function operates on single-precision floating point values, use\n SDL_atan2 for double-precision floats.\n\n To calculate the arc tangent of a single value, use SDL_atanf.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** y floating point value of the numerator (y coordinate).\n **Parameter:** x floating point value of the denominator (x coordinate).\n **Returns:** arc tangent of of `y / x` in radians, or, if `x = 0`, either\n          `-Pi/2`, `0`, or `Pi/2`, depending on the value of `y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_atan2\n **See Also:** SDL_atan\n **See Also:** SDL_tan\n"]
    pub fn SDL_atan2f(y: f32, x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the ceiling of `x`.\n\n The ceiling of `x` is the smallest integer `y` such that `y >= x`, i.e `x`\n rounded up to the nearest integer.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on double-precision floating point values, use\n SDL_ceilf for single-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** the ceiling of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ceilf\n **See Also:** SDL_floor\n **See Also:** SDL_trunc\n **See Also:** SDL_round\n **See Also:** SDL_lround\n"]
    pub fn SDL_ceil(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the ceiling of `x`.\n\n The ceiling of `x` is the smallest integer `y` such that `y >= x`, i.e `x`\n rounded up to the nearest integer.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on single-precision floating point values, use\n SDL_ceil for double-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** the ceiling of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ceil\n **See Also:** SDL_floorf\n **See Also:** SDL_truncf\n **See Also:** SDL_roundf\n **See Also:** SDL_lroundf\n"]
    pub fn SDL_ceilf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Copy the sign of one floating-point value to another.\n\n The definition of copysign is that ``copysign(x, y) = abs(x) * sign(y)``.\n\n Domain: `-INF <= x <= INF`, ``-INF <= y <= f``\n\n Range: `-INF <= z <= INF`\n\n This function operates on double-precision floating point values, use\n SDL_copysignf for single-precision floats.\n\n **Parameter:** x floating point value to use as the magnitude.\n **Parameter:** y floating point value to use as the sign.\n **Returns:** the floating point value with the sign of y and the magnitude of\n          x.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_copysignf\n **See Also:** SDL_fabs\n"]
    pub fn SDL_copysign(x: f64, y: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Copy the sign of one floating-point value to another.\n\n The definition of copysign is that ``copysign(x, y) = abs(x) * sign(y)``.\n\n Domain: `-INF <= x <= INF`, ``-INF <= y <= f``\n\n Range: `-INF <= z <= INF`\n\n This function operates on single-precision floating point values, use\n SDL_copysign for double-precision floats.\n\n **Parameter:** x floating point value to use as the magnitude.\n **Parameter:** y floating point value to use as the sign.\n **Returns:** the floating point value with the sign of y and the magnitude of\n          x.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_copysign\n **See Also:** SDL_fabsf\n"]
    pub fn SDL_copysignf(x: f32, y: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the cosine of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-1 <= y <= 1`\n\n This function operates on double-precision floating point values, use\n SDL_cosf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** cosine of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_cosf\n **See Also:** SDL_acos\n **See Also:** SDL_sin\n"]
    pub fn SDL_cos(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the cosine of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-1 <= y <= 1`\n\n This function operates on single-precision floating point values, use\n SDL_cos for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** cosine of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_cos\n **See Also:** SDL_acosf\n **See Also:** SDL_sinf\n"]
    pub fn SDL_cosf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the exponential of `x`.\n\n The definition of `y = exp(x)` is `y = e^x`, where `e` is the base of the\n natural logarithm. The inverse is the natural logarithm, SDL_log.\n\n Domain: `-INF <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n The output will overflow if `exp(x)` is too large to be represented.\n\n This function operates on double-precision floating point values, use\n SDL_expf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** value of `e^x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_expf\n **See Also:** SDL_log\n"]
    pub fn SDL_exp(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the exponential of `x`.\n\n The definition of `y = exp(x)` is `y = e^x`, where `e` is the base of the\n natural logarithm. The inverse is the natural logarithm, SDL_logf.\n\n Domain: `-INF <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n The output will overflow if `exp(x)` is too large to be represented.\n\n This function operates on single-precision floating point values, use\n SDL_exp for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value.\n **Returns:** value of `e^x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_exp\n **See Also:** SDL_logf\n"]
    pub fn SDL_expf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the absolute value of `x`\n\n Domain: `-INF <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n This function operates on double-precision floating point values, use\n SDL_fabsf for single-precision floats.\n\n **Parameter:** x floating point value to use as the magnitude.\n **Returns:** the absolute value of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_fabsf\n"]
    pub fn SDL_fabs(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the absolute value of `x`\n\n Domain: `-INF <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n This function operates on single-precision floating point values, use\n SDL_fabs for double-precision floats.\n\n **Parameter:** x floating point value to use as the magnitude.\n **Returns:** the absolute value of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_fabs\n"]
    pub fn SDL_fabsf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the floor of `x`.\n\n The floor of `x` is the largest integer `y` such that `y <= x`, i.e `x`\n rounded down to the nearest integer.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on double-precision floating point values, use\n SDL_floorf for single-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** the floor of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_floorf\n **See Also:** SDL_ceil\n **See Also:** SDL_trunc\n **See Also:** SDL_round\n **See Also:** SDL_lround\n"]
    pub fn SDL_floor(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the floor of `x`.\n\n The floor of `x` is the largest integer `y` such that `y <= x`, i.e `x`\n rounded down to the nearest integer.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on single-precision floating point values, use\n SDL_floor for double-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** the floor of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_floor\n **See Also:** SDL_ceilf\n **See Also:** SDL_truncf\n **See Also:** SDL_roundf\n **See Also:** SDL_lroundf\n"]
    pub fn SDL_floorf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Truncate `x` to an integer.\n\n Rounds `x` to the next closest integer to 0. This is equivalent to removing\n the fractional part of `x`, leaving only the integer part.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on double-precision floating point values, use\n SDL_truncf for single-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** `x` truncated to an integer.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_truncf\n **See Also:** SDL_fmod\n **See Also:** SDL_ceil\n **See Also:** SDL_floor\n **See Also:** SDL_round\n **See Also:** SDL_lround\n"]
    pub fn SDL_trunc(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Truncate `x` to an integer.\n\n Rounds `x` to the next closest integer to 0. This is equivalent to removing\n the fractional part of `x`, leaving only the integer part.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on single-precision floating point values, use\n SDL_trunc for double-precision floats.\n\n **Parameter:** x floating point value.\n **Returns:** `x` truncated to an integer.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_trunc\n **See Also:** SDL_fmodf\n **See Also:** SDL_ceilf\n **See Also:** SDL_floorf\n **See Also:** SDL_roundf\n **See Also:** SDL_lroundf\n"]
    pub fn SDL_truncf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Return the floating-point remainder of `x / y`\n\n Divides `x` by `y`, and returns the remainder.\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`, `y != 0`\n\n Range: `-y <= z <= y`\n\n This function operates on double-precision floating point values, use\n SDL_fmodf for single-precision floats.\n\n **Parameter:** x the numerator.\n **Parameter:** y the denominator. Must not be 0.\n **Returns:** the remainder of `x / y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_fmodf\n **See Also:** SDL_modf\n **See Also:** SDL_trunc\n **See Also:** SDL_ceil\n **See Also:** SDL_floor\n **See Also:** SDL_round\n **See Also:** SDL_lround\n"]
    pub fn SDL_fmod(x: f64, y: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Return the floating-point remainder of `x / y`\n\n Divides `x` by `y`, and returns the remainder.\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`, `y != 0`\n\n Range: `-y <= z <= y`\n\n This function operates on single-precision floating point values, use\n SDL_fmod for double-precision floats.\n\n **Parameter:** x the numerator.\n **Parameter:** y the denominator. Must not be 0.\n **Returns:** the remainder of `x / y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_fmod\n **See Also:** SDL_truncf\n **See Also:** SDL_modff\n **See Also:** SDL_ceilf\n **See Also:** SDL_floorf\n **See Also:** SDL_roundf\n **See Also:** SDL_lroundf\n"]
    pub fn SDL_fmodf(x: f32, y: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Return whether the value is infinity.\n\n **Parameter:** x double-precision floating point value.\n **Returns:** non-zero if the value is infinity, 0 otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isinff\n"]
    pub fn SDL_isinf(x: f64) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Return whether the value is infinity.\n\n **Parameter:** x floating point value.\n **Returns:** non-zero if the value is infinity, 0 otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isinf\n"]
    pub fn SDL_isinff(x: f32) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Return whether the value is NaN.\n\n **Parameter:** x double-precision floating point value.\n **Returns:** non-zero if the value is NaN, 0 otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isnanf\n"]
    pub fn SDL_isnan(x: f64) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Return whether the value is NaN.\n\n **Parameter:** x floating point value.\n **Returns:** non-zero if the value is NaN, 0 otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_isnan\n"]
    pub fn SDL_isnanf(x: f32) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Compute the natural logarithm of `x`.\n\n Domain: `0 < x <= INF`\n\n Range: `-INF <= y <= INF`\n\n It is an error for `x` to be less than or equal to 0.\n\n This function operates on double-precision floating point values, use\n SDL_logf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than 0.\n **Returns:** the natural logarithm of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_logf\n **See Also:** SDL_log10\n **See Also:** SDL_exp\n"]
    pub fn SDL_log(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the natural logarithm of `x`.\n\n Domain: `0 < x <= INF`\n\n Range: `-INF <= y <= INF`\n\n It is an error for `x` to be less than or equal to 0.\n\n This function operates on single-precision floating point values, use\n SDL_log for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than 0.\n **Returns:** the natural logarithm of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_log\n **See Also:** SDL_expf\n"]
    pub fn SDL_logf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the base-10 logarithm of `x`.\n\n Domain: `0 < x <= INF`\n\n Range: `-INF <= y <= INF`\n\n It is an error for `x` to be less than or equal to 0.\n\n This function operates on double-precision floating point values, use\n SDL_log10f for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than 0.\n **Returns:** the logarithm of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_log10f\n **See Also:** SDL_log\n **See Also:** SDL_pow\n"]
    pub fn SDL_log10(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the base-10 logarithm of `x`.\n\n Domain: `0 < x <= INF`\n\n Range: `-INF <= y <= INF`\n\n It is an error for `x` to be less than or equal to 0.\n\n This function operates on single-precision floating point values, use\n SDL_log10 for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than 0.\n **Returns:** the logarithm of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_log10\n **See Also:** SDL_logf\n **See Also:** SDL_powf\n"]
    pub fn SDL_log10f(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Split `x` into integer and fractional parts\n\n This function operates on double-precision floating point values, use\n SDL_modff for single-precision floats.\n\n **Parameter:** x floating point value.\n **Parameter:** y output pointer to store the integer part of `x`.\n **Returns:** the fractional part of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_modff\n **See Also:** SDL_trunc\n **See Also:** SDL_fmod\n"]
    pub fn SDL_modf(x: f64, y: *mut f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Split `x` into integer and fractional parts\n\n This function operates on single-precision floating point values, use\n SDL_modf for double-precision floats.\n\n **Parameter:** x floating point value.\n **Parameter:** y output pointer to store the integer part of `x`.\n **Returns:** the fractional part of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_modf\n **See Also:** SDL_truncf\n **See Also:** SDL_fmodf\n"]
    pub fn SDL_modff(x: f32, y: *mut f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Raise `x` to the power `y`\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`\n\n Range: `-INF <= z <= INF`\n\n If `y` is the base of the natural logarithm (e), consider using SDL_exp\n instead.\n\n This function operates on double-precision floating point values, use\n SDL_powf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x the base.\n **Parameter:** y the exponent.\n **Returns:** `x` raised to the power `y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_powf\n **See Also:** SDL_exp\n **See Also:** SDL_log\n"]
    pub fn SDL_pow(x: f64, y: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Raise `x` to the power `y`\n\n Domain: `-INF <= x <= INF`, `-INF <= y <= INF`\n\n Range: `-INF <= z <= INF`\n\n If `y` is the base of the natural logarithm (e), consider using SDL_exp\n instead.\n\n This function operates on single-precision floating point values, use\n SDL_pow for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x the base.\n **Parameter:** y the exponent.\n **Returns:** `x` raised to the power `y`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_pow\n **See Also:** SDL_expf\n **See Also:** SDL_logf\n"]
    pub fn SDL_powf(x: f32, y: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Round `x` to the nearest integer.\n\n Rounds `x` to the nearest integer. Values halfway between integers will be\n rounded away from zero.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on double-precision floating point values, use\n SDL_roundf for single-precision floats. To get the result as an integer\n type, use SDL_lround.\n\n **Parameter:** x floating point value.\n **Returns:** the nearest integer to `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_roundf\n **See Also:** SDL_lround\n **See Also:** SDL_floor\n **See Also:** SDL_ceil\n **See Also:** SDL_trunc\n"]
    pub fn SDL_round(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Round `x` to the nearest integer.\n\n Rounds `x` to the nearest integer. Values halfway between integers will be\n rounded away from zero.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`, y integer\n\n This function operates on single-precision floating point values, use\n SDL_round for double-precision floats. To get the result as an integer\n type, use SDL_lroundf.\n\n **Parameter:** x floating point value.\n **Returns:** the nearest integer to `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_round\n **See Also:** SDL_lroundf\n **See Also:** SDL_floorf\n **See Also:** SDL_ceilf\n **See Also:** SDL_truncf\n"]
    pub fn SDL_roundf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Round `x` to the nearest integer representable as a long\n\n Rounds `x` to the nearest integer. Values halfway between integers will be\n rounded away from zero.\n\n Domain: `-INF <= x <= INF`\n\n Range: `MIN_LONG <= y <= MAX_LONG`\n\n This function operates on double-precision floating point values, use\n SDL_lroundf for single-precision floats. To get the result as a\n floating-point type, use SDL_round.\n\n **Parameter:** x floating point value.\n **Returns:** the nearest integer to `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_lroundf\n **See Also:** SDL_round\n **See Also:** SDL_floor\n **See Also:** SDL_ceil\n **See Also:** SDL_trunc\n"]
    pub fn SDL_lround(x: f64) -> core::ffi::c_long;
}
unsafe extern "C" {
    #[doc = " Round `x` to the nearest integer representable as a long\n\n Rounds `x` to the nearest integer. Values halfway between integers will be\n rounded away from zero.\n\n Domain: `-INF <= x <= INF`\n\n Range: `MIN_LONG <= y <= MAX_LONG`\n\n This function operates on single-precision floating point values, use\n SDL_lround for double-precision floats. To get the result as a\n floating-point type, use SDL_roundf.\n\n **Parameter:** x floating point value.\n **Returns:** the nearest integer to `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_lround\n **See Also:** SDL_roundf\n **See Also:** SDL_floorf\n **See Also:** SDL_ceilf\n **See Also:** SDL_truncf\n"]
    pub fn SDL_lroundf(x: f32) -> core::ffi::c_long;
}
unsafe extern "C" {
    #[doc = " Scale `x` by an integer power of two.\n\n Multiplies `x` by the `n`th power of the floating point radix (always 2).\n\n Domain: `-INF <= x <= INF`, `n` integer\n\n Range: `-INF <= y <= INF`\n\n This function operates on double-precision floating point values, use\n SDL_scalbnf for single-precision floats.\n\n **Parameter:** x floating point value to be scaled.\n **Parameter:** n integer exponent.\n **Returns:** `x * 2^n`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_scalbnf\n **See Also:** SDL_pow\n"]
    pub fn SDL_scalbn(x: f64, n: core::ffi::c_int) -> f64;
}
unsafe extern "C" {
    #[doc = " Scale `x` by an integer power of two.\n\n Multiplies `x` by the `n`th power of the floating point radix (always 2).\n\n Domain: `-INF <= x <= INF`, `n` integer\n\n Range: `-INF <= y <= INF`\n\n This function operates on single-precision floating point values, use\n SDL_scalbn for double-precision floats.\n\n **Parameter:** x floating point value to be scaled.\n **Parameter:** n integer exponent.\n **Returns:** `x * 2^n`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_scalbn\n **See Also:** SDL_powf\n"]
    pub fn SDL_scalbnf(x: f32, n: core::ffi::c_int) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the sine of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-1 <= y <= 1`\n\n This function operates on double-precision floating point values, use\n SDL_sinf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** sine of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_sinf\n **See Also:** SDL_asin\n **See Also:** SDL_cos\n"]
    pub fn SDL_sin(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the sine of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-1 <= y <= 1`\n\n This function operates on single-precision floating point values, use\n SDL_sin for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** sine of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_sin\n **See Also:** SDL_asinf\n **See Also:** SDL_cosf\n"]
    pub fn SDL_sinf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the square root of `x`.\n\n Domain: `0 <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n This function operates on double-precision floating point values, use\n SDL_sqrtf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than or equal to 0.\n **Returns:** square root of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_sqrtf\n"]
    pub fn SDL_sqrt(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the square root of `x`.\n\n Domain: `0 <= x <= INF`\n\n Range: `0 <= y <= INF`\n\n This function operates on single-precision floating point values, use\n SDL_sqrt for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value. Must be greater than or equal to 0.\n **Returns:** square root of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_sqrt\n"]
    pub fn SDL_sqrtf(x: f32) -> f32;
}
unsafe extern "C" {
    #[doc = " Compute the tangent of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`\n\n This function operates on double-precision floating point values, use\n SDL_tanf for single-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** tangent of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_tanf\n **See Also:** SDL_sin\n **See Also:** SDL_cos\n **See Also:** SDL_atan\n **See Also:** SDL_atan2\n"]
    pub fn SDL_tan(x: f64) -> f64;
}
unsafe extern "C" {
    #[doc = " Compute the tangent of `x`.\n\n Domain: `-INF <= x <= INF`\n\n Range: `-INF <= y <= INF`\n\n This function operates on single-precision floating point values, use\n SDL_tan for double-precision floats.\n\n This function may use a different approximation across different versions,\n platforms and configurations. i.e, it can return a different value given\n the same input on different machines or operating systems, or if SDL is\n updated.\n\n **Parameter:** x floating point value, in radians.\n **Returns:** tangent of `x`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_tan\n **See Also:** SDL_sinf\n **See Also:** SDL_cosf\n **See Also:** SDL_atanf\n **See Also:** SDL_atan2f\n"]
    pub fn SDL_tanf(x: f32) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_iconv_data_t {
    _unused: [u8; 0],
}
#[doc = " An opaque handle representing string encoding conversion state.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n\n **See Also:** SDL_iconv_open\n"]
pub type SDL_iconv_t = *mut SDL_iconv_data_t;
unsafe extern "C" {
    #[doc = " This function allocates a context for the specified character set\n conversion.\n\n **Parameter:** tocode The target character encoding, must not be NULL.\n **Parameter:** fromcode The source character encoding, must not be NULL.\n **Returns:** a handle that must be freed with SDL_iconv_close, or\n          SDL_ICONV_ERROR on failure.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_iconv\n **See Also:** SDL_iconv_close\n **See Also:** SDL_iconv_string\n"]
    pub fn SDL_iconv_open(
        tocode: *const core::ffi::c_char,
        fromcode: *const core::ffi::c_char,
    ) -> SDL_iconv_t;
}
unsafe extern "C" {
    #[doc = " This function frees a context used for character set conversion.\n\n **Parameter:** cd The character set conversion handle.\n **Returns:** 0 on success, or -1 on failure.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_iconv\n **See Also:** SDL_iconv_open\n **See Also:** SDL_iconv_string\n"]
    pub fn SDL_iconv_close(cd: SDL_iconv_t) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " This function converts text between encodings, reading from and writing to\n a buffer.\n\n It returns the number of successful conversions on success. On error,\n SDL_ICONV_E2BIG is returned when the output buffer is too small, or\n SDL_ICONV_EILSEQ is returned when an invalid input sequence is encountered,\n or SDL_ICONV_EINVAL is returned when an incomplete input sequence is\n encountered.\n\n On exit:\n\n - inbuf will point to the beginning of the next multibyte sequence. On\n   error, this is the location of the problematic input sequence. On\n   success, this is the end of the input sequence.\n - inbytesleft will be set to the number of bytes left to convert, which\n   will be 0 on success.\n - outbuf will point to the location where to store the next output byte.\n - outbytesleft will be set to the number of bytes left in the output\n   buffer.\n\n **Parameter:** cd The character set conversion context, created in\n           SDL_iconv_open().\n **Parameter:** inbuf Address of variable that points to the first character of the\n              input sequence.\n **Parameter:** inbytesleft The number of bytes in the input buffer.\n **Parameter:** outbuf Address of variable that points to the output buffer.\n **Parameter:** outbytesleft The number of bytes in the output buffer.\n **Returns:** the number of conversions on success, or a negative error code.\n\n **Thread Safety:** Do not use the same SDL_iconv_t from two threads at once.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_iconv_open\n **See Also:** SDL_iconv_close\n **See Also:** SDL_iconv_string\n"]
    pub fn SDL_iconv(
        cd: SDL_iconv_t,
        inbuf: *mut *const core::ffi::c_char,
        inbytesleft: *mut usize,
        outbuf: *mut *mut core::ffi::c_char,
        outbytesleft: *mut usize,
    ) -> usize;
}
unsafe extern "C" {
    #[doc = " Helper function to convert a string's encoding in one call.\n\n This function converts a buffer or string between encodings in one pass.\n\n The string does not need to be NULL-terminated; this function operates on\n the number of bytes specified in `inbytesleft` whether there is a NULL\n character anywhere in the buffer.\n\n The returned string is owned by the caller, and should be passed to\n SDL_free when no longer needed.\n\n **Parameter:** tocode the character encoding of the output string. Examples are\n               \"UTF-8\", \"UCS-4\", etc.\n **Parameter:** fromcode the character encoding of data in `inbuf`.\n **Parameter:** inbuf the string to convert to a different encoding.\n **Parameter:** inbytesleft the size of the input string _in bytes_.\n **Returns:** a new string, converted to the new encoding, or NULL on error.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_iconv_open\n **See Also:** SDL_iconv_close\n **See Also:** SDL_iconv\n"]
    pub fn SDL_iconv_string(
        tocode: *const core::ffi::c_char,
        fromcode: *const core::ffi::c_char,
        inbuf: *const core::ffi::c_char,
        inbytesleft: usize,
    ) -> *mut core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Multiply two integers, checking for overflow.\n\n If `a * b` would overflow, return false.\n\n Otherwise store `a * b` via ret and return true.\n\n **Parameter:** a the multiplicand.\n **Parameter:** b the multiplier.\n **Parameter:** ret on non-overflow output, stores the multiplication result, may\n            not be NULL.\n **Returns:** false on overflow, true if result is multiplied without overflow.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    #[link_name = "SDL_size_mul_check_overflow__extern"]
    pub fn SDL_size_mul_check_overflow(a: usize, b: usize, ret: *mut usize) -> bool;
}
unsafe extern "C" {
    #[link_name = "SDL_size_mul_check_overflow_builtin__extern"]
    pub fn SDL_size_mul_check_overflow_builtin(a: usize, b: usize, ret: *mut usize) -> bool;
}
unsafe extern "C" {
    #[doc = " Add two integers, checking for overflow.\n\n If `a + b` would overflow, return false.\n\n Otherwise store `a + b` via ret and return true.\n\n **Parameter:** a the first addend.\n **Parameter:** b the second addend.\n **Parameter:** ret on non-overflow output, stores the addition result, may not be\n            NULL.\n **Returns:** false on overflow, true if result is added without overflow.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    #[link_name = "SDL_size_add_check_overflow__extern"]
    pub fn SDL_size_add_check_overflow(a: usize, b: usize, ret: *mut usize) -> bool;
}
unsafe extern "C" {
    #[link_name = "SDL_size_add_check_overflow_builtin__extern"]
    pub fn SDL_size_add_check_overflow_builtin(a: usize, b: usize, ret: *mut usize) -> bool;
}
pub type SDL_FunctionPointer = ::core::option::Option<unsafe extern "C" fn()>;
impl SDL_AssertState {
    #[doc = "< Retry the assert immediately.\n"]
    pub const SDL_ASSERTION_RETRY: SDL_AssertState = SDL_AssertState(0);
    #[doc = "< Make the debugger trigger a breakpoint.\n"]
    pub const SDL_ASSERTION_BREAK: SDL_AssertState = SDL_AssertState(1);
    #[doc = "< Terminate the program.\n"]
    pub const SDL_ASSERTION_ABORT: SDL_AssertState = SDL_AssertState(2);
    #[doc = "< Ignore the assert.\n"]
    pub const SDL_ASSERTION_IGNORE: SDL_AssertState = SDL_AssertState(3);
    #[doc = "< Ignore the assert from now on.\n"]
    pub const SDL_ASSERTION_ALWAYS_IGNORE: SDL_AssertState = SDL_AssertState(4);
}
#[repr(transparent)]
#[doc = " Possible outcomes from a triggered assertion.\n\n When an enabled assertion triggers, it may call the assertion handler\n (possibly one provided by the app via SDL_SetAssertionHandler), which will\n return one of these values, possibly after asking the user.\n\n Then SDL will respond based on this outcome (loop around to retry the\n condition, try to break in a debugger, kill the program, or ignore the\n problem).\n\n **Available Since:** This enum is available since SDL 3.2.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_AssertState(pub core::ffi::c_uint);
#[doc = " Information about an assertion failure.\n\n This structure is filled in with information about a triggered assertion,\n used by the assertion handler, then added to the assertion report. This is\n returned as a linked list from SDL_GetAssertionReport().\n\n **Available Since:** This struct is available since SDL 3.2.0.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct SDL_AssertData {
    #[doc = "< true if app should always continue when assertion is triggered.\n"]
    pub always_ignore: bool,
    #[doc = "< Number of times this assertion has been triggered.\n"]
    pub trigger_count: core::ffi::c_uint,
    #[doc = "< A string of this assert's test code.\n"]
    pub condition: *const core::ffi::c_char,
    #[doc = "< The source file where this assert lives.\n"]
    pub filename: *const core::ffi::c_char,
    #[doc = "< The line in `filename` where this assert lives.\n"]
    pub linenum: core::ffi::c_int,
    #[doc = "< The name of the function where this assert lives.\n"]
    pub function: *const core::ffi::c_char,
    #[doc = "< next item in the linked list.\n"]
    pub next: *const SDL_AssertData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AssertData"][::core::mem::size_of::<SDL_AssertData>() - 48usize];
    ["Alignment of SDL_AssertData"][::core::mem::align_of::<SDL_AssertData>() - 8usize];
    ["Offset of field: SDL_AssertData::always_ignore"]
        [::core::mem::offset_of!(SDL_AssertData, always_ignore) - 0usize];
    ["Offset of field: SDL_AssertData::trigger_count"]
        [::core::mem::offset_of!(SDL_AssertData, trigger_count) - 4usize];
    ["Offset of field: SDL_AssertData::condition"]
        [::core::mem::offset_of!(SDL_AssertData, condition) - 8usize];
    ["Offset of field: SDL_AssertData::filename"]
        [::core::mem::offset_of!(SDL_AssertData, filename) - 16usize];
    ["Offset of field: SDL_AssertData::linenum"]
        [::core::mem::offset_of!(SDL_AssertData, linenum) - 24usize];
    ["Offset of field: SDL_AssertData::function"]
        [::core::mem::offset_of!(SDL_AssertData, function) - 32usize];
    ["Offset of field: SDL_AssertData::next"]
        [::core::mem::offset_of!(SDL_AssertData, next) - 40usize];
};
impl Default for SDL_AssertData {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Never call this directly.\n\n Use the SDL_assert macros instead.\n\n **Parameter:** data assert data structure.\n **Parameter:** func function name.\n **Parameter:** file file name.\n **Parameter:** line line number.\n **Returns:** assert state.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_ReportAssertion(
        data: *mut SDL_AssertData,
        func: *const core::ffi::c_char,
        file: *const core::ffi::c_char,
        line: core::ffi::c_int,
    ) -> SDL_AssertState;
}
#[doc = " A callback that fires when an SDL assertion fails.\n\n **Parameter:** data a pointer to the SDL_AssertData structure corresponding to the\n             current assertion.\n **Parameter:** userdata what was passed as `userdata` to SDL_SetAssertionHandler().\n **Returns:** an SDL_AssertState value indicating how to handle the failure.\n\n **Thread Safety:** This callback may be called from any thread that triggers an\n               assert at any time.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n"]
pub type SDL_AssertionHandler = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const SDL_AssertData,
        userdata: *mut core::ffi::c_void,
    ) -> SDL_AssertState,
>;
unsafe extern "C" {
    #[doc = " Set an application-defined assertion handler.\n\n This function allows an application to show its own assertion UI and/or\n force the response to an assertion failure. If the application doesn't\n provide this, SDL will try to do the right thing, popping up a\n system-specific GUI dialog, and probably minimizing any fullscreen windows.\n\n This callback may fire from any thread, but it runs wrapped in a mutex, so\n it will only fire from one thread at a time.\n\n This callback is NOT reset to SDL's internal handler upon SDL_Quit()!\n\n **Parameter:** handler the SDL_AssertionHandler function to call when an assertion\n                fails or NULL for the default handler.\n **Parameter:** userdata a pointer that is passed to `handler`.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetAssertionHandler\n"]
    pub fn SDL_SetAssertionHandler(handler: SDL_AssertionHandler, userdata: *mut core::ffi::c_void);
}
unsafe extern "C" {
    #[doc = " Get the default assertion handler.\n\n This returns the function pointer that is called by default when an\n assertion is triggered. This is an internal function provided by SDL, that\n is used for assertions when SDL_SetAssertionHandler() hasn't been used to\n provide a different function.\n\n **Returns:** the default SDL_AssertionHandler that is called when an assert\n          triggers.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetAssertionHandler\n"]
    pub fn SDL_GetDefaultAssertionHandler() -> SDL_AssertionHandler;
}
unsafe extern "C" {
    #[doc = " Get the current assertion handler.\n\n This returns the function pointer that is called when an assertion is\n triggered. This is either the value last passed to\n SDL_SetAssertionHandler(), or if no application-specified function is set,\n is equivalent to calling SDL_GetDefaultAssertionHandler().\n\n The parameter `puserdata` is a pointer to a void*, which will store the\n \"userdata\" pointer that was passed to SDL_SetAssertionHandler(). This value\n will always be NULL for the default handler. If you don't care about this\n data, it is safe to pass a NULL pointer to this function to ignore it.\n\n **Parameter:** puserdata pointer which is filled with the \"userdata\" pointer that\n                  was passed to SDL_SetAssertionHandler().\n **Returns:** the SDL_AssertionHandler that is called when an assert triggers.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_SetAssertionHandler\n"]
    pub fn SDL_GetAssertionHandler(puserdata: *mut *mut core::ffi::c_void) -> SDL_AssertionHandler;
}
unsafe extern "C" {
    #[doc = " Get a list of all assertion failures.\n\n This function gets all assertions triggered since the last call to\n SDL_ResetAssertionReport(), or the start of the program.\n\n The proper way to examine this data looks something like this:\n\n ```c\n const SDL_AssertData *item = SDL_GetAssertionReport();\n while (item) {\n    printf(\"'%s', %s (%s:%d), triggered %u times, always ignore: %s.\\\\n\",\n           item->condition, item->function, item->filename,\n           item->linenum, item->trigger_count,\n           item->always_ignore ? \"yes\" : \"no\");\n    item = item->next;\n }\n ```\n\n **Returns:** a list of all failed assertions or NULL if the list is empty. This\n          memory should not be modified or freed by the application. This\n          pointer remains valid until the next call to SDL_Quit() or\n          SDL_ResetAssertionReport().\n\n **Thread Safety:** This function is not thread safe. Other threads calling\n               SDL_ResetAssertionReport() simultaneously, may render the\n               returned pointer invalid.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ResetAssertionReport\n"]
    pub fn SDL_GetAssertionReport() -> *const SDL_AssertData;
}
unsafe extern "C" {
    #[doc = " Clear the list of all assertion failures.\n\n This function will clear the list of all assertions triggered up to that\n point. Immediately following this call, SDL_GetAssertionReport will return\n no items. In addition, any previously-triggered assertions will be reset to\n a trigger_count of zero, and their always_ignore state will be false.\n\n **Thread Safety:** This function is not thread safe. Other threads triggering an\n               assertion, or simultaneously calling this function may cause\n               memory leaks or crashes.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetAssertionReport\n"]
    pub fn SDL_ResetAssertionReport();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AsyncIO {
    _unused: [u8; 0],
}
impl SDL_AsyncIOTaskType {
    #[doc = "< A read operation.\n"]
    pub const SDL_ASYNCIO_TASK_READ: SDL_AsyncIOTaskType = SDL_AsyncIOTaskType(0);
    #[doc = "< A write operation.\n"]
    pub const SDL_ASYNCIO_TASK_WRITE: SDL_AsyncIOTaskType = SDL_AsyncIOTaskType(1);
    #[doc = "< A close operation.\n"]
    pub const SDL_ASYNCIO_TASK_CLOSE: SDL_AsyncIOTaskType = SDL_AsyncIOTaskType(2);
}
#[repr(transparent)]
#[doc = " Types of asynchronous I/O tasks.\n\n **Available Since:** This enum is available since SDL 3.2.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_AsyncIOTaskType(pub core::ffi::c_uint);
impl SDL_AsyncIOResult {
    #[doc = "< request was completed without error\n"]
    pub const SDL_ASYNCIO_COMPLETE: SDL_AsyncIOResult = SDL_AsyncIOResult(0);
    #[doc = "< request failed for some reason; check SDL_GetError()!\n"]
    pub const SDL_ASYNCIO_FAILURE: SDL_AsyncIOResult = SDL_AsyncIOResult(1);
    #[doc = "< request was canceled before completing.\n"]
    pub const SDL_ASYNCIO_CANCELED: SDL_AsyncIOResult = SDL_AsyncIOResult(2);
}
#[repr(transparent)]
#[doc = " Possible outcomes of an asynchronous I/O task.\n\n **Available Since:** This enum is available since SDL 3.2.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_AsyncIOResult(pub core::ffi::c_uint);
#[doc = " Information about a completed asynchronous I/O request.\n\n **Available Since:** This struct is available since SDL 3.2.0.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct SDL_AsyncIOOutcome {
    #[doc = "< what generated this task. This pointer will be invalid if it was closed!\n"]
    pub asyncio: *mut SDL_AsyncIO,
    #[doc = "< What sort of task was this? Read, write, etc?\n"]
    pub type_: SDL_AsyncIOTaskType,
    #[doc = "< the result of the work (success, failure, cancellation).\n"]
    pub result: SDL_AsyncIOResult,
    #[doc = "< buffer where data was read/written.\n"]
    pub buffer: *mut core::ffi::c_void,
    #[doc = "< offset in the SDL_AsyncIO where data was read/written.\n"]
    pub offset: Uint64,
    #[doc = "< number of bytes the task was to read/write.\n"]
    pub bytes_requested: Uint64,
    #[doc = "< actual number of bytes that were read/written.\n"]
    pub bytes_transferred: Uint64,
    #[doc = "< pointer provided by the app when starting the task\n"]
    pub userdata: *mut core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AsyncIOOutcome"][::core::mem::size_of::<SDL_AsyncIOOutcome>() - 56usize];
    ["Alignment of SDL_AsyncIOOutcome"][::core::mem::align_of::<SDL_AsyncIOOutcome>() - 8usize];
    ["Offset of field: SDL_AsyncIOOutcome::asyncio"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, asyncio) - 0usize];
    ["Offset of field: SDL_AsyncIOOutcome::type_"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, type_) - 8usize];
    ["Offset of field: SDL_AsyncIOOutcome::result"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, result) - 12usize];
    ["Offset of field: SDL_AsyncIOOutcome::buffer"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, buffer) - 16usize];
    ["Offset of field: SDL_AsyncIOOutcome::offset"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, offset) - 24usize];
    ["Offset of field: SDL_AsyncIOOutcome::bytes_requested"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, bytes_requested) - 32usize];
    ["Offset of field: SDL_AsyncIOOutcome::bytes_transferred"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, bytes_transferred) - 40usize];
    ["Offset of field: SDL_AsyncIOOutcome::userdata"]
        [::core::mem::offset_of!(SDL_AsyncIOOutcome, userdata) - 48usize];
};
impl Default for SDL_AsyncIOOutcome {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_AsyncIOQueue {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Use this function to create a new SDL_AsyncIO object for reading from\n and/or writing to a named file.\n\n The `mode` string understands the following values:\n\n - \"r\": Open a file for reading only. It must exist.\n - \"w\": Open a file for writing only. It will create missing files or\n   truncate existing ones.\n - \"r+\": Open a file for update both reading and writing. The file must\n   exist.\n - \"w+\": Create an empty file for both reading and writing. If a file with\n   the same name already exists its content is erased and the file is\n   treated as a new empty file.\n\n There is no \"b\" mode, as there is only \"binary\" style I/O, and no \"a\" mode\n for appending, since you specify the position when starting a task.\n\n This function supports Unicode filenames, but they must be encoded in UTF-8\n format, regardless of the underlying operating system.\n\n This call is _not_ asynchronous; it will open the file before returning,\n under the assumption that doing so is generally a fast operation. Future\n reads and writes to the opened file will be async, however.\n\n **Parameter:** file a UTF-8 string representing the filename to open.\n **Parameter:** mode an ASCII string representing the mode to be used for opening\n             the file.\n **Returns:** a pointer to the SDL_AsyncIO structure that is created or NULL on\n          failure; call SDL_GetError() for more information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_CloseAsyncIO\n **See Also:** SDL_ReadAsyncIO\n **See Also:** SDL_WriteAsyncIO\n"]
    pub fn SDL_AsyncIOFromFile(
        file: *const core::ffi::c_char,
        mode: *const core::ffi::c_char,
    ) -> *mut SDL_AsyncIO;
}
unsafe extern "C" {
    #[doc = " Use this function to get the size of the data stream in an SDL_AsyncIO.\n\n This call is _not_ asynchronous; it assumes that obtaining this info is a\n non-blocking operation in most reasonable cases.\n\n **Parameter:** asyncio the SDL_AsyncIO to get the size of the data stream from.\n **Returns:** the size of the data stream in the SDL_IOStream on success or a\n          negative error code on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_GetAsyncIOSize(asyncio: *mut SDL_AsyncIO) -> Sint64;
}
unsafe extern "C" {
    #[doc = " Start an async read.\n\n This function reads up to `size` bytes from `offset` position in the data\n source to the area pointed at by `ptr`. This function may read less bytes\n than requested.\n\n This function returns as quickly as possible; it does not wait for the read\n to complete. On a successful return, this work will continue in the\n background. If the work begins, even failure is asynchronous: a failing\n return value from this function only means the work couldn't start at all.\n\n `ptr` must remain available until the work is done, and may be accessed by\n the system at any time until then. Do not allocate it on the stack, as this\n might take longer than the life of the calling function to complete!\n\n An SDL_AsyncIOQueue must be specified. The newly-created task will be added\n to it when it completes its work.\n\n **Parameter:** asyncio a pointer to an SDL_AsyncIO structure.\n **Parameter:** ptr a pointer to a buffer to read data into.\n **Parameter:** offset the position to start reading in the data source.\n **Parameter:** size the number of bytes to read from the data source.\n **Parameter:** queue a queue to add the new SDL_AsyncIO to.\n **Parameter:** userdata an app-defined pointer that will be provided with the task\n                 results.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_WriteAsyncIO\n **See Also:** SDL_CreateAsyncIOQueue\n"]
    pub fn SDL_ReadAsyncIO(
        asyncio: *mut SDL_AsyncIO,
        ptr: *mut core::ffi::c_void,
        offset: Uint64,
        size: Uint64,
        queue: *mut SDL_AsyncIOQueue,
        userdata: *mut core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Start an async write.\n\n This function writes `size` bytes from `offset` position in the data source\n to the area pointed at by `ptr`.\n\n This function returns as quickly as possible; it does not wait for the\n write to complete. On a successful return, this work will continue in the\n background. If the work begins, even failure is asynchronous: a failing\n return value from this function only means the work couldn't start at all.\n\n `ptr` must remain available until the work is done, and may be accessed by\n the system at any time until then. Do not allocate it on the stack, as this\n might take longer than the life of the calling function to complete!\n\n An SDL_AsyncIOQueue must be specified. The newly-created task will be added\n to it when it completes its work.\n\n **Parameter:** asyncio a pointer to an SDL_AsyncIO structure.\n **Parameter:** ptr a pointer to a buffer to write data from.\n **Parameter:** offset the position to start writing to the data source.\n **Parameter:** size the number of bytes to write to the data source.\n **Parameter:** queue a queue to add the new SDL_AsyncIO to.\n **Parameter:** userdata an app-defined pointer that will be provided with the task\n                 results.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_ReadAsyncIO\n **See Also:** SDL_CreateAsyncIOQueue\n"]
    pub fn SDL_WriteAsyncIO(
        asyncio: *mut SDL_AsyncIO,
        ptr: *mut core::ffi::c_void,
        offset: Uint64,
        size: Uint64,
        queue: *mut SDL_AsyncIOQueue,
        userdata: *mut core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Close and free any allocated resources for an async I/O object.\n\n Closing a file is _also_ an asynchronous task! If a write failure were to\n happen during the closing process, for example, the task results will\n report it as usual.\n\n Closing a file that has been written to does not guarantee the data has\n made it to physical media; it may remain in the operating system's file\n cache, for later writing to disk. This means that a successfully-closed\n file can be lost if the system crashes or loses power in this small window.\n To prevent this, call this function with the `flush` parameter set to true.\n This will make the operation take longer, and perhaps increase system load\n in general, but a successful result guarantees that the data has made it to\n physical storage. Don't use this for temporary files, caches, and\n unimportant data, and definitely use it for crucial irreplaceable files,\n like game saves.\n\n This function guarantees that the close will happen after any other pending\n tasks to `asyncio`, so it's safe to open a file, start several operations,\n close the file immediately, then check for all results later. This function\n will not block until the tasks have completed.\n\n Once this function returns true, `asyncio` is no longer valid, regardless\n of any future outcomes. Any completed tasks might still contain this\n pointer in their SDL_AsyncIOOutcome data, in case the app was using this\n value to track information, but it should not be used again.\n\n If this function returns false, the close wasn't started at all, and it's\n safe to attempt to close again later.\n\n An SDL_AsyncIOQueue must be specified. The newly-created task will be added\n to it when it completes its work.\n\n **Parameter:** asyncio a pointer to an SDL_AsyncIO structure to close.\n **Parameter:** flush true if data should sync to disk before the task completes.\n **Parameter:** queue a queue to add the new SDL_AsyncIO to.\n **Parameter:** userdata an app-defined pointer that will be provided with the task\n                 results.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread, but two\n               threads should not attempt to close the same object.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_CloseAsyncIO(
        asyncio: *mut SDL_AsyncIO,
        flush: bool,
        queue: *mut SDL_AsyncIOQueue,
        userdata: *mut core::ffi::c_void,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Create a task queue for tracking multiple I/O operations.\n\n Async I/O operations are assigned to a queue when started. The queue can be\n checked for completed tasks thereafter.\n\n **Returns:** a new task queue object or NULL if there was an error; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_DestroyAsyncIOQueue\n **See Also:** SDL_GetAsyncIOResult\n **See Also:** SDL_WaitAsyncIOResult\n"]
    pub fn SDL_CreateAsyncIOQueue() -> *mut SDL_AsyncIOQueue;
}
unsafe extern "C" {
    #[doc = " Destroy a previously-created async I/O task queue.\n\n If there are still tasks pending for this queue, this call will block until\n those tasks are finished. All those tasks will be deallocated. Their\n results will be lost to the app.\n\n Any pending reads from SDL_LoadFileAsync() that are still in this queue\n will have their buffers deallocated by this function, to prevent a memory\n leak.\n\n Once this function is called, the queue is no longer valid and should not\n be used, including by other threads that might access it while destruction\n is blocking on pending tasks.\n\n Do not destroy a queue that still has threads waiting on it through\n SDL_WaitAsyncIOResult(). You can call SDL_SignalAsyncIOQueue() first to\n unblock those threads, and take measures (such as SDL_WaitThread()) to make\n sure they have finished their wait and won't wait on the queue again.\n\n **Parameter:** queue the task queue to destroy.\n\n **Thread Safety:** It is safe to call this function from any thread, so long as\n               no other thread is waiting on the queue with\n               SDL_WaitAsyncIOResult.\n\n **Available Since:** This function is available since SDL 3.2.0.\n"]
    pub fn SDL_DestroyAsyncIOQueue(queue: *mut SDL_AsyncIOQueue);
}
unsafe extern "C" {
    #[doc = " Query an async I/O task queue for completed tasks.\n\n If a task assigned to this queue has finished, this will return true and\n fill in `outcome` with the details of the task. If no task in the queue has\n finished, this function will return false. This function does not block.\n\n If a task has completed, this function will free its resources and the task\n pointer will no longer be valid. The task will be removed from the queue.\n\n It is safe for multiple threads to call this function on the same queue at\n once; a completed task will only go to one of the threads.\n\n **Parameter:** queue the async I/O task queue to query.\n **Parameter:** outcome details of a finished task will be written here. May not be\n                NULL.\n **Returns:** true if a task has completed, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_WaitAsyncIOResult\n"]
    pub fn SDL_GetAsyncIOResult(
        queue: *mut SDL_AsyncIOQueue,
        outcome: *mut SDL_AsyncIOOutcome,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Block until an async I/O task queue has a completed task.\n\n This function puts the calling thread to sleep until there a task assigned\n to the queue that has finished.\n\n If a task assigned to the queue has finished, this will return true and\n fill in `outcome` with the details of the task. If no task in the queue has\n finished, this function will return false.\n\n If a task has completed, this function will free its resources and the task\n pointer will no longer be valid. The task will be removed from the queue.\n\n It is safe for multiple threads to call this function on the same queue at\n once; a completed task will only go to one of the threads.\n\n Note that by the nature of various platforms, more than one waiting thread\n may wake to handle a single task, but only one will obtain it, so\n `timeoutMS` is a _maximum_ wait time, and this function may return false\n sooner.\n\n This function may return false if there was a system error, the OS\n inadvertently awoke multiple threads, or if SDL_SignalAsyncIOQueue() was\n called to wake up all waiting threads without a finished task.\n\n A timeout can be used to specify a maximum wait time, but rather than\n polling, it is possible to have a timeout of -1 to wait forever, and use\n SDL_SignalAsyncIOQueue() to wake up the waiting threads later.\n\n **Parameter:** queue the async I/O task queue to wait on.\n **Parameter:** outcome details of a finished task will be written here. May not be\n                NULL.\n **Parameter:** timeoutMS the maximum time to wait, in milliseconds, or -1 to wait\n                  indefinitely.\n **Returns:** true if task has completed, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_SignalAsyncIOQueue\n"]
    pub fn SDL_WaitAsyncIOResult(
        queue: *mut SDL_AsyncIOQueue,
        outcome: *mut SDL_AsyncIOOutcome,
        timeoutMS: Sint32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Wake up any threads that are blocking in SDL_WaitAsyncIOResult().\n\n This will unblock any threads that are sleeping in a call to\n SDL_WaitAsyncIOResult for the specified queue, and cause them to return\n from that function.\n\n This can be useful when destroying a queue to make sure nothing is touching\n it indefinitely. In this case, once this call completes, the caller should\n take measures to make sure any previously-blocked threads have returned\n from their wait and will not touch the queue again (perhaps by setting a\n flag to tell the threads to terminate and then using SDL_WaitThread() to\n make sure they've done so).\n\n **Parameter:** queue the async I/O task queue to signal.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_WaitAsyncIOResult\n"]
    pub fn SDL_SignalAsyncIOQueue(queue: *mut SDL_AsyncIOQueue);
}
unsafe extern "C" {
    #[doc = " Load all the data from a file path, asynchronously.\n\n This function returns as quickly as possible; it does not wait for the read\n to complete. On a successful return, this work will continue in the\n background. If the work begins, even failure is asynchronous: a failing\n return value from this function only means the work couldn't start at all.\n\n The data is allocated with a zero byte at the end (null terminated) for\n convenience. This extra byte is not included in SDL_AsyncIOOutcome's\n bytes_transferred value.\n\n This function will allocate the buffer to contain the file. It must be\n deallocated by calling SDL_free() on SDL_AsyncIOOutcome's buffer field\n after completion.\n\n An SDL_AsyncIOQueue must be specified. The newly-created task will be added\n to it when it completes its work.\n\n **Parameter:** file the path to read all available data from.\n **Parameter:** queue a queue to add the new SDL_AsyncIO to.\n **Parameter:** userdata an app-defined pointer that will be provided with the task\n                 results.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_LoadFile_IO\n"]
    pub fn SDL_LoadFileAsync(
        file: *const core::ffi::c_char,
        queue: *mut SDL_AsyncIOQueue,
        userdata: *mut core::ffi::c_void,
    ) -> bool;
}
#[doc = " An atomic spinlock.\n\n The atomic locks are efficient spinlocks using CPU instructions, but are\n vulnerable to starvation and can spin forever if a thread holding a lock\n has been terminated. For this reason you should minimize the code executed\n inside an atomic lock and never do expensive things like API or system\n calls while holding them.\n\n They are also vulnerable to starvation if the thread holding the lock is\n lower priority than other threads and doesn't get scheduled. In general you\n should use mutexes instead, since they have better performance and\n contention behavior.\n\n The atomic locks are not safe to lock recursively.\n\n Porting Note: The spin lock functions and type are required and can not be\n emulated because they are used in the atomic emulation code.\n"]
pub type SDL_SpinLock = core::ffi::c_int;
unsafe extern "C" {
    #[doc = " Try to lock a spin lock by setting it to a non-zero value.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n **Parameter:** lock a pointer to a lock variable.\n **Returns:** true if the lock succeeded, false if the lock is already held.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_LockSpinlock\n **See Also:** SDL_UnlockSpinlock\n"]
    pub fn SDL_TryLockSpinlock(lock: *mut SDL_SpinLock) -> bool;
}
unsafe extern "C" {
    #[doc = " Lock a spin lock by setting it to a non-zero value.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n **Parameter:** lock a pointer to a lock variable.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_TryLockSpinlock\n **See Also:** SDL_UnlockSpinlock\n"]
    pub fn SDL_LockSpinlock(lock: *mut SDL_SpinLock);
}
unsafe extern "C" {
    #[doc = " Unlock a spin lock by setting it to 0.\n\n Always returns immediately.\n\n ***Please note that spinlocks are dangerous if you don't know what you're\n doing. Please be careful using any sort of spinlock!***\n\n **Parameter:** lock a pointer to a lock variable.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_LockSpinlock\n **See Also:** SDL_TryLockSpinlock\n"]
    pub fn SDL_UnlockSpinlock(lock: *mut SDL_SpinLock);
}
unsafe extern "C" {
    #[doc = " Insert a memory release barrier (function version).\n\n Please refer to SDL_MemoryBarrierRelease for details. This is a function\n version, which might be useful if you need to use this functionality from a\n scripting language, etc. Also, some of the macro versions call this\n function behind the scenes, where more heavy lifting can happen inside of\n SDL. Generally, though, an app written in C/C++/etc should use the macro\n version, as it will be more efficient.\n\n **Thread Safety:** Obviously this function is safe to use from any thread at any\n               time, but if you find yourself needing this, you are probably\n               dealing with some very sensitive code; be careful!\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_MemoryBarrierRelease\n"]
    pub fn SDL_MemoryBarrierReleaseFunction();
}
unsafe extern "C" {
    #[doc = " Insert a memory acquire barrier (function version).\n\n Please refer to SDL_MemoryBarrierRelease for details. This is a function\n version, which might be useful if you need to use this functionality from a\n scripting language, etc. Also, some of the macro versions call this\n function behind the scenes, where more heavy lifting can happen inside of\n SDL. Generally, though, an app written in C/C++/etc should use the macro\n version, as it will be more efficient.\n\n **Thread Safety:** Obviously this function is safe to use from any thread at any\n               time, but if you find yourself needing this, you are probably\n               dealing with some very sensitive code; be careful!\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_MemoryBarrierAcquire\n"]
    pub fn SDL_MemoryBarrierAcquireFunction();
}
#[doc = " A type representing an atomic integer value.\n\n This can be used to manage a value that is synchronized across multiple\n CPUs without a race condition; when an app sets a value with\n SDL_SetAtomicInt all other threads, regardless of the CPU it is running on,\n will see that value when retrieved with SDL_GetAtomicInt, regardless of CPU\n caches, etc.\n\n This is also useful for atomic compare-and-swap operations: a thread can\n change the value as long as its current value matches expectations. When\n done in a loop, one can guarantee data consistency across threads without a\n lock (but the usual warnings apply: if you don't know what you're doing, or\n you don't do it carefully, you can confidently cause any number of\n disasters with this, so in most cases, you _should_ use a mutex instead of\n this!).\n\n This is a struct so people don't accidentally use numeric operations on it\n directly. You have to use SDL atomic functions.\n\n **Available Since:** This struct is available since SDL 3.2.0.\n\n **See Also:** SDL_CompareAndSwapAtomicInt\n **See Also:** SDL_GetAtomicInt\n **See Also:** SDL_SetAtomicInt\n **See Also:** SDL_AddAtomicInt\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct SDL_AtomicInt {
    pub value: core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_AtomicInt"][::core::mem::size_of::<SDL_AtomicInt>() - 4usize];
    ["Alignment of SDL_AtomicInt"][::core::mem::align_of::<SDL_AtomicInt>() - 4usize];
    ["Offset of field: SDL_AtomicInt::value"]
        [::core::mem::offset_of!(SDL_AtomicInt, value) - 0usize];
};
unsafe extern "C" {
    #[doc = " Set an atomic variable to a new value if it is currently an old value.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n **Parameter:** a a pointer to an SDL_AtomicInt variable to be modified.\n **Parameter:** oldval the old value.\n **Parameter:** newval the new value.\n **Returns:** true if the atomic variable was set, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetAtomicInt\n **See Also:** SDL_SetAtomicInt\n"]
    pub fn SDL_CompareAndSwapAtomicInt(
        a: *mut SDL_AtomicInt,
        oldval: core::ffi::c_int,
        newval: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Set an atomic variable to a value.\n\n This function also acts as a full memory barrier.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n **Parameter:** a a pointer to an SDL_AtomicInt variable to be modified.\n **Parameter:** v the desired value.\n **Returns:** the previous value of the atomic variable.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_GetAtomicInt\n"]
    pub fn SDL_SetAtomicInt(a: *mut SDL_AtomicInt, v: core::ffi::c_int) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Get the value of an atomic variable.\n\n ***Note: If you don't know what this function is for, you shouldn't use\n it!***\n\n **Parameter:** a a pointer to an SDL_AtomicInt variable.\n **Returns:** the current value of an atomic variable.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL 3.2.0.\n\n **See Also:** SDL_SetAtomicInt\n"]
    pub fn SDL_GetAtomicInt(a: *mut SDL_AtomicInt) -> core::ffi::c_int;
}
unsafe extern "C" {
