/* automatically generated by rust-bindgen 0.72.1 */

use sdl_sys_bindgen::*;

pub const SDL_TTF_MAJOR_VERSION: u32 = 3;
pub const SDL_TTF_MINOR_VERSION: u32 = 3;
pub const SDL_TTF_MICRO_VERSION: u32 = 0;
pub const TTF_PROP_FONT_CREATE_FILENAME_STRING: &[u8; 29] = b"SDL_ttf.font.create.filename\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_POINTER: &[u8; 29] = b"SDL_ttf.font.create.iostream\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_OFFSET_NUMBER: &[u8; 36] =
    b"SDL_ttf.font.create.iostream.offset\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_AUTOCLOSE_BOOLEAN: &[u8; 39] =
    b"SDL_ttf.font.create.iostream.autoclose\0";
pub const TTF_PROP_FONT_CREATE_SIZE_FLOAT: &[u8; 25] = b"SDL_ttf.font.create.size\0";
pub const TTF_PROP_FONT_CREATE_FACE_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.face\0";
pub const TTF_PROP_FONT_CREATE_HORIZONTAL_DPI_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.hdpi\0";
pub const TTF_PROP_FONT_CREATE_VERTICAL_DPI_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.vdpi\0";
pub const TTF_PROP_FONT_CREATE_EXISTING_FONT_POINTER: &[u8; 34] =
    b"SDL_ttf.font.create.existing_font\0";
pub const TTF_PROP_FONT_OUTLINE_LINE_CAP_NUMBER: &[u8; 30] = b"SDL_ttf.font.outline.line_cap\0";
pub const TTF_PROP_FONT_OUTLINE_LINE_JOIN_NUMBER: &[u8; 31] = b"SDL_ttf.font.outline.line_join\0";
pub const TTF_PROP_FONT_OUTLINE_MITER_LIMIT_NUMBER: &[u8; 33] =
    b"SDL_ttf.font.outline.miter_limit\0";
pub const TTF_STYLE_NORMAL: u32 = 0;
pub const TTF_STYLE_BOLD: u32 = 1;

    #[doc = "Render word-wrapped UTF-8 text at LCD subpixel quality to a new ARGB\nsurface.\n\nThis function will allocate a new 32-bit, ARGB surface, and render\nalpha-blended text using FreeType's LCD subpixel rendering. This function\nreturns the new surface, or NULL if there was an error.\n\nText is wrapped to multiple lines on line endings and on word boundaries if\nit extends beyond `wrap_width` in pixels.\n\nIf wrap_width is 0, this function will only wrap on newline characters.\n\nYou can render at other quality levels with TTF_RenderText_Solid_Wrapped,\nTTF_RenderText_Shaded_Wrapped, and TTF_RenderText_Blended_Wrapped.\n\n**Parameter:** font the font to render with.\n\n**Parameter:** text text to render, in UTF-8 encoding.\n\n**Parameter:** length the length of the text, in bytes, or 0 for null terminated\ntext.\n\n**Parameter:** fg the foreground color for the text.\n\n**Parameter:** bg the background color for the text.\n\n**Parameter:** wrap_width the maximum width of the text surface or 0 to wrap on\nnewline characters.\n\n**Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n**Thread Safety:** This function should be called on the thread that created the\nfont.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_RenderText_Blended_Wrapped\n\n**See Also:** TTF_RenderText_LCD\n\n**See Also:** TTF_RenderText_Shaded_Wrapped\n\n**See Also:** TTF_RenderText_Solid_Wrapped"]
    pub fn TTF_RenderText_LCD_Wrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        bg: SDL_Color,
        wrap_width: core::ffi::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = "Render a single UNICODE codepoint at LCD subpixel quality to a new ARGB\nsurface.\n\nThis function will allocate a new 32-bit, ARGB surface, and render\nalpha-blended text using FreeType's LCD subpixel rendering. This function\nreturns the new surface, or NULL if there was an error.\n\nThe glyph is rendered without any padding or centering in the X direction,\nand aligned normally in the Y direction.\n\nYou can render at other quality levels with TTF_RenderGlyph_Solid,\nTTF_RenderGlyph_Shaded, and TTF_RenderGlyph_Blended.\n\n**Parameter:** font the font to render with.\n\n**Parameter:** ch the codepoint to render.\n\n**Parameter:** fg the foreground color for the text.\n\n**Parameter:** bg the background color for the text.\n\n**Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n**Thread Safety:** This function should be called on the thread that created the\nfont.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_RenderGlyph_Blended\n\n**See Also:** TTF_RenderGlyph_Shaded\n\n**See Also:** TTF_RenderGlyph_Solid"]
    pub fn TTF_RenderGlyph_LCD(
        font: *mut TTF_Font,
        ch: Uint32,
        fg: SDL_Color,
        bg: SDL_Color,
    ) -> *mut SDL_Surface;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTF_TextEngine {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTF_TextData {
    _unused: [u8; 0],
}
#[doc = "Text created with TTF_CreateText()\n\n**Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateText\n\n**See Also:** TTF_GetTextProperties\n\n**See Also:** TTF_DestroyText"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct TTF_Text {
    #[doc = "< A copy of the UTF-8 string that this text object represents, useful for layout, debugging and retrieving substring text. This is updated when the text object is modified and will be freed automatically when the object is destroyed."]
    pub text: *mut core::ffi::c_char,
    #[doc = "< The number of lines in the text, 0 if it's empty"]
    pub num_lines: core::ffi::c_int,
    #[doc = "< Application reference count, used when freeing surface"]
    pub refcount: core::ffi::c_int,
    #[doc = "< Private"]
    pub internal: *mut TTF_TextData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_Text"][::core::mem::size_of::<TTF_Text>() - 24usize];
    ["Alignment of TTF_Text"][::core::mem::align_of::<TTF_Text>() - 8usize];
    ["Offset of field: TTF_Text::text"][::core::mem::offset_of!(TTF_Text, text) - 0usize];
    ["Offset of field: TTF_Text::num_lines"][::core::mem::offset_of!(TTF_Text, num_lines) - 8usize];
    ["Offset of field: TTF_Text::refcount"][::core::mem::offset_of!(TTF_Text, refcount) - 12usize];
    ["Offset of field: TTF_Text::internal"][::core::mem::offset_of!(TTF_Text, internal) - 16usize];
};
impl Default for TTF_Text {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Create a text engine for drawing text on SDL surfaces.\n\n**Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\nfor more information.\n\n**Thread Safety:** It is safe to call this function from any thread.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_DestroySurfaceTextEngine\n\n**See Also:** TTF_DrawSurfaceText"]
    pub fn TTF_CreateSurfaceTextEngine() -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = "Draw text to an SDL surface.\n\n`text` must have been created using a TTF_TextEngine from\nTTF_CreateSurfaceTextEngine().\n\n**Parameter:** text the text to draw.\n\n**Parameter:** x the x coordinate in pixels, positive from the left edge towards\nthe right.\n\n**Parameter:** y the y coordinate in pixels, positive from the top edge towards the\nbottom.\n\n**Parameter:** surface the surface to draw on.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateSurfaceTextEngine\n\n**See Also:** TTF_CreateText"]
    pub fn TTF_DrawSurfaceText(
        text: *mut TTF_Text,
        x: core::ffi::c_int,
        y: core::ffi::c_int,
        surface: *mut SDL_Surface,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Destroy a text engine created for drawing text on SDL surfaces.\n\nAll text created by this engine should be destroyed before calling this\nfunction.\n\n**Parameter:** engine a TTF_TextEngine object created with\nTTF_CreateSurfaceTextEngine().\n\n**Thread Safety:** This function should be called on the thread that created the\nengine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateSurfaceTextEngine"]
    pub fn TTF_DestroySurfaceTextEngine(engine: *mut TTF_TextEngine);
}
unsafe extern "C" {
    #[doc = "Create a text engine for drawing text on an SDL renderer.\n\n**Parameter:** renderer the renderer to use for creating textures and drawing text.\n\n**Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\nfor more information.\n\n**Thread Safety:** This function should be called on the thread that created the\nrenderer.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_DestroyRendererTextEngine\n\n**See Also:** TTF_DrawRendererText\n\n**See Also:** TTF_CreateRendererTextEngineWithProperties"]
    pub fn TTF_CreateRendererTextEngine(renderer: *mut SDL_Renderer) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = "Create a text engine for drawing text on an SDL renderer, with the\nspecified properties.\n\nThese are the supported properties:\n\n- `TTF_PROP_RENDERER_TEXT_ENGINE_RENDERER_POINTER`: the renderer to use for\ncreating textures and drawing text\n- `TTF_PROP_RENDERER_TEXT_ENGINE_ATLAS_TEXTURE_SIZE_NUMBER`: the size of\nthe texture atlas\n\n**Parameter:** props the properties to use.\n\n**Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\nfor more information.\n\n**Thread Safety:** This function should be called on the thread that created the\nrenderer.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateRendererTextEngine\n\n**See Also:** TTF_DestroyRendererTextEngine\n\n**See Also:** TTF_DrawRendererText"]
    pub fn TTF_CreateRendererTextEngineWithProperties(
        props: SDL_PropertiesID,
    ) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = "Draw text to an SDL renderer.\n\n`text` must have been created using a TTF_TextEngine from\nTTF_CreateRendererTextEngine(), and will draw using the renderer passed to\nthat function.\n\n**Parameter:** text the text to draw.\n\n**Parameter:** x the x coordinate in pixels, positive from the left edge towards\nthe right.\n\n**Parameter:** y the y coordinate in pixels, positive from the top edge towards the\nbottom.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateRendererTextEngine\n\n**See Also:** TTF_CreateText"]
    pub fn TTF_DrawRendererText(text: *mut TTF_Text, x: f32, y: f32) -> bool;
}
unsafe extern "C" {
    #[doc = "Destroy a text engine created for drawing text on an SDL renderer.\n\nAll text created by this engine should be destroyed before calling this\nfunction.\n\n**Parameter:** engine a TTF_TextEngine object created with\nTTF_CreateRendererTextEngine().\n\n**Thread Safety:** This function should be called on the thread that created the\nengine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateRendererTextEngine"]
    pub fn TTF_DestroyRendererTextEngine(engine: *mut TTF_TextEngine);
}
unsafe extern "C" {
    #[doc = "Create a text engine for drawing text with the SDL GPU API.\n\n**Parameter:** device the SDL_GPUDevice to use for creating textures and drawing\ntext.\n\n**Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\nfor more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ndevice.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateGPUTextEngineWithProperties\n\n**See Also:** TTF_DestroyGPUTextEngine\n\n**See Also:** TTF_GetGPUTextDrawData"]
    pub fn TTF_CreateGPUTextEngine(device: *mut SDL_GPUDevice) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = "Create a text engine for drawing text with the SDL GPU API, with the\nspecified properties.\n\nThese are the supported properties:\n\n- `TTF_PROP_GPU_TEXT_ENGINE_DEVICE_POINTER`: the SDL_GPUDevice to use for\ncreating textures and drawing text.\n- `TTF_PROP_GPU_TEXT_ENGINE_ATLAS_TEXTURE_SIZE_NUMBER`: the size of the\ntexture atlas\n\n**Parameter:** props the properties to use.\n\n**Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\nfor more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ndevice.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateGPUTextEngine\n\n**See Also:** TTF_DestroyGPUTextEngine\n\n**See Also:** TTF_GetGPUTextDrawData"]
    pub fn TTF_CreateGPUTextEngineWithProperties(props: SDL_PropertiesID) -> *mut TTF_TextEngine;
}
#[doc = "Draw sequence returned by TTF_GetGPUTextDrawData\n\n**Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetGPUTextDrawData"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct TTF_GPUAtlasDrawSequence {
    #[doc = "< Texture atlas that stores the glyphs"]
    pub atlas_texture: *mut SDL_GPUTexture,
    #[doc = "< An array of vertex positions"]
    pub xy: *mut SDL_FPoint,
    #[doc = "< An array of normalized texture coordinates for each vertex"]
    pub uv: *mut SDL_FPoint,
    #[doc = "< Number of vertices"]
    pub num_vertices: core::ffi::c_int,
    #[doc = "< An array of indices into the 'vertices' arrays"]
    pub indices: *mut core::ffi::c_int,
    #[doc = "< Number of indices"]
    pub num_indices: core::ffi::c_int,
    #[doc = "< The image type of this draw sequence"]
    pub image_type: TTF_ImageType,
    #[doc = "< The next sequence (will be NULL in case of the last sequence)"]
    pub next: *mut TTF_GPUAtlasDrawSequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_GPUAtlasDrawSequence"]
        [::core::mem::size_of::<TTF_GPUAtlasDrawSequence>() - 56usize];
    ["Alignment of TTF_GPUAtlasDrawSequence"]
        [::core::mem::align_of::<TTF_GPUAtlasDrawSequence>() - 8usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::atlas_texture"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, atlas_texture) - 0usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::xy"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, xy) - 8usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::uv"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, uv) - 16usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::num_vertices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, num_vertices) - 24usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::indices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, indices) - 32usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::num_indices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, num_indices) - 40usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::image_type"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, image_type) - 44usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::next"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, next) - 48usize];
};
impl Default for TTF_GPUAtlasDrawSequence {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = "Get the geometry data needed for drawing the text.\n\n`text` must have been created using a TTF_TextEngine from\nTTF_CreateGPUTextEngine().\n\nThe positive X-axis is taken towards the right and the positive Y-axis is\ntaken upwards for both the vertex and the texture coordinates, i.e, it\nfollows the same convention used by the SDL_GPU API. If you want to use a\ndifferent coordinate system you will need to transform the vertices\nyourself.\n\nIf the text looks blocky use linear filtering.\n\n**Parameter:** text the text to draw.\n\n**Returns:** a NULL terminated linked list of TTF_GPUAtlasDrawSequence objects\nor NULL if the passed text is empty or in case of failure; call\nSDL_GetError() for more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateGPUTextEngine\n\n**See Also:** TTF_CreateText"]
    pub fn TTF_GetGPUTextDrawData(text: *mut TTF_Text) -> *mut TTF_GPUAtlasDrawSequence;
}
unsafe extern "C" {
    #[doc = "Destroy a text engine created for drawing text with the SDL GPU API.\n\nAll text created by this engine should be destroyed before calling this\nfunction.\n\n**Parameter:** engine a TTF_TextEngine object created with\nTTF_CreateGPUTextEngine().\n\n**Thread Safety:** This function should be called on the thread that created the\nengine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_CreateGPUTextEngine"]
    pub fn TTF_DestroyGPUTextEngine(engine: *mut TTF_TextEngine);
}
impl TTF_GPUTextEngineWinding {
    pub const TTF_GPU_TEXTENGINE_WINDING_INVALID: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(-1);
    pub const TTF_GPU_TEXTENGINE_WINDING_CLOCKWISE: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(0);
    pub const TTF_GPU_TEXTENGINE_WINDING_COUNTER_CLOCKWISE: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(1);
}
#[repr(transparent)]
#[doc = "The winding order of the vertices returned by TTF_GetGPUTextDrawData\n\n**Available Since:** This enum is available since SDL_ttf 3.0.0."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_GPUTextEngineWinding(pub core::ffi::c_int);
unsafe extern "C" {
    #[doc = "Sets the winding order of the vertices returned by TTF_GetGPUTextDrawData\nfor a particular GPU text engine.\n\n**Parameter:** engine a TTF_TextEngine object created with\nTTF_CreateGPUTextEngine().\n\n**Parameter:** winding the new winding order option.\n\n**Thread Safety:** This function should be called on the thread that created the\nengine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetGPUTextEngineWinding"]
    pub fn TTF_SetGPUTextEngineWinding(
        engine: *mut TTF_TextEngine,
        winding: TTF_GPUTextEngineWinding,
    );
}
unsafe extern "C" {
    #[doc = "Get the winding order of the vertices returned by TTF_GetGPUTextDrawData\nfor a particular GPU text engine\n\n**Parameter:** engine a TTF_TextEngine object created with\nTTF_CreateGPUTextEngine().\n\n**Returns:** the winding order used by the GPU text engine or\nTTF_GPU_TEXTENGINE_WINDING_INVALID in case of error.\n\n**Thread Safety:** This function should be called on the thread that created the\nengine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetGPUTextEngineWinding"]
    pub fn TTF_GetGPUTextEngineWinding(engine: *const TTF_TextEngine) -> TTF_GPUTextEngineWinding;
}
unsafe extern "C" {
    #[doc = "Create a text object from UTF-8 text and a text engine.\n\n**Parameter:** engine the text engine to use when creating the text object, may be\nNULL.\n\n**Parameter:** font the font to render with.\n\n**Parameter:** text the text to use, in UTF-8 encoding.\n\n**Parameter:** length the length of the text, in bytes, or 0 for null terminated\ntext.\n\n**Returns:** a TTF_Text object or NULL on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\nfont and text engine.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_DestroyText"]
    pub fn TTF_CreateText(
        engine: *mut TTF_TextEngine,
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
    ) -> *mut TTF_Text;
}
unsafe extern "C" {
    #[doc = "Get the properties associated with a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Returns:** a valid property ID on success or 0 on failure; call\nSDL_GetError() for more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0."]
    pub fn TTF_GetTextProperties(text: *mut TTF_Text) -> SDL_PropertiesID;
}
unsafe extern "C" {
    #[doc = "Set the text engine used by a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** engine the text engine to use for drawing.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextEngine"]
    pub fn TTF_SetTextEngine(text: *mut TTF_Text, engine: *mut TTF_TextEngine) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the text engine used by a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Returns:** the TTF_TextEngine used by the text on success or NULL on failure;\ncall SDL_GetError() for more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetTextEngine"]
    pub fn TTF_GetTextEngine(text: *mut TTF_Text) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = "Set the font used by a text object.\n\nWhen a text object has a font, any changes to the font will automatically\nregenerate the text. If you set the font to NULL, the text will continue to\nrender but changes to the font will no longer affect the text.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** font the font to use, may be NULL.\n\n**Returns:** false if the text pointer is null; otherwise, true. call\nSDL_GetError() for more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextFont"]
    pub fn TTF_SetTextFont(text: *mut TTF_Text, font: *mut TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the font used by a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Returns:** the TTF_Font used by the text on success or NULL on failure; call\nSDL_GetError() for more information.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetTextFont"]
    pub fn TTF_GetTextFont(text: *mut TTF_Text) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = "Set the direction to be used for text shaping a text object.\n\nThis function only supports left-to-right text shaping if SDL_ttf was not\nbuilt with HarfBuzz support.\n\n**Parameter:** text the text to modify.\n\n**Parameter:** direction the new direction for text to flow.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0."]
    pub fn TTF_SetTextDirection(text: *mut TTF_Text, direction: TTF_Direction) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the direction to be used for text shaping a text object.\n\nThis defaults to the direction of the font used by the text object.\n\n**Parameter:** text the text to query.\n\n**Returns:** the direction to be used for text shaping.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0."]
    pub fn TTF_GetTextDirection(text: *mut TTF_Text) -> TTF_Direction;
}
unsafe extern "C" {
    #[doc = "Set the script to be used for text shaping a text object.\n\nThis returns false if SDL_ttf isn't built with HarfBuzz support.\n\n**Parameter:** text the text to modify.\n\n**Parameter:** script an\n[ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_StringToTag"]
    pub fn TTF_SetTextScript(text: *mut TTF_Text, script: Uint32) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the script used for text shaping a text object.\n\nThis defaults to the script of the font used by the text object.\n\n**Parameter:** text the text to query.\n\n**Returns:** an\n[ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\nor 0 if a script hasn't been set on either the text object or the\nfont.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_TagToString"]
    pub fn TTF_GetTextScript(text: *mut TTF_Text) -> Uint32;
}
unsafe extern "C" {
    #[doc = "Set the color of a text object.\n\nThe default text color is white (255, 255, 255, 255).\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** r the red color value in the range of 0-255.\n\n**Parameter:** g the green color value in the range of 0-255.\n\n**Parameter:** b the blue color value in the range of 0-255.\n\n**Parameter:** a the alpha value in the range of 0-255.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextColor\n\n**See Also:** TTF_SetTextColorFloat"]
    pub fn TTF_SetTextColor(text: *mut TTF_Text, r: Uint8, g: Uint8, b: Uint8, a: Uint8) -> bool;
}
unsafe extern "C" {
    #[doc = "Set the color of a text object.\n\nThe default text color is white (1.0f, 1.0f, 1.0f, 1.0f).\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** r the red color value, normally in the range of 0-1.\n\n**Parameter:** g the green color value, normally in the range of 0-1.\n\n**Parameter:** b the blue color value, normally in the range of 0-1.\n\n**Parameter:** a the alpha value in the range of 0-1.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextColorFloat\n\n**See Also:** TTF_SetTextColor"]
    pub fn TTF_SetTextColorFloat(text: *mut TTF_Text, r: f32, g: f32, b: f32, a: f32) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the color of a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Parameter:** r a pointer filled in with the red color value in the range of\n0-255, may be NULL.\n\n**Parameter:** g a pointer filled in with the green color value in the range of\n0-255, may be NULL.\n\n**Parameter:** b a pointer filled in with the blue color value in the range of\n0-255, may be NULL.\n\n**Parameter:** a a pointer filled in with the alpha value in the range of 0-255,\nmay be NULL.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextColorFloat\n\n**See Also:** TTF_SetTextColor"]
    pub fn TTF_GetTextColor(
        text: *mut TTF_Text,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the color of a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Parameter:** r a pointer filled in with the red color value, normally in the\nrange of 0-1, may be NULL.\n\n**Parameter:** g a pointer filled in with the green color value, normally in the\nrange of 0-1, may be NULL.\n\n**Parameter:** b a pointer filled in with the blue color value, normally in the\nrange of 0-1, may be NULL.\n\n**Parameter:** a a pointer filled in with the alpha value in the range of 0-1, may\nbe NULL.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextColor\n\n**See Also:** TTF_SetTextColorFloat"]
    pub fn TTF_GetTextColorFloat(
        text: *mut TTF_Text,
        r: *mut f32,
        g: *mut f32,
        b: *mut f32,
        a: *mut f32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Set the position of a text object.\n\nThis can be used to position multiple text objects within a single wrapping\ntext area.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** x the x offset of the upper left corner of this text in pixels.\n\n**Parameter:** y the y offset of the upper left corner of this text in pixels.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextPosition"]
    pub fn TTF_SetTextPosition(
        text: *mut TTF_Text,
        x: core::ffi::c_int,
        y: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the position of a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Parameter:** x a pointer filled in with the x offset of the upper left corner of\nthis text in pixels, may be NULL.\n\n**Parameter:** y a pointer filled in with the y offset of the upper left corner of\nthis text in pixels, may be NULL.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetTextPosition"]
    pub fn TTF_GetTextPosition(
        text: *mut TTF_Text,
        x: *mut core::ffi::c_int,
        y: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Set whether wrapping is enabled on a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** wrap_width the maximum width in pixels, 0 to wrap on newline\ncharacters.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetTextWrapWidth"]
    pub fn TTF_SetTextWrapWidth(text: *mut TTF_Text, wrap_width: core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = "Get whether wrapping is enabled on a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Parameter:** wrap_width a pointer filled in with the maximum width in pixels or 0\nif the text is being wrapped on newline characters.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetTextWrapWidth"]
    pub fn TTF_GetTextWrapWidth(text: *mut TTF_Text, wrap_width: *mut core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = "Set whether whitespace should be visible when wrapping a text object.\n\nIf the whitespace is visible, it will take up space for purposes of\nalignment and wrapping. This is good for editing, but looks better when\ncentered or aligned if whitespace around line wrapping is hidden. This\ndefaults false.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** visible true to show whitespace when wrapping text, false to hide\nit.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_TextWrapWhitespaceVisible"]
    pub fn TTF_SetTextWrapWhitespaceVisible(text: *mut TTF_Text, visible: bool) -> bool;
}
unsafe extern "C" {
    #[doc = "Return whether whitespace is shown when wrapping a text object.\n\n**Parameter:** text the TTF_Text to query.\n\n**Returns:** true if whitespace is shown when wrapping text, or false\notherwise.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SetTextWrapWhitespaceVisible"]
    pub fn TTF_TextWrapWhitespaceVisible(text: *mut TTF_Text) -> bool;
}
unsafe extern "C" {
    #[doc = "Set the UTF-8 text used by a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** string the UTF-8 text to use, may be NULL.\n\n**Parameter:** length the length of the text, in bytes, or 0 for null terminated\ntext.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_AppendTextString\n\n**See Also:** TTF_DeleteTextString\n\n**See Also:** TTF_InsertTextString"]
    pub fn TTF_SetTextString(
        text: *mut TTF_Text,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Insert UTF-8 text into a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** offset the offset, in bytes, from the beginning of the string if >=\n0, the offset from the end of the string if < 0. Note that\nthis does not do UTF-8 validation, so you should only insert\nat UTF-8 sequence boundaries.\n\n**Parameter:** string the UTF-8 text to insert.\n\n**Parameter:** length the length of the text, in bytes, or 0 for null terminated\ntext.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_AppendTextString\n\n**See Also:** TTF_DeleteTextString\n\n**See Also:** TTF_SetTextString"]
    pub fn TTF_InsertTextString(
        text: *mut TTF_Text,
        offset: core::ffi::c_int,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Append UTF-8 text to a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** string the UTF-8 text to insert.\n\n**Parameter:** length the length of the text, in bytes, or 0 for null terminated\ntext.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_DeleteTextString\n\n**See Also:** TTF_InsertTextString\n\n**See Also:** TTF_SetTextString"]
    pub fn TTF_AppendTextString(
        text: *mut TTF_Text,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Delete UTF-8 text from a text object.\n\nThis function may cause the internal text representation to be rebuilt.\n\n**Parameter:** text the TTF_Text to modify.\n\n**Parameter:** offset the offset, in bytes, from the beginning of the string if >=\n0, the offset from the end of the string if < 0. Note that\nthis does not do UTF-8 validation, so you should only delete\nat UTF-8 sequence boundaries.\n\n**Parameter:** length the length of text to delete, in bytes, or -1 for the\nremainder of the string.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_AppendTextString\n\n**See Also:** TTF_InsertTextString\n\n**See Also:** TTF_SetTextString"]
    pub fn TTF_DeleteTextString(
        text: *mut TTF_Text,
        offset: core::ffi::c_int,
        length: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "Get the size of a text object.\n\nThe size of the text may change when the font or font style and size\nchange.\n\n**Parameter:** text the TTF_Text to query.\n\n**Parameter:** w a pointer filled in with the width of the text, in pixels, may be\nNULL.\n\n**Parameter:** h a pointer filled in with the height of the text, in pixels, may be\nNULL.\n\n**Returns:** true on success or false on failure; call SDL_GetError() for more\ninformation.\n\n**Thread Safety:** This function should be called on the thread that created the\ntext.\n\n**Available Since:** This function is available since SDL_ttf 3.0.0."]
    pub fn TTF_GetTextSize(
        text: *mut TTF_Text,
        w: *mut core::ffi::c_int,
        h: *mut core::ffi::c_int,
    ) -> bool;
}
#[doc = "Flags for TTF_SubString\n\n**Available Since:** This datatype is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_SubString"]
pub type TTF_SubStringFlags = Uint32;
#[doc = "The representation of a substring within text.\n\n**Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n**See Also:** TTF_GetNextTextSubString\n\n**See Also:** TTF_GetPreviousTextSubString\n\n**See Also:** TTF_GetTextSubString\n\n**See Also:** TTF_GetTextSubStringForLine\n\n**See Also:** TTF_GetTextSubStringForPoint\n\n**See Also:** TTF_GetTextSubStringsForRange"]
#[repr(C)]
pub struct TTF_SubString {
    #[doc = "< The flags for this substring"]
    pub flags: TTF_SubStringFlags,
    #[doc = "< The byte offset from the beginning of the text"]
    pub offset: core::ffi::c_int,
    #[doc = "< The byte length starting at the offset"]
    pub length: core::ffi::c_int,
    #[doc = "< The index of the line that contains this substring"]
    pub line_index: core::ffi::c_int,
    #[doc = "< The internal cluster index, used for quickly iterating"]
    pub cluster_index: core::ffi::c_int,
    #[doc = "< The rectangle, relative to the top left of the text, containing the substring"]
    pub rect: SDL_Rect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_SubString"][::core::mem::size_of::<TTF_SubString>() - 36usize];
    ["Alignment of TTF_SubString"][::core::mem::align_of::<TTF_SubString>() - 4usize];
    ["Offset of field: TTF_SubString::flags"]
        [::core::mem::offset_of!(TTF_SubString, flags) - 0usize];
    ["Offset of field: TTF_SubString::offset"]
        [::core::mem::offset_of!(TTF_SubString, offset) - 4usize];
    ["Offset of field: TTF_SubString::length"]
        [::core::mem::offset_of!(TTF_SubString, length) - 8usize];
    ["Offset of field: TTF_SubString::line_index"]
        [::core::mem::offset_of!(TTF_SubString, line_index) - 12usize];
    ["Offset of field: TTF_SubString::cluster_index"]
        [::core::mem::offset_of!(TTF_SubString, cluster_index) - 16usize];
    ["Offset of field: TTF_SubString::rect"]
        [::core::mem::offset_of!(TTF_SubString, rect) - 20usize];
};
impl Default for TTF_SubString {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
