/* automatically generated by rust-bindgen 0.72.1 */

use sdl_sys_bindgen::*;

pub const SDL_TTF_MAJOR_VERSION: u32 = 3;
pub const SDL_TTF_MINOR_VERSION: u32 = 3;
pub const SDL_TTF_MICRO_VERSION: u32 = 0;
pub const TTF_PROP_FONT_CREATE_FILENAME_STRING: &[u8; 29] = b"SDL_ttf.font.create.filename\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_POINTER: &[u8; 29] = b"SDL_ttf.font.create.iostream\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_OFFSET_NUMBER: &[u8; 36] =
    b"SDL_ttf.font.create.iostream.offset\0";
pub const TTF_PROP_FONT_CREATE_IOSTREAM_AUTOCLOSE_BOOLEAN: &[u8; 39] =
    b"SDL_ttf.font.create.iostream.autoclose\0";
pub const TTF_PROP_FONT_CREATE_SIZE_FLOAT: &[u8; 25] = b"SDL_ttf.font.create.size\0";
pub const TTF_PROP_FONT_CREATE_FACE_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.face\0";
pub const TTF_PROP_FONT_CREATE_HORIZONTAL_DPI_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.hdpi\0";
pub const TTF_PROP_FONT_CREATE_VERTICAL_DPI_NUMBER: &[u8; 25] = b"SDL_ttf.font.create.vdpi\0";
pub const TTF_PROP_FONT_CREATE_EXISTING_FONT_POINTER: &[u8; 34] =
    b"SDL_ttf.font.create.existing_font\0";
pub const TTF_PROP_FONT_OUTLINE_LINE_CAP_NUMBER: &[u8; 30] = b"SDL_ttf.font.outline.line_cap\0";
pub const TTF_PROP_FONT_OUTLINE_LINE_JOIN_NUMBER: &[u8; 31] = b"SDL_ttf.font.outline.line_join\0";
pub const TTF_PROP_FONT_OUTLINE_MITER_LIMIT_NUMBER: &[u8; 33] =
    b"SDL_ttf.font.outline.miter_limit\0";
pub const TTF_STYLE_NORMAL: u32 = 0;
pub const TTF_STYLE_BOLD: u32 = 1;

    pub const SDL_PIXELFORMAT_XRGB32: SDL_PixelFormat = SDL_PixelFormat(375789572);
    pub const SDL_PIXELFORMAT_BGRX32: SDL_PixelFormat = SDL_PixelFormat(370546692);
    pub const SDL_PIXELFORMAT_XBGR32: SDL_PixelFormat = SDL_PixelFormat(371595268);
}
#[repr(transparent)]
#[doc = " Pixel format.\n\n SDL's pixel formats have the following naming convention:\n\n - Names with a list of components and a single bit count, such as RGB24 and\n   ABGR32, define a platform-independent encoding into bytes in the order\n   specified. For example, in RGB24 data, each pixel is encoded in 3 bytes\n   (red, green, blue) in that order, and in ABGR32 data, each pixel is\n   encoded in 4 bytes (alpha, blue, green, red) in that order. Use these\n   names if the property of a format that is important to you is the order\n   of the bytes in memory or on disk.\n - Names with a bit count per component, such as ARGB8888 and XRGB1555, are\n   \"packed\" into an appropriately-sized integer in the platform's native\n   endianness. For example, ARGB8888 is a sequence of 32-bit integers; in\n   each integer, the most significant bits are alpha, and the least\n   significant bits are blue. On a little-endian CPU such as x86, the least\n   significant bits of each integer are arranged first in memory, but on a\n   big-endian CPU such as s390x, the most significant bits are arranged\n   first. Use these names if the property of a format that is important to\n   you is the meaning of each bit position within a native-endianness\n   integer.\n - In indexed formats such as INDEX4LSB, each pixel is represented by\n   encoding an index into the palette into the indicated number of bits,\n   with multiple pixels packed into each byte if appropriate. In LSB\n   formats, the first (leftmost) pixel is stored in the least-significant\n   bits of the byte; in MSB formats, it's stored in the most-significant\n   bits. INDEX8 does not need LSB/MSB variants, because each pixel exactly\n   fills one byte.\n\n The 32-bit byte-array encodings such as RGBA32 are aliases for the\n appropriate 8888 encoding for the current platform. For example, RGBA32 is\n an alias for ABGR8888 on little-endian CPUs like x86, or an alias for\n RGBA8888 on big-endian CPUs.\n\n **Available Since:** This enum is available since SDL 3.2.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SDL_PixelFormat(pub core::ffi::c_uint);
#[doc = " A structure that represents a color as RGBA components.\n\n The bits of this structure can be directly reinterpreted as an\n integer-packed color which uses the SDL_PIXELFORMAT_RGBA32 format\n (SDL_PIXELFORMAT_ABGR8888 on little-endian systems and\n SDL_PIXELFORMAT_RGBA8888 on big-endian systems).\n\n **Available Since:** This struct is available since SDL 3.2.0.\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct SDL_Color {
    pub r: Uint8,
    pub g: Uint8,
    pub b: Uint8,
    pub a: Uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Color"][::core::mem::size_of::<SDL_Color>() - 4usize];
    ["Alignment of SDL_Color"][::core::mem::align_of::<SDL_Color>() - 1usize];
    ["Offset of field: SDL_Color::r"][::core::mem::offset_of!(SDL_Color, r) - 0usize];
    ["Offset of field: SDL_Color::g"][::core::mem::offset_of!(SDL_Color, g) - 1usize];
    ["Offset of field: SDL_Color::b"][::core::mem::offset_of!(SDL_Color, b) - 2usize];
    ["Offset of field: SDL_Color::a"][::core::mem::offset_of!(SDL_Color, a) - 3usize];
};
#[doc = " The structure that defines a point (using floating point values).\n\n **Available Since:** This struct is available since SDL 3.2.0.\n\n **See Also:** SDL_GetRectEnclosingPointsFloat\n **See Also:** SDL_PointInRectFloat\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SDL_FPoint {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_FPoint"][::core::mem::size_of::<SDL_FPoint>() - 8usize];
    ["Alignment of SDL_FPoint"][::core::mem::align_of::<SDL_FPoint>() - 4usize];
    ["Offset of field: SDL_FPoint::x"][::core::mem::offset_of!(SDL_FPoint, x) - 0usize];
    ["Offset of field: SDL_FPoint::y"][::core::mem::offset_of!(SDL_FPoint, y) - 4usize];
};
#[doc = " A rectangle, with the origin at the upper left (using integers).\n\n **Available Since:** This struct is available since SDL 3.2.0.\n\n **See Also:** SDL_RectEmpty\n **See Also:** SDL_RectsEqual\n **See Also:** SDL_HasRectIntersection\n **See Also:** SDL_GetRectIntersection\n **See Also:** SDL_GetRectAndLineIntersection\n **See Also:** SDL_GetRectUnion\n **See Also:** SDL_GetRectEnclosingPoints\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct SDL_Rect {
    pub x: core::ffi::c_int,
    pub y: core::ffi::c_int,
    pub w: core::ffi::c_int,
    pub h: core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Rect"][::core::mem::size_of::<SDL_Rect>() - 16usize];
    ["Alignment of SDL_Rect"][::core::mem::align_of::<SDL_Rect>() - 4usize];
    ["Offset of field: SDL_Rect::x"][::core::mem::offset_of!(SDL_Rect, x) - 0usize];
    ["Offset of field: SDL_Rect::y"][::core::mem::offset_of!(SDL_Rect, y) - 4usize];
    ["Offset of field: SDL_Rect::w"][::core::mem::offset_of!(SDL_Rect, w) - 8usize];
    ["Offset of field: SDL_Rect::h"][::core::mem::offset_of!(SDL_Rect, h) - 12usize];
};
#[doc = " The flags on an SDL_Surface.\n\n These are generally considered read-only.\n\n **Available Since:** This datatype is available since SDL 3.2.0.\n"]
pub type SDL_SurfaceFlags = Uint32;
#[doc = " A collection of pixels used in software blitting.\n\n Pixels are arranged in memory in rows, with the top row first. Each row\n occupies an amount of memory given by the pitch (sometimes known as the row\n stride in non-SDL APIs).\n\n Within each row, pixels are arranged from left to right until the width is\n reached. Each pixel occupies a number of bits appropriate for its format,\n with most formats representing each pixel as one or more whole bytes (in\n some indexed formats, instead multiple pixels are packed into each byte),\n and a byte order given by the format. After encoding all pixels, any\n remaining bytes to reach the pitch are used as padding to reach a desired\n alignment, and have undefined contents.\n\n When a surface holds YUV format data, the planes are assumed to be\n contiguous without padding between them, e.g. a 32x32 surface in NV12\n format with a pitch of 32 would consist of 32x32 bytes of Y plane followed\n by 32x16 bytes of UV plane.\n\n When a surface holds MJPG format data, pixels points at the compressed JPEG\n image and pitch is the length of that data.\n\n **Available Since:** This struct is available since SDL 3.2.0.\n\n **See Also:** SDL_CreateSurface\n **See Also:** SDL_DestroySurface\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct SDL_Surface {
    #[doc = "< The flags of the surface, read-only\n"]
    pub flags: SDL_SurfaceFlags,
    #[doc = "< The format of the surface, read-only\n"]
    pub format: SDL_PixelFormat,
    #[doc = "< The width of the surface, read-only.\n"]
    pub w: core::ffi::c_int,
    #[doc = "< The height of the surface, read-only.\n"]
    pub h: core::ffi::c_int,
    #[doc = "< The distance in bytes between rows of pixels, read-only\n"]
    pub pitch: core::ffi::c_int,
    #[doc = "< A pointer to the pixels of the surface, the pixels are writeable if non-NULL\n"]
    pub pixels: *mut core::ffi::c_void,
    #[doc = "< Application reference count, used when freeing surface\n"]
    pub refcount: core::ffi::c_int,
    #[doc = "< Reserved for internal use\n"]
    pub reserved: *mut core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SDL_Surface"][::core::mem::size_of::<SDL_Surface>() - 32usize];
    ["Alignment of SDL_Surface"][::core::mem::align_of::<SDL_Surface>() - 4usize];
    ["Offset of field: SDL_Surface::flags"][::core::mem::offset_of!(SDL_Surface, flags) - 0usize];
    ["Offset of field: SDL_Surface::format"][::core::mem::offset_of!(SDL_Surface, format) - 4usize];
    ["Offset of field: SDL_Surface::w"][::core::mem::offset_of!(SDL_Surface, w) - 8usize];
    ["Offset of field: SDL_Surface::h"][::core::mem::offset_of!(SDL_Surface, h) - 12usize];
    ["Offset of field: SDL_Surface::pitch"][::core::mem::offset_of!(SDL_Surface, pitch) - 16usize];
    ["Offset of field: SDL_Surface::pixels"]
        [::core::mem::offset_of!(SDL_Surface, pixels) - 20usize];
    ["Offset of field: SDL_Surface::refcount"]
        [::core::mem::offset_of!(SDL_Surface, refcount) - 24usize];
    ["Offset of field: SDL_Surface::reserved"]
        [::core::mem::offset_of!(SDL_Surface, reserved) - 28usize];
};
impl Default for SDL_Surface {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_GPUDevice {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_GPUTexture {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SDL_Renderer {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " This function gets the version of the dynamically linked SDL_ttf library.\n\n **Returns:** SDL_ttf version.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_Version() -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query the version of the FreeType library in use.\n\n TTF_Init() should be called before calling this function.\n\n **Parameter:** major to be filled in with the major version number. Can be NULL.\n **Parameter:** minor to be filled in with the minor version number. Can be NULL.\n **Parameter:** patch to be filled in with the param version number. Can be NULL.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_Init\n"]
    pub fn TTF_GetFreeTypeVersion(
        major: *mut core::ffi::c_int,
        minor: *mut core::ffi::c_int,
        patch: *mut core::ffi::c_int,
    );
}
unsafe extern "C" {
    #[doc = " Query the version of the HarfBuzz library in use.\n\n If HarfBuzz is not available, the version reported is 0.0.0.\n\n **Parameter:** major to be filled in with the major version number. Can be NULL.\n **Parameter:** minor to be filled in with the minor version number. Can be NULL.\n **Parameter:** patch to be filled in with the param version number. Can be NULL.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetHarfBuzzVersion(
        major: *mut core::ffi::c_int,
        minor: *mut core::ffi::c_int,
        patch: *mut core::ffi::c_int,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTF_Font {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Initialize SDL_ttf.\n\n You must successfully call this function before it is safe to call any\n other function in this library.\n\n It is safe to call this more than once, and each successful TTF_Init() call\n should be paired with a matching TTF_Quit() call.\n\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_Quit\n"]
    pub fn TTF_Init() -> bool;
}
unsafe extern "C" {
    #[doc = " Create a font from a file, using a specified point size.\n\n Some .fon fonts will have several sizes embedded in the file, so the point\n size becomes the index of choosing which size. If the value is too high,\n the last indexed size will be the default.\n\n When done with the returned TTF_Font, use TTF_CloseFont() to dispose of it.\n\n **Parameter:** file path to font file.\n **Parameter:** ptsize point size to use for the newly-opened font.\n **Returns:** a valid TTF_Font, or NULL on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CloseFont\n"]
    pub fn TTF_OpenFont(file: *const core::ffi::c_char, ptsize: f32) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = " Create a font from an SDL_IOStream, using a specified point size.\n\n Some .fon fonts will have several sizes embedded in the file, so the point\n size becomes the index of choosing which size. If the value is too high,\n the last indexed size will be the default.\n\n If `closeio` is true, `src` will be automatically closed once the font is\n closed. Otherwise you should keep `src` open until the font is closed.\n\n When done with the returned TTF_Font, use TTF_CloseFont() to dispose of it.\n\n **Parameter:** src an SDL_IOStream to provide a font file's data.\n **Parameter:** closeio true to close `src` when the font is closed, false to leave\n                it open.\n **Parameter:** ptsize point size to use for the newly-opened font.\n **Returns:** a valid TTF_Font, or NULL on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CloseFont\n"]
    pub fn TTF_OpenFontIO(src: *mut SDL_IOStream, closeio: bool, ptsize: f32) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = " Create a font with the specified properties.\n\n These are the supported properties:\n\n - `TTF_PROP_FONT_CREATE_FILENAME_STRING`: the font file to open, if an\n   SDL_IOStream isn't being used. This is required if\n   `TTF_PROP_FONT_CREATE_IOSTREAM_POINTER` and\n   `TTF_PROP_FONT_CREATE_EXISTING_FONT_POINTER` aren't set.\n - `TTF_PROP_FONT_CREATE_IOSTREAM_POINTER`: an SDL_IOStream containing the\n   font to be opened. This should not be closed until the font is closed.\n   This is required if `TTF_PROP_FONT_CREATE_FILENAME_STRING` and\n   `TTF_PROP_FONT_CREATE_EXISTING_FONT_POINTER` aren't set.\n - `TTF_PROP_FONT_CREATE_IOSTREAM_OFFSET_NUMBER`: the offset in the iostream\n   for the beginning of the font, defaults to 0.\n - `TTF_PROP_FONT_CREATE_IOSTREAM_AUTOCLOSE_BOOLEAN`: true if closing the\n   font should also close the associated SDL_IOStream.\n - `TTF_PROP_FONT_CREATE_SIZE_FLOAT`: the point size of the font. Some .fon\n   fonts will have several sizes embedded in the file, so the point size\n   becomes the index of choosing which size. If the value is too high, the\n   last indexed size will be the default.\n - `TTF_PROP_FONT_CREATE_FACE_NUMBER`: the face index of the font, if the\n   font contains multiple font faces.\n - `TTF_PROP_FONT_CREATE_HORIZONTAL_DPI_NUMBER`: the horizontal DPI to use\n   for font rendering, defaults to\n   `TTF_PROP_FONT_CREATE_VERTICAL_DPI_NUMBER` if set, or 72 otherwise.\n - `TTF_PROP_FONT_CREATE_VERTICAL_DPI_NUMBER`: the vertical DPI to use for\n   font rendering, defaults to `TTF_PROP_FONT_CREATE_HORIZONTAL_DPI_NUMBER`\n   if set, or 72 otherwise.\n - `TTF_PROP_FONT_CREATE_EXISTING_FONT_POINTER`: an optional TTF_Font that,\n   if set, will be used as the font data source and the initial size and\n   style of the new font.\n\n **Parameter:** props the properties to use.\n **Returns:** a valid TTF_Font, or NULL on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CloseFont\n"]
    pub fn TTF_OpenFontWithProperties(props: SDL_PropertiesID) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = " Create a copy of an existing font.\n\n The copy will be distinct from the original, but will share the font file\n and have the same size and style as the original.\n\n When done with the returned TTF_Font, use TTF_CloseFont() to dispose of it.\n\n **Parameter:** existing_font the font to copy.\n **Returns:** a valid TTF_Font, or NULL on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               original font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CloseFont\n"]
    pub fn TTF_CopyFont(existing_font: *mut TTF_Font) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = " Get the properties associated with a font.\n\n The following read-write properties are provided by SDL:\n\n - `TTF_PROP_FONT_OUTLINE_LINE_CAP_NUMBER`: The FT_Stroker_LineCap value\n   used when setting the font outline, defaults to\n   `FT_STROKER_LINECAP_ROUND`.\n - `TTF_PROP_FONT_OUTLINE_LINE_JOIN_NUMBER`: The FT_Stroker_LineJoin value\n   used when setting the font outline, defaults to\n   `FT_STROKER_LINEJOIN_ROUND`.\n - `TTF_PROP_FONT_OUTLINE_MITER_LIMIT_NUMBER`: The FT_Fixed miter limit used\n   when setting the font outline, defaults to 0.\n\n **Parameter:** font the font to query.\n **Returns:** a valid property ID on success or 0 on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontProperties(font: *mut TTF_Font) -> SDL_PropertiesID;
}
unsafe extern "C" {
    #[doc = " Get the font generation.\n\n The generation is incremented each time font properties change that require\n rebuilding glyphs, such as style, size, etc.\n\n **Parameter:** font the font to query.\n **Returns:** the font generation or 0 on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontGeneration(font: *mut TTF_Font) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Add a fallback font.\n\n Add a font that will be used for glyphs that are not in the current font.\n The fallback font should have the same size and style as the current font.\n\n If there are multiple fallback fonts, they are used in the order added.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n **Parameter:** fallback the font to add as a fallback.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created\n               both fonts.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_ClearFallbackFonts\n **See Also:** TTF_RemoveFallbackFont\n"]
    pub fn TTF_AddFallbackFont(font: *mut TTF_Font, fallback: *mut TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Remove a fallback font.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n **Parameter:** fallback the font to remove as a fallback.\n\n **Thread Safety:** This function should be called on the thread that created\n               both fonts.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_AddFallbackFont\n **See Also:** TTF_ClearFallbackFonts\n"]
    pub fn TTF_RemoveFallbackFont(font: *mut TTF_Font, fallback: *mut TTF_Font);
}
unsafe extern "C" {
    #[doc = " Remove all fallback fonts.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_AddFallbackFont\n **See Also:** TTF_RemoveFallbackFont\n"]
    pub fn TTF_ClearFallbackFonts(font: *mut TTF_Font);
}
unsafe extern "C" {
    #[doc = " Set a font's size dynamically.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n **Parameter:** font the font to resize.\n **Parameter:** ptsize the new point size.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontSize\n"]
    pub fn TTF_SetFontSize(font: *mut TTF_Font, ptsize: f32) -> bool;
}
unsafe extern "C" {
    #[doc = " Set font size dynamically with target resolutions, in dots per inch.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n **Parameter:** font the font to resize.\n **Parameter:** ptsize the new point size.\n **Parameter:** hdpi the target horizontal DPI.\n **Parameter:** vdpi the target vertical DPI.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontSize\n **See Also:** TTF_GetFontSizeDPI\n"]
    pub fn TTF_SetFontSizeDPI(
        font: *mut TTF_Font,
        ptsize: f32,
        hdpi: core::ffi::c_int,
        vdpi: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the size of a font.\n\n **Parameter:** font the font to query.\n **Returns:** the size of the font, or 0.0f on failure; call SDL_GetError() for\n          more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontSize\n **See Also:** TTF_SetFontSizeDPI\n"]
    pub fn TTF_GetFontSize(font: *mut TTF_Font) -> f32;
}
unsafe extern "C" {
    #[doc = " Get font target resolutions, in dots per inch.\n\n **Parameter:** font the font to query.\n **Parameter:** hdpi a pointer filled in with the target horizontal DPI.\n **Parameter:** vdpi a pointer filled in with the target vertical DPI.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontSizeDPI\n"]
    pub fn TTF_GetFontDPI(
        font: *mut TTF_Font,
        hdpi: *mut core::ffi::c_int,
        vdpi: *mut core::ffi::c_int,
    ) -> bool;
}
#[doc = " Font style flags for TTF_Font\n\n These are the flags which can be used to set the style of a font in\n SDL_ttf. A combination of these flags can be used with functions that set\n or query font style, such as TTF_SetFontStyle or TTF_GetFontStyle.\n\n **Available Since:** This datatype is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontStyle\n **See Also:** TTF_GetFontStyle\n"]
pub type TTF_FontStyleFlags = Uint32;
unsafe extern "C" {
    #[doc = " Set a font's current style.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n The font styles are a set of bit flags, OR'd together:\n\n - `TTF_STYLE_NORMAL` (is zero)\n - `TTF_STYLE_BOLD`\n - `TTF_STYLE_ITALIC`\n - `TTF_STYLE_UNDERLINE`\n - `TTF_STYLE_STRIKETHROUGH`\n\n **Parameter:** font the font to set a new style on.\n **Parameter:** style the new style values to set, OR'd together.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontStyle\n"]
    pub fn TTF_SetFontStyle(font: *mut TTF_Font, style: TTF_FontStyleFlags);
}
unsafe extern "C" {
    #[doc = " Query a font's current style.\n\n The font styles are a set of bit flags, OR'd together:\n\n - `TTF_STYLE_NORMAL` (is zero)\n - `TTF_STYLE_BOLD`\n - `TTF_STYLE_ITALIC`\n - `TTF_STYLE_UNDERLINE`\n - `TTF_STYLE_STRIKETHROUGH`\n\n **Parameter:** font the font to query.\n **Returns:** the current font style, as a set of bit flags.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontStyle\n"]
    pub fn TTF_GetFontStyle(font: *const TTF_Font) -> TTF_FontStyleFlags;
}
unsafe extern "C" {
    #[doc = " Set a font's current outline.\n\n This uses the font properties `TTF_PROP_FONT_OUTLINE_LINE_CAP_NUMBER`,\n `TTF_PROP_FONT_OUTLINE_LINE_JOIN_NUMBER`, and\n `TTF_PROP_FONT_OUTLINE_MITER_LIMIT_NUMBER` when setting the font outline.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n **Parameter:** font the font to set a new outline on.\n **Parameter:** outline positive outline value, 0 to default.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontOutline\n"]
    pub fn TTF_SetFontOutline(font: *mut TTF_Font, outline: core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = " Query a font's current outline.\n\n **Parameter:** font the font to query.\n **Returns:** the font's current outline value.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontOutline\n"]
    pub fn TTF_GetFontOutline(font: *const TTF_Font) -> core::ffi::c_int;
}
impl TTF_HintingFlags {
    pub const TTF_HINTING_INVALID: TTF_HintingFlags = TTF_HintingFlags(-1);
    #[doc = "< Normal hinting applies standard grid-fitting.\n"]
    pub const TTF_HINTING_NORMAL: TTF_HintingFlags = TTF_HintingFlags(0);
    #[doc = "< Light hinting applies subtle adjustments to improve rendering.\n"]
    pub const TTF_HINTING_LIGHT: TTF_HintingFlags = TTF_HintingFlags(1);
    #[doc = "< Monochrome hinting adjusts the font for better rendering at lower resolutions.\n"]
    pub const TTF_HINTING_MONO: TTF_HintingFlags = TTF_HintingFlags(2);
    #[doc = "< No hinting, the font is rendered without any grid-fitting.\n"]
    pub const TTF_HINTING_NONE: TTF_HintingFlags = TTF_HintingFlags(3);
    #[doc = "< Light hinting with subpixel rendering for more precise font edges.\n"]
    pub const TTF_HINTING_LIGHT_SUBPIXEL: TTF_HintingFlags = TTF_HintingFlags(4);
}
#[repr(transparent)]
#[doc = " Hinting flags for TTF (TrueType Fonts)\n\n This enum specifies the level of hinting to be applied to the font\n rendering. The hinting level determines how much the font's outlines are\n adjusted for better alignment on the pixel grid.\n\n **Available Since:** This enum is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontHinting\n **See Also:** TTF_GetFontHinting\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_HintingFlags(pub core::ffi::c_int);
unsafe extern "C" {
    #[doc = " Set a font's current hinter setting.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n The hinter setting is a single value:\n\n - `TTF_HINTING_NORMAL`\n - `TTF_HINTING_LIGHT`\n - `TTF_HINTING_MONO`\n - `TTF_HINTING_NONE`\n - `TTF_HINTING_LIGHT_SUBPIXEL` (available in SDL_ttf 3.0.0 and later)\n\n **Parameter:** font the font to set a new hinter setting on.\n **Parameter:** hinting the new hinter setting.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontHinting\n"]
    pub fn TTF_SetFontHinting(font: *mut TTF_Font, hinting: TTF_HintingFlags);
}
unsafe extern "C" {
    #[doc = " Query the number of faces of a font.\n\n **Parameter:** font the font to query.\n **Returns:** the number of FreeType font faces.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetNumFontFaces(font: *const TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query a font's current FreeType hinter setting.\n\n The hinter setting is a single value:\n\n - `TTF_HINTING_NORMAL`\n - `TTF_HINTING_LIGHT`\n - `TTF_HINTING_MONO`\n - `TTF_HINTING_NONE`\n - `TTF_HINTING_LIGHT_SUBPIXEL` (available in SDL_ttf 3.0.0 and later)\n\n **Parameter:** font the font to query.\n **Returns:** the font's current hinter value, or TTF_HINTING_INVALID if the\n          font is invalid.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontHinting\n"]
    pub fn TTF_GetFontHinting(font: *const TTF_Font) -> TTF_HintingFlags;
}
unsafe extern "C" {
    #[doc = " Enable Signed Distance Field rendering for a font.\n\n SDF is a technique that helps fonts look sharp even when scaling and\n rotating, and requires special shader support for display.\n\n This works with Blended APIs, and generates the raw signed distance values\n in the alpha channel of the resulting texture.\n\n This updates any TTF_Text objects using this font, and clears\n already-generated glyphs, if any, from the cache.\n\n **Parameter:** font the font to set SDF support on.\n **Parameter:** enabled true to enable SDF, false to disable.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontSDF\n"]
    pub fn TTF_SetFontSDF(font: *mut TTF_Font, enabled: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " Query whether Signed Distance Field rendering is enabled for a font.\n\n **Parameter:** font the font to query.\n **Returns:** true if enabled, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontSDF\n"]
    pub fn TTF_GetFontSDF(font: *const TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Query a font's weight, in terms of the lightness/heaviness of the strokes.\n\n **Parameter:** font the font to query.\n **Returns:** the font's current weight.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.2.2.\n"]
    pub fn TTF_GetFontWeight(font: *const TTF_Font) -> core::ffi::c_int;
}
impl TTF_HorizontalAlignment {
    pub const TTF_HORIZONTAL_ALIGN_INVALID: TTF_HorizontalAlignment = TTF_HorizontalAlignment(-1);
    pub const TTF_HORIZONTAL_ALIGN_LEFT: TTF_HorizontalAlignment = TTF_HorizontalAlignment(0);
    pub const TTF_HORIZONTAL_ALIGN_CENTER: TTF_HorizontalAlignment = TTF_HorizontalAlignment(1);
    pub const TTF_HORIZONTAL_ALIGN_RIGHT: TTF_HorizontalAlignment = TTF_HorizontalAlignment(2);
}
#[repr(transparent)]
#[doc = " The horizontal alignment used when rendering wrapped text.\n\n **Available Since:** This enum is available since SDL_ttf 3.0.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_HorizontalAlignment(pub core::ffi::c_int);
unsafe extern "C" {
    #[doc = " Set a font's current wrap alignment option.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to set a new wrap alignment option on.\n **Parameter:** align the new wrap alignment option.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontWrapAlignment\n"]
    pub fn TTF_SetFontWrapAlignment(font: *mut TTF_Font, align: TTF_HorizontalAlignment);
}
unsafe extern "C" {
    #[doc = " Query a font's current wrap alignment option.\n\n **Parameter:** font the font to query.\n **Returns:** the font's current wrap alignment option.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontWrapAlignment\n"]
    pub fn TTF_GetFontWrapAlignment(font: *const TTF_Font) -> TTF_HorizontalAlignment;
}
unsafe extern "C" {
    #[doc = " Query the total height of a font.\n\n This is usually equal to point size.\n\n **Parameter:** font the font to query.\n **Returns:** the font's height.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontHeight(font: *const TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query the offset from the baseline to the top of a font.\n\n This is a positive value, relative to the baseline.\n\n **Parameter:** font the font to query.\n **Returns:** the font's ascent.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontAscent(font: *const TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Query the offset from the baseline to the bottom of a font.\n\n This is a negative value, relative to the baseline.\n\n **Parameter:** font the font to query.\n **Returns:** the font's descent.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontDescent(font: *const TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Set the spacing between lines of text for a font.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n **Parameter:** lineskip the new line spacing for the font.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontLineSkip\n"]
    pub fn TTF_SetFontLineSkip(font: *mut TTF_Font, lineskip: core::ffi::c_int);
}
unsafe extern "C" {
    #[doc = " Query the spacing between lines of text for a font.\n\n **Parameter:** font the font to query.\n **Returns:** the font's recommended spacing.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontLineSkip\n"]
    pub fn TTF_GetFontLineSkip(font: *const TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Set if kerning is enabled for a font.\n\n Newly-opened fonts default to allowing kerning. This is generally a good\n policy unless you have a strong reason to disable it, as it tends to\n produce better rendering (with kerning disabled, some fonts might render\n the word `kerning` as something that looks like `keming` for example).\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to set kerning on.\n **Parameter:** enabled true to enable kerning, false to disable.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetFontKerning\n"]
    pub fn TTF_SetFontKerning(font: *mut TTF_Font, enabled: bool);
}
unsafe extern "C" {
    #[doc = " Query whether or not kerning is enabled for a font.\n\n **Parameter:** font the font to query.\n **Returns:** true if kerning is enabled, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontKerning\n"]
    pub fn TTF_GetFontKerning(font: *const TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Query whether a font is fixed-width.\n\n A \"fixed-width\" font means all glyphs are the same width across; a\n lowercase 'i' will be the same size across as a capital 'W', for example.\n This is common for terminals and text editors, and other apps that treat\n text as a grid. Most other things (WYSIWYG word processors, web pages, etc)\n are more likely to not be fixed-width in most cases.\n\n **Parameter:** font the font to query.\n **Returns:** true if the font is fixed-width, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_FontIsFixedWidth(font: *const TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Query whether a font is scalable or not.\n\n Scalability lets us distinguish between outline and bitmap fonts.\n\n **Parameter:** font the font to query.\n **Returns:** true if the font is scalable, false otherwise.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontSDF\n"]
    pub fn TTF_FontIsScalable(font: *const TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Query a font's family name.\n\n This string is dictated by the contents of the font file.\n\n Note that the returned string is to internal storage, and should not be\n modified or free'd by the caller. The string becomes invalid, with the rest\n of the font, when `font` is handed to TTF_CloseFont().\n\n **Parameter:** font the font to query.\n **Returns:** the font's family name.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontFamilyName(font: *const TTF_Font) -> *const core::ffi::c_char;
}
unsafe extern "C" {
    #[doc = " Query a font's style name.\n\n This string is dictated by the contents of the font file.\n\n Note that the returned string is to internal storage, and should not be\n modified or free'd by the caller. The string becomes invalid, with the rest\n of the font, when `font` is handed to TTF_CloseFont().\n\n **Parameter:** font the font to query.\n **Returns:** the font's style name.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontStyleName(font: *const TTF_Font) -> *const core::ffi::c_char;
}
impl TTF_Direction {
    pub const TTF_DIRECTION_INVALID: TTF_Direction = TTF_Direction(0);
    #[doc = "< Left to Right\n"]
    pub const TTF_DIRECTION_LTR: TTF_Direction = TTF_Direction(4);
    #[doc = "< Right to Left\n"]
    pub const TTF_DIRECTION_RTL: TTF_Direction = TTF_Direction(5);
    #[doc = "< Top to Bottom\n"]
    pub const TTF_DIRECTION_TTB: TTF_Direction = TTF_Direction(6);
    #[doc = "< Bottom to Top\n"]
    pub const TTF_DIRECTION_BTT: TTF_Direction = TTF_Direction(7);
}
#[repr(transparent)]
#[doc = " Direction flags\n\n The values here are chosen to match\n [hb_direction_t](https://harfbuzz.github.io/harfbuzz-hb-common.html#hb-direction-t)\n .\n\n **Available Since:** This enum is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetFontDirection\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_Direction(pub core::ffi::c_uint);
unsafe extern "C" {
    #[doc = " Set the direction to be used for text shaping by a font.\n\n This function only supports left-to-right text shaping if SDL_ttf was not\n built with HarfBuzz support.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n **Parameter:** direction the new direction for text to flow.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_SetFontDirection(font: *mut TTF_Font, direction: TTF_Direction) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the direction to be used for text shaping by a font.\n\n This defaults to TTF_DIRECTION_INVALID if it hasn't been set.\n\n **Parameter:** font the font to query.\n **Returns:** the direction to be used for text shaping.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetFontDirection(font: *mut TTF_Font) -> TTF_Direction;
}
unsafe extern "C" {
    #[doc = " Set additional space in pixels to be applied between any two rendered\n characters.\n\n The spacing value is applied uniformly after each character, in addition to\n the normal glyph's advance.\n\n Spacing may be a negative value, in which case it will reduce the distance\n instead.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to specify a direction for.\n **Parameter:** spacing the new additional glyph spacing for the font.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.4.0.\n"]
    pub fn TTF_SetFontCharSpacing(font: *mut TTF_Font, spacing: core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the additional character spacing in pixels to be applied between any\n two rendered characters.\n\n This defaults to 0 if it hasn't been set.\n\n **Parameter:** font the font to query.\n **Returns:** the character spacing in pixels.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.4.0.\n"]
    pub fn TTF_GetFontCharSpacing(font: *mut TTF_Font) -> core::ffi::c_int;
}
unsafe extern "C" {
    #[doc = " Convert from a 4 character string to a 32-bit tag.\n\n **Parameter:** string the 4 character string to convert.\n **Returns:** the 32-bit representation of the string.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TagToString\n"]
    pub fn TTF_StringToTag(string: *const core::ffi::c_char) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Convert from a 32-bit tag to a 4 character string.\n\n **Parameter:** tag the 32-bit tag to convert.\n **Parameter:** string a pointer filled in with the 4 character representation of\n               the tag.\n **Parameter:** size the size of the buffer pointed at by string, should be at least\n             4.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TagToString\n"]
    pub fn TTF_TagToString(tag: Uint32, string: *mut core::ffi::c_char, size: usize);
}
unsafe extern "C" {
    #[doc = " Set the script to be used for text shaping by a font.\n\n This returns false if SDL_ttf isn't built with HarfBuzz support.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to modify.\n **Parameter:** script an\n               [ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n               .\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_StringToTag\n"]
    pub fn TTF_SetFontScript(font: *mut TTF_Font, script: Uint32) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the script used for text shaping a font.\n\n **Parameter:** font the font to query.\n **Returns:** an\n          [ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n          or 0 if a script hasn't been set.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TagToString\n"]
    pub fn TTF_GetFontScript(font: *mut TTF_Font) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Get the script used by a 32-bit codepoint.\n\n **Parameter:** ch the character code to check.\n **Returns:** an\n          [ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n          on success, or 0 on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function is thread-safe.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TagToString\n"]
    pub fn TTF_GetGlyphScript(ch: Uint32) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Set language to be used for text shaping by a font.\n\n If SDL_ttf was not built with HarfBuzz support, this function returns\n false.\n\n This updates any TTF_Text objects using this font.\n\n **Parameter:** font the font to specify a language for.\n **Parameter:** language_bcp47 a null-terminated string containing the desired\n                       language's BCP47 code. Or null to reset the value.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_SetFontLanguage(
        font: *mut TTF_Font,
        language_bcp47: *const core::ffi::c_char,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Check whether a glyph is provided by the font for a UNICODE codepoint.\n\n **Parameter:** font the font to query.\n **Parameter:** ch the codepoint to check.\n **Returns:** true if font provides a glyph for this character, false if not.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_FontHasGlyph(font: *mut TTF_Font, ch: Uint32) -> bool;
}
impl TTF_ImageType {
    pub const TTF_IMAGE_INVALID: TTF_ImageType = TTF_ImageType(0);
    #[doc = "< The color channels are white\n"]
    pub const TTF_IMAGE_ALPHA: TTF_ImageType = TTF_ImageType(1);
    #[doc = "< The color channels have image data\n"]
    pub const TTF_IMAGE_COLOR: TTF_ImageType = TTF_ImageType(2);
    #[doc = "< The alpha channel has signed distance field information\n"]
    pub const TTF_IMAGE_SDF: TTF_ImageType = TTF_ImageType(3);
}
#[repr(transparent)]
#[doc = " The type of data in a glyph image\n\n **Available Since:** This enum is available since SDL_ttf 3.0.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_ImageType(pub core::ffi::c_uint);
unsafe extern "C" {
    #[doc = " Get the pixel image for a UNICODE codepoint.\n\n **Parameter:** font the font to query.\n **Parameter:** ch the codepoint to check.\n **Parameter:** image_type a pointer filled in with the glyph image type, may be\n                   NULL.\n **Returns:** an SDL_Surface containing the glyph, or NULL on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetGlyphImage(
        font: *mut TTF_Font,
        ch: Uint32,
        image_type: *mut TTF_ImageType,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Get the pixel image for a character index.\n\n This is useful for text engine implementations, which can call this with\n the `glyph_index` in a TTF_CopyOperation\n\n **Parameter:** font the font to query.\n **Parameter:** glyph_index the index of the glyph to return.\n **Parameter:** image_type a pointer filled in with the glyph image type, may be\n                   NULL.\n **Returns:** an SDL_Surface containing the glyph, or NULL on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetGlyphImageForIndex(
        font: *mut TTF_Font,
        glyph_index: Uint32,
        image_type: *mut TTF_ImageType,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Query the metrics (dimensions) of a font's glyph for a UNICODE codepoint.\n\n To understand what these metrics mean, here is a useful link:\n\n https://freetype.sourceforge.net/freetype2/docs/tutorial/step2.html\n\n **Parameter:** font the font to query.\n **Parameter:** ch the codepoint to check.\n **Parameter:** minx a pointer filled in with the minimum x coordinate of the glyph\n             from the left edge of its bounding box. This value may be\n             negative.\n **Parameter:** maxx a pointer filled in with the maximum x coordinate of the glyph\n             from the left edge of its bounding box.\n **Parameter:** miny a pointer filled in with the minimum y coordinate of the glyph\n             from the bottom edge of its bounding box. This value may be\n             negative.\n **Parameter:** maxy a pointer filled in with the maximum y coordinate of the glyph\n             from the bottom edge of its bounding box.\n **Parameter:** advance a pointer filled in with the distance to the next glyph from\n                the left edge of this glyph's bounding box.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetGlyphMetrics(
        font: *mut TTF_Font,
        ch: Uint32,
        minx: *mut core::ffi::c_int,
        maxx: *mut core::ffi::c_int,
        miny: *mut core::ffi::c_int,
        maxy: *mut core::ffi::c_int,
        advance: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Query the kerning size between the glyphs of two UNICODE codepoints.\n\n **Parameter:** font the font to query.\n **Parameter:** previous_ch the previous codepoint.\n **Parameter:** ch the current codepoint.\n **Parameter:** kerning a pointer filled in with the kerning size between the two\n                glyphs, in pixels, may be NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetGlyphKerning(
        font: *mut TTF_Font,
        previous_ch: Uint32,
        ch: Uint32,
        kerning: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Calculate the dimensions of a rendered string of UTF-8 text.\n\n This will report the width and height, in pixels, of the space that the\n specified string will take to fully render.\n\n **Parameter:** font the font to query.\n **Parameter:** text text to calculate, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** w will be filled with width, in pixels, on return.\n **Parameter:** h will be filled with height, in pixels, on return.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetStringSize(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        w: *mut core::ffi::c_int,
        h: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Calculate the dimensions of a rendered string of UTF-8 text.\n\n This will report the width and height, in pixels, of the space that the\n specified string will take to fully render.\n\n Text is wrapped to multiple lines on line endings and on word boundaries if\n it extends beyond `wrap_width` in pixels.\n\n If wrap_width is 0, this function will only wrap on newline characters.\n\n **Parameter:** font the font to query.\n **Parameter:** text text to calculate, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** wrap_width the maximum width or 0 to wrap on newline characters.\n **Parameter:** w will be filled with width, in pixels, on return.\n **Parameter:** h will be filled with height, in pixels, on return.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetStringSizeWrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        wrap_width: core::ffi::c_int,
        w: *mut core::ffi::c_int,
        h: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Calculate how much of a UTF-8 string will fit in a given width.\n\n This reports the number of characters that can be rendered before reaching\n `max_width`.\n\n This does not need to render the string to do this calculation.\n\n **Parameter:** font the font to query.\n **Parameter:** text text to calculate, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** max_width maximum width, in pixels, available for the string, or 0\n                  for unbounded width.\n **Parameter:** measured_width a pointer filled in with the width, in pixels, of the\n                       string that will fit, may be NULL.\n **Parameter:** measured_length a pointer filled in with the length, in bytes, of\n                        the string that will fit, may be NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_MeasureString(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        max_width: core::ffi::c_int,
        measured_width: *mut core::ffi::c_int,
        measured_length: *mut usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Render UTF-8 text at fast quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the colorkey, giving a transparent background. The 1 pixel\n will be set to the text color.\n\n This will not word-wrap the string; you'll get a surface with a single line\n of text, as long as the string requires. You can use\n TTF_RenderText_Solid_Wrapped() instead if you need to wrap the output to\n multiple lines.\n\n This will not wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Shaded,\n TTF_RenderText_Blended, and TTF_RenderText_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended\n **See Also:** TTF_RenderText_LCD\n **See Also:** TTF_RenderText_Shaded\n **See Also:** TTF_RenderText_Solid\n **See Also:** TTF_RenderText_Solid_Wrapped\n"]
    pub fn TTF_RenderText_Solid(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render word-wrapped UTF-8 text at fast quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the colorkey, giving a transparent background. The 1 pixel\n will be set to the text color.\n\n Text is wrapped to multiple lines on line endings and on word boundaries if\n it extends beyond `wrapLength` in pixels.\n\n If wrapLength is 0, this function will only wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Shaded_Wrapped,\n TTF_RenderText_Blended_Wrapped, and TTF_RenderText_LCD_Wrapped.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** wrapLength the maximum width of the text surface or 0 to wrap on\n                   newline characters.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended_Wrapped\n **See Also:** TTF_RenderText_LCD_Wrapped\n **See Also:** TTF_RenderText_Shaded_Wrapped\n **See Also:** TTF_RenderText_Solid\n"]
    pub fn TTF_RenderText_Solid_Wrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        wrapLength: core::ffi::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render a single 32-bit glyph at fast quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the colorkey, giving a transparent background. The 1 pixel\n will be set to the text color.\n\n The glyph is rendered without any padding or centering in the X direction,\n and aligned normally in the Y direction.\n\n You can render at other quality levels with TTF_RenderGlyph_Shaded,\n TTF_RenderGlyph_Blended, and TTF_RenderGlyph_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** ch the character to render.\n **Parameter:** fg the foreground color for the text.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderGlyph_Blended\n **See Also:** TTF_RenderGlyph_LCD\n **See Also:** TTF_RenderGlyph_Shaded\n"]
    pub fn TTF_RenderGlyph_Solid(
        font: *mut TTF_Font,
        ch: Uint32,
        fg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render UTF-8 text at high quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the specified background color, while other pixels have\n varying degrees of the foreground color. This function returns the new\n surface, or NULL if there was an error.\n\n This will not word-wrap the string; you'll get a surface with a single line\n of text, as long as the string requires. You can use\n TTF_RenderText_Shaded_Wrapped() instead if you need to wrap the output to\n multiple lines.\n\n This will not wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid,\n TTF_RenderText_Blended, and TTF_RenderText_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended\n **See Also:** TTF_RenderText_LCD\n **See Also:** TTF_RenderText_Shaded_Wrapped\n **See Also:** TTF_RenderText_Solid\n"]
    pub fn TTF_RenderText_Shaded(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        bg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render word-wrapped UTF-8 text at high quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the specified background color, while other pixels have\n varying degrees of the foreground color. This function returns the new\n surface, or NULL if there was an error.\n\n Text is wrapped to multiple lines on line endings and on word boundaries if\n it extends beyond `wrap_width` in pixels.\n\n If wrap_width is 0, this function will only wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid_Wrapped,\n TTF_RenderText_Blended_Wrapped, and TTF_RenderText_LCD_Wrapped.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Parameter:** wrap_width the maximum width of the text surface or 0 to wrap on\n                   newline characters.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended_Wrapped\n **See Also:** TTF_RenderText_LCD_Wrapped\n **See Also:** TTF_RenderText_Shaded\n **See Also:** TTF_RenderText_Solid_Wrapped\n"]
    pub fn TTF_RenderText_Shaded_Wrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        bg: SDL_Color,
        wrap_width: core::ffi::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render a single UNICODE codepoint at high quality to a new 8-bit surface.\n\n This function will allocate a new 8-bit, palettized surface. The surface's\n 0 pixel will be the specified background color, while other pixels have\n varying degrees of the foreground color. This function returns the new\n surface, or NULL if there was an error.\n\n The glyph is rendered without any padding or centering in the X direction,\n and aligned normally in the Y direction.\n\n You can render at other quality levels with TTF_RenderGlyph_Solid,\n TTF_RenderGlyph_Blended, and TTF_RenderGlyph_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** ch the codepoint to render.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Returns:** a new 8-bit, palettized surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderGlyph_Blended\n **See Also:** TTF_RenderGlyph_LCD\n **See Also:** TTF_RenderGlyph_Solid\n"]
    pub fn TTF_RenderGlyph_Shaded(
        font: *mut TTF_Font,
        ch: Uint32,
        fg: SDL_Color,
        bg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render UTF-8 text at high quality to a new ARGB surface.\n\n This function will allocate a new 32-bit, ARGB surface, using alpha\n blending to dither the font with the given color. This function returns the\n new surface, or NULL if there was an error.\n\n This will not word-wrap the string; you'll get a surface with a single line\n of text, as long as the string requires. You can use\n TTF_RenderText_Blended_Wrapped() instead if you need to wrap the output to\n multiple lines.\n\n This will not wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid,\n TTF_RenderText_Shaded, and TTF_RenderText_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended_Wrapped\n **See Also:** TTF_RenderText_LCD\n **See Also:** TTF_RenderText_Shaded\n **See Also:** TTF_RenderText_Solid\n"]
    pub fn TTF_RenderText_Blended(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render word-wrapped UTF-8 text at high quality to a new ARGB surface.\n\n This function will allocate a new 32-bit, ARGB surface, using alpha\n blending to dither the font with the given color. This function returns the\n new surface, or NULL if there was an error.\n\n Text is wrapped to multiple lines on line endings and on word boundaries if\n it extends beyond `wrap_width` in pixels.\n\n If wrap_width is 0, this function will only wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid_Wrapped,\n TTF_RenderText_Shaded_Wrapped, and TTF_RenderText_LCD_Wrapped.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** wrap_width the maximum width of the text surface or 0 to wrap on\n                   newline characters.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended\n **See Also:** TTF_RenderText_LCD_Wrapped\n **See Also:** TTF_RenderText_Shaded_Wrapped\n **See Also:** TTF_RenderText_Solid_Wrapped\n"]
    pub fn TTF_RenderText_Blended_Wrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        wrap_width: core::ffi::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render a single UNICODE codepoint at high quality to a new ARGB surface.\n\n This function will allocate a new 32-bit, ARGB surface, using alpha\n blending to dither the font with the given color. This function returns the\n new surface, or NULL if there was an error.\n\n The glyph is rendered without any padding or centering in the X direction,\n and aligned normally in the Y direction.\n\n You can render at other quality levels with TTF_RenderGlyph_Solid,\n TTF_RenderGlyph_Shaded, and TTF_RenderGlyph_LCD.\n\n **Parameter:** font the font to render with.\n **Parameter:** ch the codepoint to render.\n **Parameter:** fg the foreground color for the text.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderGlyph_LCD\n **See Also:** TTF_RenderGlyph_Shaded\n **See Also:** TTF_RenderGlyph_Solid\n"]
    pub fn TTF_RenderGlyph_Blended(
        font: *mut TTF_Font,
        ch: Uint32,
        fg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render UTF-8 text at LCD subpixel quality to a new ARGB surface.\n\n This function will allocate a new 32-bit, ARGB surface, and render\n alpha-blended text using FreeType's LCD subpixel rendering. This function\n returns the new surface, or NULL if there was an error.\n\n This will not word-wrap the string; you'll get a surface with a single line\n of text, as long as the string requires. You can use\n TTF_RenderText_LCD_Wrapped() instead if you need to wrap the output to\n multiple lines.\n\n This will not wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid,\n TTF_RenderText_Shaded, and TTF_RenderText_Blended.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended\n **See Also:** TTF_RenderText_LCD_Wrapped\n **See Also:** TTF_RenderText_Shaded\n **See Also:** TTF_RenderText_Solid\n"]
    pub fn TTF_RenderText_LCD(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        bg: SDL_Color,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render word-wrapped UTF-8 text at LCD subpixel quality to a new ARGB\n surface.\n\n This function will allocate a new 32-bit, ARGB surface, and render\n alpha-blended text using FreeType's LCD subpixel rendering. This function\n returns the new surface, or NULL if there was an error.\n\n Text is wrapped to multiple lines on line endings and on word boundaries if\n it extends beyond `wrap_width` in pixels.\n\n If wrap_width is 0, this function will only wrap on newline characters.\n\n You can render at other quality levels with TTF_RenderText_Solid_Wrapped,\n TTF_RenderText_Shaded_Wrapped, and TTF_RenderText_Blended_Wrapped.\n\n **Parameter:** font the font to render with.\n **Parameter:** text text to render, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Parameter:** wrap_width the maximum width of the text surface or 0 to wrap on\n                   newline characters.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderText_Blended_Wrapped\n **See Also:** TTF_RenderText_LCD\n **See Also:** TTF_RenderText_Shaded_Wrapped\n **See Also:** TTF_RenderText_Solid_Wrapped\n"]
    pub fn TTF_RenderText_LCD_Wrapped(
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
        fg: SDL_Color,
        bg: SDL_Color,
        wrap_width: core::ffi::c_int,
    ) -> *mut SDL_Surface;
}
unsafe extern "C" {
    #[doc = " Render a single UNICODE codepoint at LCD subpixel quality to a new ARGB\n surface.\n\n This function will allocate a new 32-bit, ARGB surface, and render\n alpha-blended text using FreeType's LCD subpixel rendering. This function\n returns the new surface, or NULL if there was an error.\n\n The glyph is rendered without any padding or centering in the X direction,\n and aligned normally in the Y direction.\n\n You can render at other quality levels with TTF_RenderGlyph_Solid,\n TTF_RenderGlyph_Shaded, and TTF_RenderGlyph_Blended.\n\n **Parameter:** font the font to render with.\n **Parameter:** ch the codepoint to render.\n **Parameter:** fg the foreground color for the text.\n **Parameter:** bg the background color for the text.\n **Returns:** a new 32-bit, ARGB surface, or NULL if there was an error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_RenderGlyph_Blended\n **See Also:** TTF_RenderGlyph_Shaded\n **See Also:** TTF_RenderGlyph_Solid\n"]
    pub fn TTF_RenderGlyph_LCD(
        font: *mut TTF_Font,
        ch: Uint32,
        fg: SDL_Color,
        bg: SDL_Color,
    ) -> *mut SDL_Surface;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTF_TextEngine {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TTF_TextData {
    _unused: [u8; 0],
}
#[doc = " Text created with TTF_CreateText()\n\n **Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateText\n **See Also:** TTF_GetTextProperties\n **See Also:** TTF_DestroyText\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct TTF_Text {
    #[doc = "< A copy of the UTF-8 string that this text object represents, useful for layout, debugging and retrieving substring text. This is updated when the text object is modified and will be freed automatically when the object is destroyed.\n"]
    pub text: *mut core::ffi::c_char,
    #[doc = "< The number of lines in the text, 0 if it's empty\n"]
    pub num_lines: core::ffi::c_int,
    #[doc = "< Application reference count, used when freeing surface\n"]
    pub refcount: core::ffi::c_int,
    #[doc = "< Private\n"]
    pub internal: *mut TTF_TextData,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_Text"][::core::mem::size_of::<TTF_Text>() - 16usize];
    ["Alignment of TTF_Text"][::core::mem::align_of::<TTF_Text>() - 4usize];
    ["Offset of field: TTF_Text::text"][::core::mem::offset_of!(TTF_Text, text) - 0usize];
    ["Offset of field: TTF_Text::num_lines"][::core::mem::offset_of!(TTF_Text, num_lines) - 4usize];
    ["Offset of field: TTF_Text::refcount"][::core::mem::offset_of!(TTF_Text, refcount) - 8usize];
    ["Offset of field: TTF_Text::internal"][::core::mem::offset_of!(TTF_Text, internal) - 12usize];
};
impl Default for TTF_Text {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Create a text engine for drawing text on SDL surfaces.\n\n **Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\n          for more information.\n\n **Thread Safety:** It is safe to call this function from any thread.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_DestroySurfaceTextEngine\n **See Also:** TTF_DrawSurfaceText\n"]
    pub fn TTF_CreateSurfaceTextEngine() -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = " Draw text to an SDL surface.\n\n `text` must have been created using a TTF_TextEngine from\n TTF_CreateSurfaceTextEngine().\n\n **Parameter:** text the text to draw.\n **Parameter:** x the x coordinate in pixels, positive from the left edge towards\n          the right.\n **Parameter:** y the y coordinate in pixels, positive from the top edge towards the\n          bottom.\n **Parameter:** surface the surface to draw on.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateSurfaceTextEngine\n **See Also:** TTF_CreateText\n"]
    pub fn TTF_DrawSurfaceText(
        text: *mut TTF_Text,
        x: core::ffi::c_int,
        y: core::ffi::c_int,
        surface: *mut SDL_Surface,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Destroy a text engine created for drawing text on SDL surfaces.\n\n All text created by this engine should be destroyed before calling this\n function.\n\n **Parameter:** engine a TTF_TextEngine object created with\n               TTF_CreateSurfaceTextEngine().\n\n **Thread Safety:** This function should be called on the thread that created the\n               engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateSurfaceTextEngine\n"]
    pub fn TTF_DestroySurfaceTextEngine(engine: *mut TTF_TextEngine);
}
unsafe extern "C" {
    #[doc = " Create a text engine for drawing text on an SDL renderer.\n\n **Parameter:** renderer the renderer to use for creating textures and drawing text.\n **Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\n          for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               renderer.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_DestroyRendererTextEngine\n **See Also:** TTF_DrawRendererText\n **See Also:** TTF_CreateRendererTextEngineWithProperties\n"]
    pub fn TTF_CreateRendererTextEngine(renderer: *mut SDL_Renderer) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = " Create a text engine for drawing text on an SDL renderer, with the\n specified properties.\n\n These are the supported properties:\n\n - `TTF_PROP_RENDERER_TEXT_ENGINE_RENDERER_POINTER`: the renderer to use for\n   creating textures and drawing text\n - `TTF_PROP_RENDERER_TEXT_ENGINE_ATLAS_TEXTURE_SIZE_NUMBER`: the size of\n   the texture atlas\n\n **Parameter:** props the properties to use.\n **Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\n          for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               renderer.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateRendererTextEngine\n **See Also:** TTF_DestroyRendererTextEngine\n **See Also:** TTF_DrawRendererText\n"]
    pub fn TTF_CreateRendererTextEngineWithProperties(
        props: SDL_PropertiesID,
    ) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = " Draw text to an SDL renderer.\n\n `text` must have been created using a TTF_TextEngine from\n TTF_CreateRendererTextEngine(), and will draw using the renderer passed to\n that function.\n\n **Parameter:** text the text to draw.\n **Parameter:** x the x coordinate in pixels, positive from the left edge towards\n          the right.\n **Parameter:** y the y coordinate in pixels, positive from the top edge towards the\n          bottom.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateRendererTextEngine\n **See Also:** TTF_CreateText\n"]
    pub fn TTF_DrawRendererText(text: *mut TTF_Text, x: f32, y: f32) -> bool;
}
unsafe extern "C" {
    #[doc = " Destroy a text engine created for drawing text on an SDL renderer.\n\n All text created by this engine should be destroyed before calling this\n function.\n\n **Parameter:** engine a TTF_TextEngine object created with\n               TTF_CreateRendererTextEngine().\n\n **Thread Safety:** This function should be called on the thread that created the\n               engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateRendererTextEngine\n"]
    pub fn TTF_DestroyRendererTextEngine(engine: *mut TTF_TextEngine);
}
unsafe extern "C" {
    #[doc = " Create a text engine for drawing text with the SDL GPU API.\n\n **Parameter:** device the SDL_GPUDevice to use for creating textures and drawing\n               text.\n **Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\n          for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               device.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateGPUTextEngineWithProperties\n **See Also:** TTF_DestroyGPUTextEngine\n **See Also:** TTF_GetGPUTextDrawData\n"]
    pub fn TTF_CreateGPUTextEngine(device: *mut SDL_GPUDevice) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = " Create a text engine for drawing text with the SDL GPU API, with the\n specified properties.\n\n These are the supported properties:\n\n - `TTF_PROP_GPU_TEXT_ENGINE_DEVICE_POINTER`: the SDL_GPUDevice to use for\n   creating textures and drawing text.\n - `TTF_PROP_GPU_TEXT_ENGINE_ATLAS_TEXTURE_SIZE_NUMBER`: the size of the\n   texture atlas\n\n **Parameter:** props the properties to use.\n **Returns:** a TTF_TextEngine object or NULL on failure; call SDL_GetError()\n          for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               device.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateGPUTextEngine\n **See Also:** TTF_DestroyGPUTextEngine\n **See Also:** TTF_GetGPUTextDrawData\n"]
    pub fn TTF_CreateGPUTextEngineWithProperties(props: SDL_PropertiesID) -> *mut TTF_TextEngine;
}
#[doc = " Draw sequence returned by TTF_GetGPUTextDrawData\n\n **Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetGPUTextDrawData\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct TTF_GPUAtlasDrawSequence {
    #[doc = "< Texture atlas that stores the glyphs\n"]
    pub atlas_texture: *mut SDL_GPUTexture,
    #[doc = "< An array of vertex positions\n"]
    pub xy: *mut SDL_FPoint,
    #[doc = "< An array of normalized texture coordinates for each vertex\n"]
    pub uv: *mut SDL_FPoint,
    #[doc = "< Number of vertices\n"]
    pub num_vertices: core::ffi::c_int,
    #[doc = "< An array of indices into the 'vertices' arrays\n"]
    pub indices: *mut core::ffi::c_int,
    #[doc = "< Number of indices\n"]
    pub num_indices: core::ffi::c_int,
    #[doc = "< The image type of this draw sequence\n"]
    pub image_type: TTF_ImageType,
    #[doc = "< The next sequence (will be NULL in case of the last sequence)\n"]
    pub next: *mut TTF_GPUAtlasDrawSequence,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_GPUAtlasDrawSequence"]
        [::core::mem::size_of::<TTF_GPUAtlasDrawSequence>() - 32usize];
    ["Alignment of TTF_GPUAtlasDrawSequence"]
        [::core::mem::align_of::<TTF_GPUAtlasDrawSequence>() - 4usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::atlas_texture"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, atlas_texture) - 0usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::xy"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, xy) - 4usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::uv"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, uv) - 8usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::num_vertices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, num_vertices) - 12usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::indices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, indices) - 16usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::num_indices"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, num_indices) - 20usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::image_type"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, image_type) - 24usize];
    ["Offset of field: TTF_GPUAtlasDrawSequence::next"]
        [::core::mem::offset_of!(TTF_GPUAtlasDrawSequence, next) - 28usize];
};
impl Default for TTF_GPUAtlasDrawSequence {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    #[doc = " Get the geometry data needed for drawing the text.\n\n `text` must have been created using a TTF_TextEngine from\n TTF_CreateGPUTextEngine().\n\n The positive X-axis is taken towards the right and the positive Y-axis is\n taken upwards for both the vertex and the texture coordinates, i.e, it\n follows the same convention used by the SDL_GPU API. If you want to use a\n different coordinate system you will need to transform the vertices\n yourself.\n\n If the text looks blocky use linear filtering.\n\n **Parameter:** text the text to draw.\n **Returns:** a NULL terminated linked list of TTF_GPUAtlasDrawSequence objects\n          or NULL if the passed text is empty or in case of failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateGPUTextEngine\n **See Also:** TTF_CreateText\n"]
    pub fn TTF_GetGPUTextDrawData(text: *mut TTF_Text) -> *mut TTF_GPUAtlasDrawSequence;
}
unsafe extern "C" {
    #[doc = " Destroy a text engine created for drawing text with the SDL GPU API.\n\n All text created by this engine should be destroyed before calling this\n function.\n\n **Parameter:** engine a TTF_TextEngine object created with\n               TTF_CreateGPUTextEngine().\n\n **Thread Safety:** This function should be called on the thread that created the\n               engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_CreateGPUTextEngine\n"]
    pub fn TTF_DestroyGPUTextEngine(engine: *mut TTF_TextEngine);
}
impl TTF_GPUTextEngineWinding {
    pub const TTF_GPU_TEXTENGINE_WINDING_INVALID: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(-1);
    pub const TTF_GPU_TEXTENGINE_WINDING_CLOCKWISE: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(0);
    pub const TTF_GPU_TEXTENGINE_WINDING_COUNTER_CLOCKWISE: TTF_GPUTextEngineWinding =
        TTF_GPUTextEngineWinding(1);
}
#[repr(transparent)]
#[doc = " The winding order of the vertices returned by TTF_GetGPUTextDrawData\n\n **Available Since:** This enum is available since SDL_ttf 3.0.0.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TTF_GPUTextEngineWinding(pub core::ffi::c_int);
unsafe extern "C" {
    #[doc = " Sets the winding order of the vertices returned by TTF_GetGPUTextDrawData\n for a particular GPU text engine.\n\n **Parameter:** engine a TTF_TextEngine object created with\n               TTF_CreateGPUTextEngine().\n **Parameter:** winding the new winding order option.\n\n **Thread Safety:** This function should be called on the thread that created the\n               engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetGPUTextEngineWinding\n"]
    pub fn TTF_SetGPUTextEngineWinding(
        engine: *mut TTF_TextEngine,
        winding: TTF_GPUTextEngineWinding,
    );
}
unsafe extern "C" {
    #[doc = " Get the winding order of the vertices returned by TTF_GetGPUTextDrawData\n for a particular GPU text engine\n\n **Parameter:** engine a TTF_TextEngine object created with\n               TTF_CreateGPUTextEngine().\n **Returns:** the winding order used by the GPU text engine or\n          TTF_GPU_TEXTENGINE_WINDING_INVALID in case of error.\n\n **Thread Safety:** This function should be called on the thread that created the\n               engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetGPUTextEngineWinding\n"]
    pub fn TTF_GetGPUTextEngineWinding(engine: *const TTF_TextEngine) -> TTF_GPUTextEngineWinding;
}
unsafe extern "C" {
    #[doc = " Create a text object from UTF-8 text and a text engine.\n\n **Parameter:** engine the text engine to use when creating the text object, may be\n               NULL.\n **Parameter:** font the font to render with.\n **Parameter:** text the text to use, in UTF-8 encoding.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Returns:** a TTF_Text object or NULL on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               font and text engine.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_DestroyText\n"]
    pub fn TTF_CreateText(
        engine: *mut TTF_TextEngine,
        font: *mut TTF_Font,
        text: *const core::ffi::c_char,
        length: usize,
    ) -> *mut TTF_Text;
}
unsafe extern "C" {
    #[doc = " Get the properties associated with a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Returns:** a valid property ID on success or 0 on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetTextProperties(text: *mut TTF_Text) -> SDL_PropertiesID;
}
unsafe extern "C" {
    #[doc = " Set the text engine used by a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** engine the text engine to use for drawing.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextEngine\n"]
    pub fn TTF_SetTextEngine(text: *mut TTF_Text, engine: *mut TTF_TextEngine) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the text engine used by a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Returns:** the TTF_TextEngine used by the text on success or NULL on failure;\n          call SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetTextEngine\n"]
    pub fn TTF_GetTextEngine(text: *mut TTF_Text) -> *mut TTF_TextEngine;
}
unsafe extern "C" {
    #[doc = " Set the font used by a text object.\n\n When a text object has a font, any changes to the font will automatically\n regenerate the text. If you set the font to NULL, the text will continue to\n render but changes to the font will no longer affect the text.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** font the font to use, may be NULL.\n **Returns:** false if the text pointer is null; otherwise, true. call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextFont\n"]
    pub fn TTF_SetTextFont(text: *mut TTF_Text, font: *mut TTF_Font) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the font used by a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Returns:** the TTF_Font used by the text on success or NULL on failure; call\n          SDL_GetError() for more information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetTextFont\n"]
    pub fn TTF_GetTextFont(text: *mut TTF_Text) -> *mut TTF_Font;
}
unsafe extern "C" {
    #[doc = " Set the direction to be used for text shaping a text object.\n\n This function only supports left-to-right text shaping if SDL_ttf was not\n built with HarfBuzz support.\n\n **Parameter:** text the text to modify.\n **Parameter:** direction the new direction for text to flow.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_SetTextDirection(text: *mut TTF_Text, direction: TTF_Direction) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the direction to be used for text shaping a text object.\n\n This defaults to the direction of the font used by the text object.\n\n **Parameter:** text the text to query.\n **Returns:** the direction to be used for text shaping.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetTextDirection(text: *mut TTF_Text) -> TTF_Direction;
}
unsafe extern "C" {
    #[doc = " Set the script to be used for text shaping a text object.\n\n This returns false if SDL_ttf isn't built with HarfBuzz support.\n\n **Parameter:** text the text to modify.\n **Parameter:** script an\n               [ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n               .\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_StringToTag\n"]
    pub fn TTF_SetTextScript(text: *mut TTF_Text, script: Uint32) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the script used for text shaping a text object.\n\n This defaults to the script of the font used by the text object.\n\n **Parameter:** text the text to query.\n **Returns:** an\n          [ISO 15924 code](https://unicode.org/iso15924/iso15924-codes.html)\n          or 0 if a script hasn't been set on either the text object or the\n          font.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TagToString\n"]
    pub fn TTF_GetTextScript(text: *mut TTF_Text) -> Uint32;
}
unsafe extern "C" {
    #[doc = " Set the color of a text object.\n\n The default text color is white (255, 255, 255, 255).\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** r the red color value in the range of 0-255.\n **Parameter:** g the green color value in the range of 0-255.\n **Parameter:** b the blue color value in the range of 0-255.\n **Parameter:** a the alpha value in the range of 0-255.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextColor\n **See Also:** TTF_SetTextColorFloat\n"]
    pub fn TTF_SetTextColor(text: *mut TTF_Text, r: Uint8, g: Uint8, b: Uint8, a: Uint8) -> bool;
}
unsafe extern "C" {
    #[doc = " Set the color of a text object.\n\n The default text color is white (1.0f, 1.0f, 1.0f, 1.0f).\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** r the red color value, normally in the range of 0-1.\n **Parameter:** g the green color value, normally in the range of 0-1.\n **Parameter:** b the blue color value, normally in the range of 0-1.\n **Parameter:** a the alpha value in the range of 0-1.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextColorFloat\n **See Also:** TTF_SetTextColor\n"]
    pub fn TTF_SetTextColorFloat(text: *mut TTF_Text, r: f32, g: f32, b: f32, a: f32) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the color of a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Parameter:** r a pointer filled in with the red color value in the range of\n          0-255, may be NULL.\n **Parameter:** g a pointer filled in with the green color value in the range of\n          0-255, may be NULL.\n **Parameter:** b a pointer filled in with the blue color value in the range of\n          0-255, may be NULL.\n **Parameter:** a a pointer filled in with the alpha value in the range of 0-255,\n          may be NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextColorFloat\n **See Also:** TTF_SetTextColor\n"]
    pub fn TTF_GetTextColor(
        text: *mut TTF_Text,
        r: *mut Uint8,
        g: *mut Uint8,
        b: *mut Uint8,
        a: *mut Uint8,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the color of a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Parameter:** r a pointer filled in with the red color value, normally in the\n          range of 0-1, may be NULL.\n **Parameter:** g a pointer filled in with the green color value, normally in the\n          range of 0-1, may be NULL.\n **Parameter:** b a pointer filled in with the blue color value, normally in the\n          range of 0-1, may be NULL.\n **Parameter:** a a pointer filled in with the alpha value in the range of 0-1, may\n          be NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextColor\n **See Also:** TTF_SetTextColorFloat\n"]
    pub fn TTF_GetTextColorFloat(
        text: *mut TTF_Text,
        r: *mut f32,
        g: *mut f32,
        b: *mut f32,
        a: *mut f32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Set the position of a text object.\n\n This can be used to position multiple text objects within a single wrapping\n text area.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** x the x offset of the upper left corner of this text in pixels.\n **Parameter:** y the y offset of the upper left corner of this text in pixels.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextPosition\n"]
    pub fn TTF_SetTextPosition(
        text: *mut TTF_Text,
        x: core::ffi::c_int,
        y: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the position of a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Parameter:** x a pointer filled in with the x offset of the upper left corner of\n          this text in pixels, may be NULL.\n **Parameter:** y a pointer filled in with the y offset of the upper left corner of\n          this text in pixels, may be NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetTextPosition\n"]
    pub fn TTF_GetTextPosition(
        text: *mut TTF_Text,
        x: *mut core::ffi::c_int,
        y: *mut core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Set whether wrapping is enabled on a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** wrap_width the maximum width in pixels, 0 to wrap on newline\n                   characters.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetTextWrapWidth\n"]
    pub fn TTF_SetTextWrapWidth(text: *mut TTF_Text, wrap_width: core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = " Get whether wrapping is enabled on a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Parameter:** wrap_width a pointer filled in with the maximum width in pixels or 0\n                   if the text is being wrapped on newline characters.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetTextWrapWidth\n"]
    pub fn TTF_GetTextWrapWidth(text: *mut TTF_Text, wrap_width: *mut core::ffi::c_int) -> bool;
}
unsafe extern "C" {
    #[doc = " Set whether whitespace should be visible when wrapping a text object.\n\n If the whitespace is visible, it will take up space for purposes of\n alignment and wrapping. This is good for editing, but looks better when\n centered or aligned if whitespace around line wrapping is hidden. This\n defaults false.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** visible true to show whitespace when wrapping text, false to hide\n                it.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_TextWrapWhitespaceVisible\n"]
    pub fn TTF_SetTextWrapWhitespaceVisible(text: *mut TTF_Text, visible: bool) -> bool;
}
unsafe extern "C" {
    #[doc = " Return whether whitespace is shown when wrapping a text object.\n\n **Parameter:** text the TTF_Text to query.\n **Returns:** true if whitespace is shown when wrapping text, or false\n          otherwise.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SetTextWrapWhitespaceVisible\n"]
    pub fn TTF_TextWrapWhitespaceVisible(text: *mut TTF_Text) -> bool;
}
unsafe extern "C" {
    #[doc = " Set the UTF-8 text used by a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** string the UTF-8 text to use, may be NULL.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_AppendTextString\n **See Also:** TTF_DeleteTextString\n **See Also:** TTF_InsertTextString\n"]
    pub fn TTF_SetTextString(
        text: *mut TTF_Text,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Insert UTF-8 text into a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** offset the offset, in bytes, from the beginning of the string if >=\n               0, the offset from the end of the string if < 0. Note that\n               this does not do UTF-8 validation, so you should only insert\n               at UTF-8 sequence boundaries.\n **Parameter:** string the UTF-8 text to insert.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_AppendTextString\n **See Also:** TTF_DeleteTextString\n **See Also:** TTF_SetTextString\n"]
    pub fn TTF_InsertTextString(
        text: *mut TTF_Text,
        offset: core::ffi::c_int,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Append UTF-8 text to a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** string the UTF-8 text to insert.\n **Parameter:** length the length of the text, in bytes, or 0 for null terminated\n               text.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_DeleteTextString\n **See Also:** TTF_InsertTextString\n **See Also:** TTF_SetTextString\n"]
    pub fn TTF_AppendTextString(
        text: *mut TTF_Text,
        string: *const core::ffi::c_char,
        length: usize,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Delete UTF-8 text from a text object.\n\n This function may cause the internal text representation to be rebuilt.\n\n **Parameter:** text the TTF_Text to modify.\n **Parameter:** offset the offset, in bytes, from the beginning of the string if >=\n               0, the offset from the end of the string if < 0. Note that\n               this does not do UTF-8 validation, so you should only delete\n               at UTF-8 sequence boundaries.\n **Parameter:** length the length of text to delete, in bytes, or -1 for the\n               remainder of the string.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_AppendTextString\n **See Also:** TTF_InsertTextString\n **See Also:** TTF_SetTextString\n"]
    pub fn TTF_DeleteTextString(
        text: *mut TTF_Text,
        offset: core::ffi::c_int,
        length: core::ffi::c_int,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Get the size of a text object.\n\n The size of the text may change when the font or font style and size\n change.\n\n **Parameter:** text the TTF_Text to query.\n **Parameter:** w a pointer filled in with the width of the text, in pixels, may be\n          NULL.\n **Parameter:** h a pointer filled in with the height of the text, in pixels, may be\n          NULL.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Thread Safety:** This function should be called on the thread that created the\n               text.\n\n **Available Since:** This function is available since SDL_ttf 3.0.0.\n"]
    pub fn TTF_GetTextSize(
        text: *mut TTF_Text,
        w: *mut core::ffi::c_int,
        h: *mut core::ffi::c_int,
    ) -> bool;
}
#[doc = " Flags for TTF_SubString\n\n **Available Since:** This datatype is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_SubString\n"]
pub type TTF_SubStringFlags = Uint32;
#[doc = " The representation of a substring within text.\n\n **Available Since:** This struct is available since SDL_ttf 3.0.0.\n\n **See Also:** TTF_GetNextTextSubString\n **See Also:** TTF_GetPreviousTextSubString\n **See Also:** TTF_GetTextSubString\n **See Also:** TTF_GetTextSubStringForLine\n **See Also:** TTF_GetTextSubStringForPoint\n **See Also:** TTF_GetTextSubStringsForRange\n"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash)]
pub struct TTF_SubString {
    #[doc = "< The flags for this substring\n"]
    pub flags: TTF_SubStringFlags,
    #[doc = "< The byte offset from the beginning of the text\n"]
    pub offset: core::ffi::c_int,
    #[doc = "< The byte length starting at the offset\n"]
    pub length: core::ffi::c_int,
    #[doc = "< The index of the line that contains this substring\n"]
    pub line_index: core::ffi::c_int,
    #[doc = "< The internal cluster index, used for quickly iterating\n"]
    pub cluster_index: core::ffi::c_int,
    #[doc = "< The rectangle, relative to the top left of the text, containing the substring\n"]
    pub rect: SDL_Rect,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TTF_SubString"][::core::mem::size_of::<TTF_SubString>() - 36usize];
    ["Alignment of TTF_SubString"][::core::mem::align_of::<TTF_SubString>() - 4usize];
    ["Offset of field: TTF_SubString::flags"]
        [::core::mem::offset_of!(TTF_SubString, flags) - 0usize];
    ["Offset of field: TTF_SubString::offset"]
        [::core::mem::offset_of!(TTF_SubString, offset) - 4usize];
    ["Offset of field: TTF_SubString::length"]
        [::core::mem::offset_of!(TTF_SubString, length) - 8usize];
    ["Offset of field: TTF_SubString::line_index"]
        [::core::mem::offset_of!(TTF_SubString, line_index) - 12usize];
    ["Offset of field: TTF_SubString::cluster_index"]
        [::core::mem::offset_of!(TTF_SubString, cluster_index) - 16usize];
    ["Offset of field: TTF_SubString::rect"]
        [::core::mem::offset_of!(TTF_SubString, rect) - 20usize];
};
unsafe extern "C" {
