/* automatically generated by rust-bindgen 0.72.1 */

use sdl_sys_bindgen::*;

pub const SDL_IMAGE_MAJOR_VERSION: u32 = 3;
pub const SDL_IMAGE_MINOR_VERSION: u32 = 5;
pub const SDL_IMAGE_MICRO_VERSION: u32 = 0;
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_FILENAME_STRING: &[u8; 44] =
    b"SDL_image.animation_encoder.create.filename\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_IOSTREAM_POINTER: &[u8; 44] =
    b"SDL_image.animation_encoder.create.iostream\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_IOSTREAM_AUTOCLOSE_BOOLEAN: &[u8; 54] =
    b"SDL_image.animation_encoder.create.iostream.autoclose\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_TYPE_STRING: &[u8; 40] =
    b"SDL_image.animation_encoder.create.type\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_QUALITY_NUMBER: &[u8; 43] =
    b"SDL_image.animation_encoder.create.quality\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_TIMEBASE_NUMERATOR_NUMBER: &[u8; 54] =
    b"SDL_image.animation_encoder.create.timebase.numerator\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_TIMEBASE_DENOMINATOR_NUMBER: &[u8; 56] =
    b"SDL_image.animation_encoder.create.timebase.denominator\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_AVIF_MAX_THREADS_NUMBER: &[u8; 52] =
    b"SDL_image.animation_encoder.create.avif.max_threads\0";
pub const IMG_PROP_ANIMATION_ENCODER_CREATE_AVIF_KEYFRAME_INTERVAL_NUMBER: &[u8; 58] =
    b"SDL_image.animation_encoder.create.avif.keyframe_interval\0";

    #[doc = " Save an SDL_Surface into TGA image data, via an SDL_IOStream.\n\n If you just want to save to a filename, you can use IMG_SaveTGA() instead.\n\n If `closeio` is true, `dst` will be closed before returning, whether this\n function succeeds or not.\n\n **Parameter:** surface the SDL surface to save.\n **Parameter:** dst the SDL_IOStream to save the image data to.\n **Parameter:** closeio true to close/free the SDL_IOStream before returning, false\n                to leave it open.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Available Since:** This function is available since SDL_image 3.4.0.\n\n **See Also:** IMG_SaveTGA\n"]
    pub fn IMG_SaveTGA_IO(surface: *mut SDL_Surface, dst: *mut SDL_IOStream, closeio: bool)
    -> bool;
}
unsafe extern "C" {
    #[doc = " Save an SDL_Surface into a WEBP image file.\n\n If the file already exists, it will be overwritten.\n\n **Parameter:** surface the SDL surface to save.\n **Parameter:** file path on the filesystem to write the new file to.\n **Parameter:** quality between 0 and 100. For lossy, 0 gives the smallest size and\n                100 the largest. For lossless, this parameter is the amount\n                of effort put into the compression: 0 is the fastest but\n                gives larger files compared to the slowest, but best, 100.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Available Since:** This function is available since SDL_image 3.4.0.\n\n **See Also:** IMG_SaveWEBP_IO\n"]
    pub fn IMG_SaveWEBP(
        surface: *mut SDL_Surface,
        file: *const core::ffi::c_char,
        quality: f32,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = " Save an SDL_Surface into WEBP image data, via an SDL_IOStream.\n\n If you just want to save to a filename, you can use IMG_SaveWEBP() instead.\n\n If `closeio` is true, `dst` will be closed before returning, whether this\n function succeeds or not.\n\n **Parameter:** surface the SDL surface to save.\n **Parameter:** dst the SDL_IOStream to save the image data to.\n **Parameter:** closeio true to close/free the SDL_IOStream before returning, false\n                to leave it open.\n **Parameter:** quality between 0 and 100. For lossy, 0 gives the smallest size and\n                100 the largest. For lossless, this parameter is the amount\n                of effort put into the compression: 0 is the fastest but\n                gives larger files compared to the slowest, but best, 100.\n **Returns:** true on success or false on failure; call SDL_GetError() for more\n          information.\n\n **Available Since:** This function is available since SDL_image 3.4.0.\n\n **See Also:** IMG_SaveWEBP\n"]
    pub fn IMG_SaveWEBP_IO(
        surface: *mut SDL_Surface,
        dst: *mut SDL_IOStream,
        closeio: bool,
        quality: f32,
    ) -> bool;
}
#[doc = " Animated image support\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash)]
pub struct IMG_Animation {
    #[doc = "< The width of the frames\n"]
    pub w: core::ffi::c_int,
    #[doc = "< The height of the frames\n"]
    pub h: core::ffi::c_int,
    #[doc = "< The number of frames\n"]
    pub count: core::ffi::c_int,
    #[doc = "< An array of frames\n"]
    pub frames: *mut *mut SDL_Surface,
    #[doc = "< An array of frame delays, in milliseconds\n"]
    pub delays: *mut core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of IMG_Animation"][::core::mem::size_of::<IMG_Animation>() - 20usize];
    ["Alignment of IMG_Animation"][::core::mem::align_of::<IMG_Animation>() - 4usize];
    ["Offset of field: IMG_Animation::w"][::core::mem::offset_of!(IMG_Animation, w) - 0usize];
    ["Offset of field: IMG_Animation::h"][::core::mem::offset_of!(IMG_Animation, h) - 4usize];
    ["Offset of field: IMG_Animation::count"]
        [::core::mem::offset_of!(IMG_Animation, count) - 8usize];
    ["Offset of field: IMG_Animation::frames"]
        [::core::mem::offset_of!(IMG_Animation, frames) - 12usize];
    ["Offset of field: IMG_Animation::delays"]
        [::core::mem::offset_of!(IMG_Animation, delays) - 16usize];
};
impl Default for IMG_Animation {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
